{
  "doc_id": "1420fd007b4cdf3c5271c4988f003583bf1d8f6d64ccf196fb98ea43a836fced",
  "file_path": "C:\\Users\\blain\\Dropbox\\Master_Court_Files\\10_Motions\\2025-11-06_Motioin to Set Aside Order Granting Court-Ordered Holiday Visitation.pdf",
  "file_name": "2025-11-06_Motioin to Set Aside Order Granting Court-Ordered Holiday Visitation.pdf",
  "doc_type": "pdf",
  "date": null,
  "parties": [],
  "raw_text": "DOCUMENT 424\nAlaFile E-Notice\n70-DR-2023-900051.01\nJudge: KEVIN HALL\nTo: DIANNE JAMES DAVIS MRS.\ndianne@diannedavislaw.com\nNOTICE OF ELECTRONIC FILING\nIN THE CIRCUIT COURT OF TALLAPOOSA COUNTY, ALABAMA\nCHRISTOPHER BLAINE MCGREGOR V. BRITTANY MICHELLE GILLILAND\n70-DR-2023-900051.01\nThe following matter was FILED on 11/6/2025 3:49:53 PM\nC001 MCGREGOR CHRISTOPHER BLAINE\nMOTION TO SET ASIDE ORDER GRANTING COURT-ORDERED HOLIDAY VISITATION\n[Filer: DAVIS DIANNE JAMES]\nNotice Date: 11/6/2025 3:49:53 PM\nPATRICK CRADDOCK\nCIRCUIT COURT CLERK\nTALLAPOOSA COUNTY, ALABAMA\n395 LEE STREET\nALEXANDER CITY, AL, 35010\n256-234-4361\npatrick.craddock@alacourt.gov\nDOCUMENT 421\nELECTRONICALLY FILED\n11/6/2025 3:49 PM\nSTATE OF ALABAMA Revised 3/5/08 Case No. 70-DR-2023-900051.01\nUnified Judicial System CIRCUIT COURT OF\nTALLAPOOSA COUNTY, ALABAMA\n70-TALLAPOOSA District Court Circuit Court DR202390005101\nPATRICK CRADDOCK, CLERK\nCIVIL MOTION COVER SHEET\nCHRISTOPHER BLAINE MCGREGOR V. BRITTANY\nName of Filing Party:C001 - MCGREGOR CHRISTOPHER BLAINE\nMICHELLE GILLILAND\nOral Arguments Requested\nName, Address, and Telephone No. of Attorney or Party. If Not Represented.\nDIANNE JAMES DAVIS MRS.\n107 MAIN STREET\nALEXANDER CITY, AL 35010\nAttorney Bar No.: DAV007\nTYPE OF MOTION\nMotions Requiring Fee Motions Not Requiring Fee\nDefault Judgment ($50.00) Add Party\nJoinder in Other Party's Dispositive Motion Amend\n(i.e.Summary Judgment, Judgment on the Pleadings,\nChange of Venue/Transfer\norother Dispositive Motion not pursuant to Rule 12(b))\n($50.00) Compel\nJudgment on the Pleadings ($50.00) Consolidation\nContinue\nMotion to Dismiss, or in the Alternative\nSummaryJudgment($50.00) Deposition\nRenewed Dispositive Motion(Summary Designate a Mediator\nJudgment,Judgment on the Pleadings, or other Judgment as a Matter of Law (during Trial)\nDispositiveMotion not pursuant to Rule 12(b)) ($50.00)\nDisburse Funds\nSummary Judgment pursuant to Rule 56($50.00)\nExtension of Time\nMotion to Intervene ($297.00)\nIn Limine\nOther\nJoinder\npursuant to Rule ($50.00)\nMore Definite Statement\n*Motion fees are enumerated in §12-19-71(a). Fees Motion to Dismiss pursuant to Rule 12(b)\npursuant to Local Act are not included. Please contact the\nNew Trial\nClerk of the Court regarding applicable local fees.\nObjection of Exemptions Claimed\nLocal Court Costs $ 0 Pendente Lite\nPlaintiff's Motion to Dismiss\nPreliminary Injunction\nProtective Order\nQuash\nRelease from Stay of Execution\nSanctions\nSever\nSpecial Practice in Alabama\nStay\nStrike\nSupplement to Pending Motion\nVacate or Modify\nWithdraw\nOther Motion to Set Aside Order Granting Court\n-Ordered Holiday Visitation\npursuant to Rule n/a (Subject to Filing Fee)\nCheck here if you have filed or are filing contemoraneously Date: Signature of Attorney or Party\nwith this motion an Affidavit of Substantial Hardship or if you\n/s/ DIANNE JAMES DAVIS MRS.\nare filing on behalf of an agency or department of the State, 11/6/2025 3:48:59 PM\ncounty, or municipal government. (Pursuant to §6-5-1 Code\nof Alabama (1975), governmental entities are exempt from\nprepayment of filing fees)\n*This Cover Sheet must be completed and submitted to the Clerk of Court upon the filing of any motion. Each motion should contain a separate Cover Sheet.\nDOCUMENT 421\n**Motions titled 'Motion to Dismiss' that are not pursuant to Rule 12(b) and are in fact Motions for Summary Judgments are subject to filing fee.\nDOCUMENT 422\nELECTRONICALLY FILED\n11/6/2025 3:49 PM\n70-DR-2023-900051.01\nCIRCUIT COURT OF\nTALLAPOOSA COUNTY, ALABAMA\nPATRICK CRADDOCK, CLERK\nIN THE CIRCUIT COURT OF TALLAPOOSA COUNTY, ALABAMA\nAT ALEXANDER CITY\nCHRISTOPHER BLAINE MCGREGOR )\nPLAINTIFF/RESPONDENT )\nVS. ) CASE NO. DR-2023-900051.01\nBRITTANY MICHELLE GILLILAND )\nDEFENDANT/PETITIONER )\nMOTION TO SET ASIDE ORDER GRANTING COURT-ORDERED HOLIDAY\nVISITATION\nComes now the Plaintiff/Respondent, Christopher Blaine McGregor, by and through his\nattorney of record, and files this Motion to Set Aside Order Granting Court-Ordered Holiday\nVisitation and would state as follows:\n1. That on November 6, 2024, this Court entered an Order as the result of a Contempt\nfiled by the Mother and a Counterclaim for Contempt filed by the Father, and after\nconducting an in camera interview with the minor child, A.K.M., dob, 05/24/2012\nthat stated “Following the in camera interview, counsel for both Parties, along with\nthe Court, agreed that proceeding with the show cause hearing was not appropriate\nat this time.” A copy of this Order is attached as Exhibit A.\n2. That in paragraph five (5), it states: …after 10 joint reunification therapy sessions\nwith the Mother and A.K., or, if earlier, when the specialist believes that the\nMother and A.K. have established a relationship sufficient to make the previously\nordered visitation beneficial to A.K.”.\n3. That in paragraph six (6) regarding weekly family dinners, which at a later date was\nchanged from Wednesday to Sunday, the Mother has failed to attend the twenty-six\n(26) Sunday/Weekly dinners since January 8, 2025. These dinners were set out so\nthe Mother and A.K. could work towards a better relationship.\nDOCUMENT 422\n4. That the minor child does not, on her own accord, wish to visit with the Mother in the\nMother’s home due to past physical abuse by the Mother.\n5. That in the transcript from the hearing on July 31, 2024, the minor child testified “I\njust can’t stay alone with her. I don’t know what people don’t understand about\nthat. I can’t. I’m scared”.\n6. That this Court entered an Order on April 14, 2025, that changed the Mother’s\nvisitation for the minor child B.M., dob, 05/10/2019, and further ordered the parties to\nresume family dinners or lunches and work around A.K.M.’s activities. A copy of this\nOrder is attached as Exhibit “B”.\n7. That the Mother could have given the “gifts” she has for A.K. at the family dinners if\nshe wanted her to have the gifts and wanted to build a bond and trust between herself\nand the minor child, A.K.; however, she apparently chose not to do this.\n8. That the Father too has been forced to incur attorney’s fees from the filing of this\nmotion, as he has not withheld visitation, as the Court has made it clear in prior\nOrders that A.K. did not have to visit EXCEPT FOR THE WEEKLY/SUNDAY\nDINNERS, which the mother does not attend on a regular basis.\n9. Furthermore, the Father had to file a Motion for Contempt against the Mother this\ndate as she continued to refuse to sign the necessary documents to allow the minor\nchild, A.K, to continue counseling with the counselor she has been seeing and has\nestablished a relationship with, even after this Court Ordered the child to continue\ncounseling. The counseling sessions are to help the minor child work towards a\nbetter relationship with her Mother.\nWHEREFORE, the premises considered, the Father requests this Court set aside the Order\nentered this date granting the Mother’s Motion for Court-Ordered Holiday Visitation and further that the\nCourt Order the Mother to pay the Father’s Attorney Fees in the amount of $500.00 as the result of having\nto file this Motion.\nDOCUMENT 422\nRespectfully submitted this the 6th day of November, 2025.\n/s/Dianne James Davis\nDianne James Davis (DAV007)\nAttorney for Plaintiff/Father\n107 Main Street\nAlexander City, Alabama 35010\n(256) 392-3172\n(256) 392-3578 (Facsimile)\ndianne@diannedavislaw.com\nCertificate of Service\nI hereby certify that I have served a copy of the foregoing upon the following via\nelectronic filing in the AlaCourt E-File System and/or by placing a copy of same, properly\naddressed and postage paid in the U.S. Mail on this the 6th day of November, 2025.\nBarbara H. Agricola\n127 South 8th Street\nOpelika, AL 36801\n/s/Dianne James Davis\nOf Counsel\nDOCUMENT 423\nELECTRONICALLY FILED\nDOCUMENT 66 11/6/2025 3:49 PM\nELE7C0T-DRRO-N2I0C2A3L-9L0Y0 0F5IL1E.0D1\nC\n11\nIR\n16\nC\n12\nU\n0\nI\n2\nT\n4\n8C:5O6U ARMT OF\nTALLA7P0O-DORS-2A0 2C3O-9U00N0T51Y.,0 A1LABAMA\nPATRCIICRKCU CITR ACDODUROTC KOF, CLERK\nTALLAPOOSA COUNTY, ALABAMA\nPATRICK CRADDOCK, CLERK\nlN THE CIRCU|T COURT OF TALLAPOOSA COUNTY ALABAMA\nALEX CITY DIVISION\nMCGREGOR CHRISTOPHER BLAIN E,\nPlaintiff,\nNo.:\nV. Case DR-2023-900051.01\n)\nGILLI LAND BRITTANY MICHELLE,\n)\nDefendant. A\n) b'+\nExL-,i\nOrder\nThis matter came before the Court for a show cause hearing on July 31, 2024,\nconcerning the Petition for Contempt filed by the Petitioner, Brittany Michelle Gilliland\n(hereinafter \"Mother\"), and the Counterclaim for Contempt filed by the Respondent,\nChristopher Blaine McGregor (hereinafter \"Father\"). These claims relate to alleged\nviolations of the Court's February 27, 2024, Final Decree of Divorce, specifically\nregarding visitation with the Parties' minor child, A.K.\nPrior to the hearing, the Parties agreed that the Court would conduct an in\ncamera interview with the minor child, A.K., whose relationship with the Mother and\nMother's visitation were central issues to the claims at hand. Present during the rn\ncamera interview and the hearing were the Parties' respective counsel, Barbara\nAgricola and Matthew Holdren for the Mother, and Tom Young for the Father, as well as\nreporter.\nthe court\n)\nThe Court received testimony from the minor child concerning her current\nrelationship with the Mother and her reasons for not abiding by the court-ordered\nvisitation as laid out in the divorce decree. Following the rn camera interview, counsel\nfor both Parties, along with the Court, agreed that proceeding with the show cause\nhearing was not appropriate at this time.\nAccordingly, it is hereby ORDERED:\n1. Continuation of Show Cause Hearing: The show cause hearing scheduled for July\n31, 2024, is hereby continued generally, until further motion of either Party to set the\nmatter for a hearing after the court-ordered counseling begins.\n2. Reunification Therapy: Effective immediately, Mother and A.K. shall begin attending\njoint counseling/therapy sessions with Kelly Turner, a specialist in reunification therapy.\nUpon the therapist submitting her reunification report to the Court, A.K. and Mother\nshall continue to see Ms. Turner, provided no ethical conflicts exist, until Mother feels\nthat reunification counseling is no longer necessary.\n3. CAG Joint Gounseling Sessions: At this time, the CAC is unavailable to conduct joint\nDOCUMENT 423\nDOCUMtsNT 66\ncounseling sessions. Once the CAC determines that joint counseling sessions would be\nbeneficial to the CAC counseling plan, Mother shall be permitted to attend any and all\nsessions with A.K. that the CAC permits.\n4. Gost of Counseling: The costs of any joint counseling sessions attended by Mother\nand A.K. shall be paid in accordance with the terms for covered and uncovered medical\nexpenses as outlined in the divorce decree, in that any medical expenses not covered\nby the Father's insurance for A.K. shall be divided equally between the Parties. lf\nFather ever impedes upon these counseling sessions, causes A.K. to miss the\nsessions, or allows A.K. to miss the sessions, for any reason other than emergency,\nthis will be considered willful contempt of this Court's order.\n5. Reunification Specialist's Report: The Parties are directed to provide a copy of this\nOrder to the reunification specialist and A.K.'s counselor. The Court hereby requests\nthat the specialist submit a report to this Court and to counsel for both Parties after 10\njoint reunification therapy sessions with the Mother and A.K., or, if earlier, when the\nspecialist believes that the Mother and A.K. have established a relationship sufficient to\nmake the previously ordered visitation beneficial to A.K.\n6. Weekly Family Dinners: Beginning immediately, the Parties shall attend weekly\ndinners together, including the Mother, Father, A.K., and the Parties' minor son. These\ndinners shall take place every Wednesday evening at 6:30pm CST. These Wednesday\nevening dinners shall take priority over all other events and shall only be cancelled in\ncase of emergency. If the Wednesday night dinner is cancelled, the Parties shall have a\n\"make-up\" dinner the following day.\nDONE this 6th day of November, 2024.\n/s/ STEVEN R PERRYMAN\nC!RCUIT JUDGE\nDOCUMENT 423\nDOCUMENT 172\nELECTRONICALLY FILED\n411412025 12:1 1 PM\n70-DR-2023-900051.01\nCIRCUIT COURT OF\nTALLAPOOSA COUNTY, ALABAMA\nPATRICK CRADDOCK, CLERK\nlN THE CIRCUIT COURT OF TALLAPOOSA COUNTy ALABAMA\nALEX CITY DIVISION\nMCGREGOR CHRISTOPHER BLAINE,\nPlaintiff,\nNo.:\nV. Case DR-2023-900051.01\nt'l[/r\nGI LLILAND BRITTANY MICHELLE, mh; h;/-\nDefendant.\nTEMPORARY ORDER\nThis matter came before the court on the 3'd day of April 2025, on various motions. The\nPlaintiff/Father, Christopher Blaine McGregor was present and represented by his attorney,\nDianne James Davis, and the Defendant/Mother, Brittany Michelle Gilliland was present and\nrepresented by her attorney, Barbara H. Agricola. \\tVhen it was called for a hearing, the parties\nannounced they had reached a temporary agreement. lt is hereby\n:\n1)\nThat the Mother's visits with the minor child, B.M. (DOB 5/10/19) shall be from\nFriday after school until Monday when he is returned to school or to the Father.\nShould the Mother not be available to pick the child up from school or after the\nbell, she will inform the Fathet and he will get the child from school and have\nhim available for pick up by the mother.\n2)\nThat the parties shall resume family dinners or lunches with both children in\nAlex City on Sundays between the hours of 1:00 p.m. and 6:00 p.m. The\nparties shall work around A.K.M.'s (DOB 5124112) activities should she have any\non those Sundays. The parties may mutually agree to any and all other times in\nwhich to meet with the children.\n3)\nThe Mother shall be entitled to Facetime each night with both children.\nA status hearing, should the parties not be able to settle all pending motions, shall be\nheld on June 3, 2025, at 1:00 p.m. A ruling on all pending motions are reserved untilJune 3,\n2025.\nDONE this 14th day of April, 2025.\nDOCUMENT 423\nDOCUMENT 172\n/s/ KEVIN HALL\nCIRCUIT JUDGE",
  "source_metadata": {
    "method": "pdfplumber",
    "pages": 10
  },
  "modified_time": 1767900741.0
}