{
  "doc_id": "1f6746bc7eef4a1cd635c9f68996f59a562ded2fa96be7f3e85b4c414070668e",
  "file_path": "C:\\Users\\blain\\Dropbox\\Master_Court_Files\\15_Letters_and_Emails\\2024-08-07_Letter_Matt_to_Tom_RT_Turner.pdf",
  "file_name": "2024-08-07_Letter_Matt_to_Tom_RT_Turner.pdf",
  "doc_type": "pdf",
  "date": null,
  "parties": [],
  "raw_text": "Caleb T. Chancey\nBarbara H . Agricola\ncaleb@agricolalaw.com\nbarbara@agricolalaw.com\n*Also admitted in Georgia\nAlgert S. Agricola, Jr. Morgan R. Caro-Whipple\nal@agricolalaw.com morgan@agricolalaw.com\nAugust 7, 2024\nVia Electronic Mail\nTom Young, Jr.\ntyoung@mhhlaw.net\nRE: Brittany Michelle Gilliland v. Christopher Blaine McGregor\nCase No: 70-DR-23-900051.01\nOur File No.: 300.036\nDear Tom:\nI wanted to follow up on your August 6, 2024, letter regarding the proposed order.\nReunification Specialist and Counseling Costs— My client has reached out to a reunification\ntherapist named Kelly Turner, who has agreed to work with the family. The cost for the sessions\nis $150.00 per session. Considering that getting these two to agree is about as likely as winning\nthe lottery, and considering that the father will not be participating in these sessions, there is no\nneed for mutual agreement on the specific counselor. To ensure the costs remain fair and\nmanageable, we propose placing a cap of $150 per session, with each parent responsible for $75.\nThis arrangement makes sure that we are adhering to the divorce order’s 50/50 cost-sharing\nprovision for uncovered medical expenses, while protecting the parties financially. It may be\nbeneficial to set up a phone conference with Ms. Turner and us, to address any concerns we might\nhave after further discussion with clients.\nJoint Counseling Sessions—Regarding joint sessions between A.K. and Ms. Gilliland, the Child\nAdvocacy Center has informed us that they will not be able to provide joint counseling sessions at\nthis time. It is our understanding that the CAC counselor is willing to conduct joint sessions at\nsome point in the future, and once they are open to that, Mother will absolutely participate. We\nhave no intention of infringing on the current counselor’s plans.\nTaking this into account, and as we discussed on our phone call, we do not believe there is\na need to bring in a third counselor. We suggest that until the CAC’s counseling plans allow for\nMother to engage in joint sessions with A.K., the weekly reunification counseling sessions with\nthe reunification specialist will be sufficient and the most cost-effective approach for both parties.\nWe are exploring alternative options and will inform you once we have a recommendation.\nHowever, I want to reiterate that our clients do not need to mutually agree on a counselor for these\nsessions, as this would only introduce unnecessary conflict. If all goes well, once the CAC’s\ncounseling plan is concluded, it would probably be beneficial for A.K. and Mother to continue\ncounselling with Ms. Turner, provided no ethical conflicts exist, once she submits her reunification\n127 South 8th Street Opelika, Alabama 36801 Phone: 334.759.7557 Facsimile: 334.759.7558\nwww.agricolalaw.com\nreport to the court. If Ms. Turner does have some sort of conflict at the “conclusion” of the\nreunification sessions, they could continue joint counseling with another counselor.\nWednesday Dinners—Regarding the weekly dinners, the judge was particularly clear about the\nimportance of having a set day for these dinners to occur, and he emphasized that these dinners\nshould take precedence over other plans. Wednesday was chosen because A.K. does not have any\ncheerleading, church activities, or other extracurriculars scheduled for that day. Both parents may\nneed to adjust their schedules accordingly, as this is going to be Mother’s only time outside of\ncounseling to spend with her daughter.\nThese weekly dinners are important. They are crucial for reuniting mother and daughter.\nBoth parties represented at the hearing that they want what is best for A.K. and to support the\nreunification process. Having a set weekly dinner every Wednesday is going to be the core of that\neffort. If the parties can agree on an alternative day, we are open to that discussion, and will include\nthat in the proposed order. However, if they cannot agree on another day prior to filing the\nproposed order, the default should remain Wednesday, and this dinner should take priority over\nother activities.\nIt is clear that we are not going to get a signed order with dinner details by tomorrow, so\nuntil we do get an order (considering we might agree on a different day), Judge Perryman did state\non the record that the dinners should occur Wednesday evenings. Accordingly, my client intends\nto attend weekly dinners with A.K., Father, and son, on Wednesday evenings, until otherwise\nordered.\nShould you have any questions, please do not hesitate to contact me at 334.759.7557, or\nby email at matt@agricolalaw.com. Thank you.\nVery truly yours,\nMatthew Holdren\nCc: Barbara H. Agricola\nMAH/ab",
  "source_metadata": {
    "method": "pdfplumber",
    "pages": 2
  },
  "modified_time": 1759008870.0
}