{
  "doc_id": "1fff15be922f7ef56940b08f73f320822131a12e01619f2a72e663b2cd8555ff",
  "file_path": "C:\\Users\\blain\\Dropbox\\Master_Court_Files\\20_Jan_Contempt_Info\\McGregor v. Gilliland – Final Trial Preparation Summary (Jan 20, 2026).pdf",
  "file_name": "McGregor v. Gilliland – Final Trial Preparation Summary (Jan 20, 2026).pdf",
  "doc_type": "pdf",
  "date": null,
  "parties": [],
  "raw_text": "McGregor v. Gilliland – Final Trial Preparation\nSummary (Jan 20, 2026)\nCourt Orders and Judgments\n• Final Decree of Divorce (Feb 27, 2024) – Issued after a contested trial (heard Nov 15, 2023 1 ), this\n12-page decree granted joint legal custody of the two children (A.K. and B.M.) with sole physical\ncustody to the Father (Christopher McGregor). The Mother (Brittany Gilliland) was awarded specified\nvisitation (1st and 3rd Thursday–Monday weekends each month, plus alternating holidays and\nsummer weeks) 2 3 . The decree ordered the Father to pay the Mother ~$52,000 as half the\nequity in the marital home (initial $10k + $2k/month for 21 months) 4 5 , with a clause that\nfailure to pay would require the house to be sold and proceeds split 6 7 . It also required the\nMother to pay $617/month in child support to the Father 8 . Key findings: The court found the\nMother had mistreated A.K. (e.g. bruising from inappropriate discipline) and that the children\nthrived with the Father 9 . A DHR child-abuse investigation was opened on Nov 7, 2023 (the day\nafter trial) and eventually closed as “Not Indicated” (unsubstantiated) on Jan 5, 2024 10 , meaning\nabuse wasn’t confirmed but concerns weren’t disproven. (Decree: Tallapoosa Cty. Case\nDR-2023-900051, 11/15/23 trial before Judge Perryman)\n• Post-Divorce Show-Cause Hearing & Bench Ruling (July 31, 2024) – After the final decree, Mother\nand Father filed cross-petitions for contempt over visitation issues 11 . By March 2024, A.K. had\nbegun refusing visitation with the Mother, experiencing panic attacks at handoffs; police were\ncalled multiple times when A.K. would not get in Mother’s car 12 . At the July 31 hearing, Judge\nSteven Perryman conducted an in camera interview with 12-year-old A.K. 13 . The judge declined to\nhold Father in contempt, recognizing that A.K.’s refusal was not due to father’s interference but due\nto genuine strain in the mother–child relationship 14 . From the bench, Judge Perryman outlined\na graduated reunification plan: A.K. would continue individual counseling at the Child Advocacy\nCenter (CAC); the Mother would join some of those counseling sessions with A.K. (once the child\nwas receptive); the family (Mother, Father, A.K., and younger son B.M.) would have one low-pressure\nmeal together weekly – at flexible times (the judge “did not care if… breakfast, lunch, or\ndinner” 15 ) – to normalize contact; formal reunification therapy with a specialist would occur\nlater, only after progress in joint counseling and family meals 14 16 . In short, the court continued\nthe contempt hearing generally (no immediate findings) and ordered a therapeutic intervention\nperiod 17 . No written order was entered at that time; the bench directives were later formalized with\nmodifications (see below).\n• Reunification Therapy Order (Written Order, Nov 6, 2024) – Over three months after the bench\nruling, a written “Final Order” was entered (drafted by Mother’s counsel) which diverged in key\nways from the oral pronouncement 18 . It ordered that reunification therapy with a specialist (Kelly\nTurner, LPC) begin immediately, without any prerequisite joint sessions at CAC 19 20 . It also\nmandated weekly dinners every Wednesday at 6:30pm with the whole family, making that\nschedule fixed and “taking priority over all other events,” only excused for emergencies (with make-\n1\nup the next day) 21 22 . These terms departed from the bench ruling’s flexibility (which had allowed\nany weekly mealtime and implied adjustment for the child’s schedule 15 23 ). The order also\nspecified that the costs of counseling be split 50/50 per the divorce decree’s rules for uninsured\nmedical expenses 24 . (Order: “In re: Reunification Therapy”, filed 11/6/24, Judge Perryman.)\n• Contradictions: Bench vs. Written Order Discrepancies: The Father later noted the written order\n“did not reflect the true wishes and order of the Court.” 25 26 Specifically, Judge Perryman had\nenvisioned reunification therapy only after A.K.’s individual counseling and some joint sessions with\nMother, but the written order imposed it immediately 27 25 . The judge had also intentionally left\nthe weekly family contact flexible (no set day or meal) 15 , whereas the order rigidly set Wednesday\ndinners at 6:30pm 21 . The bench plan mentioned “lunches [and] dinners” in a casual sense and\nstressed he didn’t care which mealtime as long as it happened weekly 28 29 ; the written order,\nhowever, authorized only dinners on a fixed night, omitting the possibility of lunch and locking in a\ntime 30 31 . These omissions and changes became a point of contention and motion practice (see\nFeb 2025 motion below).\n• Order Amending Dinner Schedule (Nov 7, 2024) – The day after the reunification order, the Father’s\ncounsel moved to reconsider the inflexible dinner schedule. Judge Perryman issued an Amended\nOrder allowing that if a Wednesday dinner conflicted with a pre-scheduled activity of A.K.’s, the family\ndinner could be moved to Tuesday or Thursday that week 32 33 . The judge warned against any\n“gamesmanship” in claiming conflicts 34 . This modification restored some flexibility intended by the\noriginal bench ruling. (No other substantive changes were made to the 11/6/24 order.)\n• “Motion to Modify Previous Order” & Pending Final Hearing – On Feb 11, 2025 (about 3 months\nafter the written order), the Father – now with new counsel – filed a motion to modify or set aside the\nNovember 6, 2024 reunification order 35 . He argued that the order should be conformed to “reflect\nthe wishes of the Court as expressed on July 31, 2024,” especially regarding the sequence of\ntherapy 36 37 . This motion (effectively a Rule 60(b) request for relief) noted the discrepancies\n(therapy timing and fixed dinners) and sought to correct what Father viewed as mistakes or changed\ncircumstances. Judge Kevin Hall had by then taken over the case (succeeding the retiring Judge\nPerryman). The record indicates this motion was not ruled on immediately and was to be\naddressed in the final trial on custody/visitation set for Jan 20, 2026 38 . (In other words, the\nNovember 2024 order remained in place pendente lite, and the issues it raised are to be resolved at\nthe upcoming trial.)\n• Order Granting Holiday Visitation (Judge Hall, Nov 6, 2025) – With the final trial still pending into\nlate 2025, the Mother filed a motion to enforce holiday parenting time. On Nov 6, 2025 Judge Hall\ngranted the Mother’s “Motion for Court-Ordered Holiday Visitation,” explicitly noting that “there\nappears to be no order suspending visitation” 39 . He therefore ordered that the Mother’s holiday\nvisitation rights be honored. This suggests that despite the reunification plan, the Mother’s regular\nvisitation from the divorce decree was never legally stopped – yet it had not been occurring, prompting her\nmotion. (Indeed, Father’s affidavit confirms A.K. had not had an unsupervised overnight with Mother\nsince August 2023 12 .) This order effectively reaffirmed the Mother’s right to holiday time in 2025,\ngiven that no court had ever formally suspended her visitation 39 . The Father did not oppose the\nholiday time on the record. Timeline note: This came after a year in which reunification efforts had\nfaltered (see below), and indicates the court’s intent to ensure Mother still had access pending the\nfinal resolution.\n2\n• (Other Interim Orders: The file also includes minor procedural orders, e.g. an Order to Appear via\nZoom (June 6, 2025) allowing remote testimony, and appointment of a Guardian ad Litem (GAL) for\nthe children in late 2024 – Judge Hall granted Father’s Nov 20, 2024 motion for a GAL (the record\nshows Attorney Dianne James was appointed). These ensured the children’s interests were\nrepresented during the protracted proceedings.)\nKey Evidence from Transcripts & Affidavits\n• Divorce Trial Testimony (Aug–Nov 2023) – The divorce/custody trial spanned multiple days (e.g.\nAug 18 and Nov 6, 2023) before Judge Perryman. Witnesses for Father included: Father himself (C.\nMcGregor), who described Mother’s instability and the children’s well-being with him; Heather Dixon\n(CAC counselor) who had evaluated A.K. around Sept 2023 and testified to concerns about Mother’s\nanger and potential abuse, recommending supervised visitation “to start” 40 41 ; and other\nfamily members (Lisa, Brian, Katie McGregor) corroborating the children’s thriving routine with\nFather. Witnesses for Mother included: Stacy Green and Tasha Howell (friends or relatives who likely\nrefuted abuse claims), and the Mother herself, who denied mistreating A.K. and emphasized her\nbond with the children (exhibits showed loving photos shortly before separation 42 ). Notably,\nDixon’s testimony revealed that A.K. (then 11) reported incidents of the Mother “losing self-control”\nand inflicting bruises 43 . On cross, Mother’s attorney stressed that Dixon had never met the Mother\nor younger child and based her opinions solely on Father’s and A.K.’s reports 44 45 . The Mother’s\nside highlighted evidence (e.g. a photo from 8 days before Dixon’s intake) showing A.K. smiling with\nMother 42 to suggest A.K. wasn’t afraid at that time. In the end, Judge Perryman found sufficient\nevidence of emotional and physical maltreatment by Mother (even though DHR later did not\n“indicate” abuse) and that the Father provided a more stable environment, leading to the custody\naward to Father 9 46 . (Transcript: Final Hearing Nov 2023, e.g. Dixon at p.89–95; Court’s findings\nsummarized in final decree.)\n• In Camera Interview with Child (July 31, 2024) – At the contempt/show-cause hearing, Judge\nPerryman interviewed A.K. privately in chambers 13 . While the transcript of this interview is sealed,\nthe judge stated on record that A.K. had genuine fear and resistance toward visitation with\nMother, beyond Father’s control 14 . According to Father’s affidavit, the judge emerged and\nexpressly acknowledged that the situation was “not appropriate at this time” to force visitation\nand that the Mother-daughter relationship needed repair (hence the reunification plan) 47 14 . This\nin camera insight heavily influenced the gradual approach ordered.\n• Father’s Affidavit (Late 2025) – In preparation for trial, Father C. McGregor submitted a detailed\nsworn affidavit (excerpted above) summarizing events since the divorce 48 . Key points from\nFather’s affidavit: (1) Visitation Breakdown: A.K. has refused overnight visits with Mother since\nAug 2023, experiencing panic attacks at exchanges; police were involved multiple times in early\n2024, and officers advised not to force the terrified child 12 . (2) Bench Plan vs Order: Father recounts\nthe July 31, 2024 bench ruling and notes the written order’s departures, but affirms “I complied\nfully with the November 6 order.” 18 (He did facilitate therapy with Ms. Turner and the weekly\ndinners despite misgivings). (3) Mother’s Participation Issues: From Jan–Aug 2025, roughly 30 weekly\nreunification dinners were scheduled, but Mother missed well over half – often no-showing or\ncanceling last-minute 49 . Father provides specific dates: e.g. Jan 10, 2025 (Mother no-showed a\nrescheduled Saturday brunch), Feb 5 (canceled Wed., then no-showed Thu.), Mother’s Day 2025 (she\ndeclined a planned dinner and only picked up the son B.M.), etc., through summer 2025 when\n3\nMother stated she “won’t be able to do dinners until I get back to work” and missed multiple July/\nAugust dates 50 . Father says he attended every meeting and even moved dinners from Wed to\nSunday afternoons to accommodate Mother’s new schedule, but she still failed to attend many 51 .\n(4) Mother’s Relocation and Life Changes: Mother moved ~100 miles away (Clanton, AL) in mid-2025,\ngot remarried and had a new baby, which, per Father, made her less available for A.K. 52 53 . (5)\nAlleged Non-Compliance by Mother: Father claims Mother is $1,500 behind on child support and has\nnot reimbursed half of medical costs for the kids, contrary to court orders 54 . He also notes\nMother sometimes publicly accused him of “parental alienation” on social media even while he was\nactively including her (e.g. she posted from his home during A.K.’s birthday, where Father had invited\nMother and her husband) 55 . Overall, the affidavit portrays Father as having over-complied and\nencouraged contact, giving Mother extra holiday time and opportunities, while Mother allegedly\nsquandered many of those opportunities 56 57 . This sworn statement will support Father’s case\nthat he did not alienate A.K., but rather Mother failed to show up consistently, causing further harm\nto the mother–child relationship.\n• Kelly Turner (Reunification Therapist) – Conduct and Affidavit: Kelly Turner, a licensed counselor,\nwas appointed by the court on Nov 6, 2024 to conduct reunification therapy. Father’s affidavit and\nother records highlight significant issues with Ms. Turner’s involvement. Timeline: Even before the\nwritten order, on Aug 19, 2024, Turner met with the Mother alone (an introductory session), and on\nAug 20 she texted both parties claiming she was “court-appointed” and had seen the Mother 58\n– surprising the Father, since no court order existed yet at that time. Father asked if Turner had any\nprior relationship with Mother; Turner did not respond 59 . After appointment, Turner scheduled\nsessions with A.K. and Mother. In one early joint session (Fall 2024), Turner allegedly told A.K. she did\nnot believe Mother ever hurt her, and that “the court doesn’t believe you either.” 60 According\nto Father, A.K. left that session traumatized, suffered a panic attack, and had to see a pediatrician the\nnext day, who prescribed anti-anxiety medication for future therapy visits 61 . Turner was also\ninflexible with scheduling: she set one therapy session on Nov 12, 2024 that conflicted with A.K.’s\nlong-scheduled pediatric evaluation; Father begged to reschedule, but Turner refused, causing\nA.K. to miss the medical appointment 62 . Turner often was slow to communicate with Father and\nseemed to coordinate primarily with Mother 63 . By January 2025, Kelly Turner withdrew from the\ncase (resigned as therapist). Then, on Feb 12, 2025, the eve of a court hearing, Turner signed an\naffidavit (apparently at Mother’s request) accusing the Father of manipulating A.K. and the\nreunification process 64 . Turner had never met or spoken with the Father in person during the\ntherapy process 64 . Father’s counsel moved to strike Turner’s affidavit as one-sided and without\npersonal knowledge. This conflict with the reunification therapist is a major issue: it suggests Turner\nmay have had bias or at least that the reunification process was fraught. It also sets the stage for\nquestioning Turner (the Father has subpoenaed her for trial on Jan 5, 2026) about her methods,\nstatements to A.K., and lack of impartiality.\n• Dr. Eric Tyler (Child’s Counselor/Pediatrician) – Deposition (Sept 10, 2025) – Dr. Tyler is a\npediatrician who treated A.K. and B.M., including for behavioral health. He was deposed in Sept 2025\nfor this case. His medical records (exhibits to his depo) confirm A.K. has been diagnosed with\nGeneralized Anxiety Disorder and ADHD 65 . A well-child exam on April 11, 2025 noted A.K.’s\nanxiety was “well controlled” with medication, but also listed “CHILD PHYSICAL ABUSE,\nCONFIRMED” in her problem list (coded as a “subsequent encounter”) 66 . The history in that report\nstates: “Father has custody. Maternal physical abuse… Court case is ongoing. Mother has moved…\nengaged and pregnant.” 67 . This indicates Dr. Tyler was aware of the abuse allegations and the\n4\ncustody situation. We expect Dr. Tyler’s testimony to support that forcing A.K. into unwanted\ncontact caused her severe anxiety, and that the therapeutic process might have been mishandled.\n(Notably, Dr. Tyler’s scheduled behavioral evaluation of A.K. in Nov 2024 was missed due to the\nTurner therapy conflict 62 , something likely covered in his deposition.) His input will be crucial on\nwhether A.K.’s reluctance is rooted in legitimate trauma versus parental influence.\n• Mother’s Perspective: While we have fewer direct documents from the Mother in this folder, we\nknow from her appeal and filings that she alleges the Father is alienating the children and\ndisobeying court orders. For instance, the Mother filed an Objection to [Father’s] Motion to Set\nAside Court-Ordered Holiday Visitation in late 2025, which Father’s affidavit explicitly responds to\n68 . Mother has claimed Father does not facilitate her visitation (hence the need for the holiday\nmotion in 2025). In August 2024, Mother’s attorney Matthew Holdren corresponded with Father’s\ncounsel about the reunification order terms – advocating for Kelly Turner as therapist and opposing\nbringing in a new counselor despite CAC’s unavailability 69 70 . Mother’s side insisted that\nTurner’s sessions “will be sufficient” until CAC could do joint counseling, and that Mother would\n“absolutely participate” in CAC counseling when opened 71 72 . (In practice, however, CAC never did\njoint sessions before Turner withdrew, and Mother’s participation in Turner’s sessions became\ninconsistent.) The Mother’s Appellate filings (Appeal No. CL-2024-0597) likely argued the trial court\nerred in its 2024 custody decision. She obtained extensions to file her brief (due Nov 14, 2024) 73 ,\nand the Father (Appellee) filed his brief on Jan 9, 2025. No appellate decision is noted in the record,\nsuggesting the appeal might still be pending or was rendered moot by the ongoing trial-level\nproceedings (the final hearing before Judge Hall will effectively supersede prior interim orders).\n• Texts and Emails: The folder contains a PDF of text messages (all parties’ texts through Sept 26,\n2025) and some emails. While too voluminous to summarize in full, these communications provide\ncontext: e.g. Emails with Kelly Turner (an email dated Nov 26, 2014 from Turner) show Father\npleading to reschedule A.K.’s session due to the conflict with her doctor appointment 62 (Turner\nrefused). Texts likely document scheduling conversations and possibly Mother’s cancellations or\nA.K.’s statements. One notable mention: on July 31, 2025 (exactly a year after the show-cause\nhearing), during a custody exchange for B.M., the Father texted Mother to encourage her to speak\nwith A.K. in person; Mother stayed in her car, and later A.K. texted Father upset that “her mother\nnever even got out of the car to speak to me or congratulate me” on something 74 . This incident,\nmentioned in Father’s affidavit, underscores the communication breakdown and will be used to\nshow Mother’s missed opportunities to connect.\nChronology of Major Events (2018–2025)\nThe following timeline compiles key events referenced across the Master Court Files, with document\ncitations for verification:\n5\nSource\nDate Event\nReference\n(Background) Marriage deteriorates; two minor children (A.K., born 2012;\nFather’s\n2018– B.M., born 2017). Mother was primary earner (until losing her job) 75\ntestimony 75 ;\n2022 76 . Father alleges Mother’s anger issues affected A.K. (incidents of over-\nAffidavit 9 .\ndiscipline).\nDivorce trial – Part 1. Trial before Judge Perryman. Evidence of Mother’s\nAug\nangry outbursts and A.K.’s fear presented (CAC counselor Heather Dixon Trial Tr. (Dixon)\n18,\nrecommends supervised visitation to protect kids 40 ). Mother’s 40 44 .\n2023\nwitnesses counter that Father may have fostered alienation.\nNov 6 Divorce trial – Conclusion. Trial concluded Nov 15, 2023 (Judge took\n& 15, case under submission) 1 . On Nov 7, 2023, DHR opened an abuse Affidavit 10 .\n2023 investigation into Mother’s treatment of A.K. 10 .\nFinal Divorce Decree. Judge Perryman issues decree divorcing parties\nand awarding Father physical custody 2 . Mother gets scheduled\nFeb 27, Final Decree\nvisitation (1st/3rd weekends, holidays) 3 . Father to pay Mother $52k\n2024 2 4 .\nproperty settlement (house equity) 4 . Mother to pay child support 8 .\nNeither party ordered alimony 77 .\nDHR finding: DHR closes its investigation as “Not Indicated” (unable to\nJan 5,\nsubstantiate abuse) 10 . Mother not charged, but concerns not fully Affidavit 10 .\n2024\nresolved.\nVisitation problems escalate. A.K., 11–12 years old, begins refusing\nvisits with Mother due to anxiety/fear 12 . Multiple exchange incidents: Affidavit 12 ;\nMar–\nA.K. runs away or refuses to go; on at least two occasions police are Police notes\nJuly\ncalled and advise not to force A.K. 78 . Mother likely believes Father is not (described in\n2024\nencouraging A.K., and files for contempt. Father likewise files contempt filings).\nagainst Mother (for disparagement or other issues).\nShow Cause Hearing (Contempt). Judge Perryman holds in-camera\ninterview with A.K. and hears from both sides on alleged visitation\ncontempt 11 . Bench ruling: No contempt against Father (court finds\nJuly Bench ruling\nA.K.’s reluctance is genuine) 14 . Judge outlines plan: continue A.K.’s\n31, summary 14\nindividual therapy; Mother to join some sessions; weekly family meals to\n2024 17 .\nnormalize contact; defer specialized reunification therapy until later 14 .\nThe contempt hearing is continued (no final decision) 17 – essentially\nmaking the plan a temporary order.\n6\nSource\nDate Event\nReference\nDrafting reunification order. Father’s and Mother’s attorneys exchange\nletters negotiating the written order’s terms. Mother’s counsel proposes\nAtty letters\nKelly Turner as reunification therapist at $150/session, split $75/each\n(summarized in\nAug 6– 79 . Notes CAC (child’s counselor) won’t do joint sessions “at this\nbench/order\n7, 2024 time” 69 , so Mother prefers to rely on Turner’s sessions in lieu of interim\ncomparison)\nCAC joint therapy 80 . Father’s lawyer agrees not to add a second\n82 69 .\ntherapist, effectively agreeing to start reunification therapy sooner\nsince CAC joint sessions were unavailable 70 81 .\nTherapist starts early: Without a court order in place, reunification\ntherapist Kelly Turner meets with Mother on Aug 19. On Aug 20, Turner\nAug texts both parties that she is the “court-appointed” therapist and Father’s\n19–20, mentions the Aug 19 session with Mother 58 . Father responds that no Affidavit 58\n2024 order has been entered yet and inquires if Turner had prior connection to 59 .\nMother; Turner does not answer that question 59 . (This preemptive\ninvolvement becomes a point of suspicion for Father.)\nProposed Orders filed: Both sides submit dueling proposed orders\nProposed\nSept reflecting the July 31 ruling. Differences: Father’s draft mirrored the\nOrders &\n12, bench sequence (joint counseling first, then reunification therapy), while\nSummary 25\n2024 Mother’s draft made reunification therapy immediate. These differences\n83 .\nforeshadow the final written order’s contentions 26 .\nFather files Chapter 13 bankruptcy (Case #24-81152) to manage debts Bankruptcy\nSept\nincluding the $32k owed to Mother. An automatic stay goes into effect. petition (ref. in\n20,\nFather lists the $32k property settlement as a general unsecured debt; transcript) 84\n2024\nMother will later object, claiming it’s a support obligation. 85 .\nWritten Reunification Order entered. Judge Perryman (using Mother’s\ndraft) signs the order requiring: immediate joint therapy with\nreunification specialist Kelly Turner (no waiting for CAC) 19 ; weekly\nNov 6, Order (11/6/24)\nWednesday 6:30pm dinners for the whole family, mandatory and\n2024 27 86 .\nhighest priority 21 ; and 50/50 split of therapy costs 24 . This is Document\n156 in the case docket. Father is displeased with deviations but begins\ncompliance.\nFather’s Motion to Reconsider (same day): Immediately after the order, Motion\nNov 6,\nFather (Tom Young) files a motion to reconsider the strict dinner (11/6/24) 22\n2024\nscheduling. He argues the judge intended flexibility for A.K.’s activities. 32 .\nAmended Order – Flexible dinners. Judge Perryman grants the motion\nto reconsider. New order allows moving the weekly dinner to Tuesday or\nNov 7, Order (11/7/24)\nThursday if A.K. has a conflict on Wednesday 33 87 . Emphasizes this is\n2024 32 .\nonly if pre-scheduled conflicts exist, to prevent abuse of the exception\n34 .\n7\nSource\nDate Event\nReference\nReunification therapy under Turner begins. A.K. attends sessions with\nMother and Ms. Turner as ordered. Early conflict: Turner schedules a\nNov– session mid-November that conflicts with A.K.’s long-planned pediatric Father’s Aff. 62\nDec evaluation; Father urgently emails on Nov 12, 2024 to reschedule, but 88 ; Email (Nov\n2024 Turner refuses 62 , causing A.K. to miss the medical appointment. In a 12, 2024).\njoint session around this time, Turner makes comments invalidating A.K.’s\nabuse reports (“court doesn’t believe you”) which severely upset A.K. 88 .\nMother’s appeal in AL Court of Civil Appeals. Mother (Appellant)\nOct 28, obtains extension to file her brief by Nov 14, 2024 73 . Appeal docket: Appeals clerk\n2024 Gilliland v. McGregor, CL-2024-0597 (from Tallapoosa DR-23-900051). notice 89 .\nShe likely raises custody/visitation issues from the Feb 2024 decree.\nNov Mother’s Appellate Brief due (presumably filed). (Contents not in folder,\nAppeal docket\n14, but likely arguing trial court abused discretion in custody arrangement,\n73 .\n2024 etc.)\nFather’s Appellee Brief filed in Court of Civil Appeals, defending the trial\nJan 9, Index of\noutcome. He argues the evidence supported Mother’s limited visitation,\n2025 Dropbox files.\netc. (No ruling yet; appeal possibly in abeyance pending final trial.)\nTherapist Turner withdraws. By mid-January, Kelly Turner resigns from\nthe case (possibly due to the contentious atmosphere and A.K.’s panic\nJan Father’s Aff.\nattacks). The reunification therapy effectively pauses. After withdrawing,\n2025 64 .\non Feb 12 Turner signs an affidavit siding with Mother (alleging Father is\nthe problem) 64 .\nMissed dinner: Example of reunification dinner where Mother canceled\nFeb 5, Wednesday and then did not show on the Thursday make-up 90 . Around\nAffidavit 49 .\n2025 this time (Feb 11–12) multiple missed visits occurred, contributing to\nFather’s frustration.\nFather’s Motion to Modify Order filed. Father (new counsel) files to\namend the 11/6/24 order, citing that it contradicts the bench ruling and\nFeb 11, that reunification efforts need revisiting 35 . Also around this date, a Motion excerpt\n2025 hearing was scheduled (possibly Feb 13, 2025) to address reunification 35 37 .\nprogress – which prompted Turner’s affidavit on 2/12/25 accusing Father.\nThat hearing was likely continued or no final decision (pending final trial).\nKelly Turner’s Affidavit. Turner submits an affidavit (one day before a\nFeb 12, court status hearing) essentially blaming Father for therapy failures Affidavit\n2025 (despite never meeting him) 64 . Father’s attorney moves to strike it. (described) 64 .\nJudge Hall does not make a final ruling on the affidavit at that time.\n8\nSource\nDate Event\nReference\nReunification dinners continue (Mother often absent). From January\nthrough August 2025, approximately 30 weekly reunification meetings\nare scheduled. Mother misses over 15 of them by Father’s detailed log\n49 51 . Some notable dates Mother missed or canceled: Jan 10, Feb 5, Father’s Aff.\nSpring\nFeb 12, Apr 20 (Easter), May 11 (Mother’s Day), June 1, June 22, June 29, July 6, listing dates\n2025\nJuly 13, Aug 3, Aug 10, Aug 17, Aug 24… 49 52 . Reasons varied (no notice, 49 51 .\n“had to work,” out of town, etc.). Father and the children attended in her\nabsence when possible. Mother did sporadically attend some dinners,\nbut far less than half.\nA.K.’s pediatric check-up. Dr. Eric Tyler sees A.K. for a 13-year-old well\nvisit. Notes indicate: A.K. lives with Father; anxiety and ADHD are being\nApr 11, treated (Prozac/Metadate); “Maternal physical abuse – court case ongoing” Dr. Tyler record\n2025 is noted in history 91 . Her problem list includes “Child physical abuse, 65 66 .\nconfirmed” (likely based on prior records) 66 . This exam is important\ndocumentation of A.K.’s mental health status during reunification.\nMother stops attending dinners, citing she cannot participate until\nJuly 6, employed again (she had quit her job during this period) 52 . For several\nAffidavit 52 .\n2025 weeks in July 2025, she does not show up to scheduled reunification\nmeetings.\nFather’s Bankruptcy – confirmation hearing. In re McGregor, Ch.13,\nconfirmation hearing held. Mother (creditor) contests Father’s plan\ntreating her $32k as unsecured. In testimony, Father admits stopping $2k\npayments after filing bankruptcy and not listing the house for sale\ndespite the decree’s requirement (believing the bankruptcy would allow Bk Transcript\nJuly\nhim to keep the house) 92 93 . Mother’s counsel (Agricola) cross- 94 95 ;\n16,\nexamines Father on non-compliance with the divorce decree (failure to Appellee Br. 97\n2025\nsell house) 94 95 and notes that those $2k/month payments were 98 .\neffectively supporting Mother’s living expenses 96 . The Bankruptcy\nCourt ultimately confirms the plan and classifies Mother’s $32k claim as\na non-priority, dischargeable debt (not a domestic support obligation) 97\n98 . Mother appeals this determination to U.S. District Court.\nExchange incident: On the one-year anniversary of the in-camera,\nduring a routine exchange of son B.M., Father encourages Mother to\nJuly speak to A.K. (who is present) outside of a formal dinner. Mother stays in\n31, her vehicle and leaves without meaningful contact. A.K. later texts Father, Affidavit 74 .\n2025 upset that “Mom never even got out of the car to talk to me or\ncongratulate me” (for an achievement) 74 . This missed opportunity\nfurther harms A.K.’s trust.\n9\nSource\nDate Event\nReference\nMother’s life changes: Mother gives birth to a new baby with her new\nhusband (Father took the children to visit their half-sibling in hospital,\nfacilitating that introduction) 55 . Mother by now lives in Clanton (~2\nAug hours away) and is mostly unemployed (per Father’s account). She misses Affidavit 55\n2025 several August reunification meetings (out-of-town, schedule conflicts) 57 .\n52 . Father continues to accommodate (even meeting in neutral\nlocations like Prattville for dinners + shopping to give Mother extra\ninformal time) 99 .\nDeposition of Dr. Eric Tyler. Dr. Tyler testifies about A.K.’s mental health,\nlikely confirming her anxiety around Mother and the effects of\nSept\nreunification efforts. Exhibits (medical records) show A.K. in good physical Tyler Depo Exh.\n10,\nhealth but with diagnosed anxiety, and document the family situation 100 66 .\n2025\n(Mother’s move, etc.) 100 66 . This deposition preserves expert testimony\nfor trial.\n(Anticipated)Final custody trial originally expected. There was talk of\nresolving everything by Oct 17, 2025 101 102 , and indeed Judge Hall may\nBench/Order\nOct 17, have set a final hearing around this time. However, it appears any such\ncomparison\n2025 hearing was postponed, as issues (like Mother’s motion for holiday time)\nmemo 101 102 .\nwere still being handled in Nov 2025 and the final trial was reset to Jan\n2026. No final order was issued in Oct 2025; the case remained pending.\nOrder re: Holiday Visitation. Judge Hall grants Mother holiday time,\nemphasizing no order ever suspended her regular visitation 39 . This Court Order\nNov 6,\nrestores Mother’s rights on paper, although A.K.’s willingness to comply 39 ; Decree\n2025\nremains in question. (Mother had 2025 Thanksgiving and the first half of 103 .\nChristmas per original decree schedule 103 .)\nDistrict Court Appeal (Bankruptcy) – Appellee’s Brief. Father’s counsel\nDec files a brief in Mother’s appeal of the bankruptcy ruling, arguing that the\nBk Appellee\n21, divorce debt was properly treated as non-support (dischargeable) 97\nBrief 104 97 .\n2025 98 . This indicates that as of late 2025, the bankruptcy issue (house\nequity payment) is still on appeal in federal court.\nSubpoena issued to Kelly Turner for trial. Father plans to call Turner as\nJan 5, a witness to examine her handling of the therapy and her affidavit claims.\nSubpoena.\n2026 (Her testimony will be critical to address the reunification therapy dispute\nand any alleged parental alienation.)\n10\nSource\nDate Event\nReference\nFinal Trial (scheduled). Judge Kevin M. Hall to conduct a full evidentiary\nhearing on post-divorce custody/visitation, contempt, and any\nmodifications. The court will consider all events since 2024, including\nMother’s compliance or lack thereof, the child’s best interests given two\nyears of reunification efforts, and potentially adjust custody or visitation\norders accordingly. Issues to be decided include: whether to formally\nmodify the November 2024 reunification order (as Father requests) to Pending trial;\nJan 20,\nalign with the original intent or current realities; how to structure Father’s motion\n2026\nMother’s visitation going forward (unsupervised vs. supervised, 105 .\nfrequency, therapy requirements); whether either party should be held in\ncontempt (Mother for support arrears or missed visits, Father for any\nperceived non-compliance); and any other relief (e.g. whether Mother\nshould bear more therapy costs due to her no-shows, as Father has\nargued 105 106 ). The GAL and all evidence will be before the court for a\nfinal resolution.\nThematic Issues & Tags\nVisitation Schedule & Compliance: Initially, Mother had a standard visitation schedule (alternating\nweekends, holidays) 2 3 . However, due to A.K.’s resistance, that schedule never fully materialized post-\ndivorce. The July 2024 plan effectively put normal visits on hold in favor of weekly family meals 28 21 . A\ncentral question is whether Father unjustifiably withheld standard visitation or whether Mother’s own\nactions (and A.K.’s trauma) caused the lack of visits. Judge Hall’s Nov 2025 order underscored that Mother’s\nregular visitation was never legally suspended 39 , implicitly directing that it should have been happening.\nMother will argue Father should have made A.K. go to visits; Father will point to the police and therapist\nadvice not to force a panicked child 78 and to Judge Perryman’s acknowledgment that it was A.K.’s issue,\nnot contempt by Father 14 . Also key: Mother’s inconsistent participation in the alternative “visitation” (the\nweekly reunification dinners). Father documented many Mother no-shows in 2025 49 51 , which undercuts\nher claim that he impeded contact. This theme will be tied to contempt: Mother’s motion alleged Father\nwas in contempt for not handing over A.K.; Father was never found in contempt (July 31, 2024 hearing\ncontinued without such finding 14 ), and Father may counter that Mother herself violated the spirit of the\ncourt’s reunification order by missing sessions and falling behind on support 54 .\nReunification Therapy Process: The efficacy of the reunification therapy is a major focus. Kelly Turner’s\nrole is controversial. From the start, Turner was Mother’s preferred therapist 79 . Father alleges Turner\nsided with Mother and traumatized A.K. by dismissing her abuse claims 88 . Turner’s early withdrawal and\naccusatory affidavit will be scrutinized. Expect Father to use Turner’s own words against her (e.g. the “court\ndoesn’t believe you” quote 60 and her refusal to accommodate A.K.’s medical appointment 62 ) to argue\nTurner was not a neutral facilitator but rather exacerbated the situation. The defense for Mother might be\nthat Father sabotaged therapy or that A.K. was influenced by Father to distrust Turner. However, given\nTurner refused to meet Father, his influence on Turner was minimal. The court-appointed GAL and Dr. Tyler’s\nevidence will weigh in here: if the GAL or doctor find that reunification failed mainly due to the child’s\ngenuine trauma and Mother’s inconsistent effort, the court may adjust the approach (possibly ordering\na new therapist or even suspending forced reunification until A.K. is willing).\n11\nContradictory Orders vs. Oral Rulings: The discrepancy between Judge Perryman’s oral bench ruling and\nthe written order is well documented. Father calls it a “mistake” that should be corrected 25 26 . This is not\nmerely technical – it affected an entire year of the family’s life. For example, the bench ruling implied\nMother should earn back normal visitation gradually, whereas the written order could be read as\nMother immediately gets weekly dinners (in addition to her existing visitation rights). The lack of\nclarity led to Father believing normal weekend visitation was on hold (since A.K. was not going), while\nMother later argued it was not. This confusion is why Judge Hall found it necessary to state on 11/6/25 that\nno suspension existed 39 . The final trial will sort out this contradiction. Father’s position: the intent was a\ntemporary therapeutic pause on normal visits until A.K. was ready, and the final order in 2024 mistakenly\naccelerated things. Mother’s position: the written order is the order – Father should have immediately\nfacilitated both the therapy and her standard visitation (difficult as that was). Resolving this will likely\ninvolve “resetting” or clarifying the visitation plan in a new order that aligns with the child’s best interests\nnow, 18 months later. Judge Hall may effectively need to choose which path to endorse moving forward\n(gradual/flexible or strict schedule).\nContempt Allegations: On the Father’s side, he may seek to hold Mother in contempt for failure to pay\nchild support and medical cost shares (she’s ~$1,500 behind, per affidavit 54 ) and possibly for violating\nthe order to attend reunification sessions (though that order didn’t specify a penalty for missed dinners, her\nlack of participation could be seen as bad faith). On Mother’s side, she initially sought contempt against\nFather for withholding visitation. Given all the evidence of A.K.’s refusal and Father’s documented efforts\n(police reports, etc.), it is unlikely Father will be found in contempt for that period. Judge Perryman\neffectively excused him in July 2024 14 . However, Mother might renew contempt claims for later incidents\n(e.g. if Father didn’t turn over A.K. for a holiday – though the record shows he even gave extra time on some\nholidays 56 ). The GAL’s input will be important on whether either party willfully disobeyed court orders or\nsimply couldn’t comply due to the child’s behavior. The GAL likely has been monitoring and will report if, for\nexample, Father discouraged A.K. or Mother spoke negatively to A.K., etc.\nIn Camera Child Preference: A.K. is now 13. Her preferences carry more weight at this age. It’s expected\nthat Judge Hall (or through the GAL) will consider A.K.’s wishes in crafting the final order. A.K. has\nconsistently expressed that she does not feel safe or comfortable with Mother (per her statements to\ncounselors and the court). Unless evidence shows those fears are unfounded or planted, the court may\nadjust visitation accordingly (possibly moving to therapeutic supervised visitation with Mother until A.K.\nconsents to unsupervised time). The theme of the child’s voice is thus critical. This case already had one in\ncamera interview; there may be another before the final trial concludes, or the GAL will relay A.K.’s current\nfeelings. The court must balance this with the policy of reunifying children with parents – a delicate task\ngiven A.K.’s age and prolonged estrangement.\nRelocation and Logistics: Mother’s move to Clanton (approx. 2 hours from Father in Alexander City) adds\ncomplexity. Joint dinners on school nights became impractical, which is why Father shifted to weekend\nmeetings in Prattville (halfway) 99 . The final plan must account for distance. The court might order less\nfrequent but longer visits, or require the Mother to drive the distance given she moved. Also, Mother’s new\ninfant means her attention is split; conversely, Father’s obligations with the older kids remain primary. This\nrelocation issue is tied to “best interests” – stability vs. maintaining a bond at distance.\nBankruptcy and Financial Issues: While the custody court won’t decide bankruptcy law, the situation\nsheds light on the parties’ conduct. Father filing bankruptcy in Sept 2024 allowed him to avoid selling the\nhouse and halted Mother’s collection of the $32k. Mother’s creditor claim being treated as unsecured (not\n12\nsupport) was effectively a win for Father 97 98 . Mother’s appeal of that ruling (pending in federal court)\nindicates her anger over not getting the money. She might argue in family court that Father’s bankruptcy\nwas an attempt to deprive her of resources and thus not in good faith (e.g. he chose bankruptcy rather than\nobey the order to sell the house 95 ). Father will counter that he proposed a 100% repayment plan (so she’ll\nget her money through bankruptcy) 107 and that keeping the house was to maintain the children’s home\nstability (he had nowhere else to live with the kids) 108 109 . The bankruptcy transcripts show Father’s\nrationale: he took on marital debts (IRS and credit cards) and couldn’t pay everything at once 75 110 . This\ncontext might influence the court’s view of Father’s overall credibility and stress level during 2024–25, but\nthe family court is unlikely to penalize him for exercising a legal remedy (especially since he did pay $20k\nbefore filing 5 111 ). It could, however, factor into any attorney fee decisions (e.g. Mother could argue\nFather’s actions forced her to incur more legal fees).\nTherapeutic Intervention Going Forward: Both sides seem to agree that some therapy is needed – but\ndisagree on how and with whom. The Mother originally opposed involving a new counselor for joint\nsessions in 2024 80 , preferring to rely solely on Turner, which proved problematic. Now, with Turner gone,\nthe path is open. The court may order a new reunification therapist or family therapy program. The\nAFCC Guidelines for Court-Involved Therapy (included in the files) may be referenced, emphasizing that a\ntherapist should maintain impartiality and not take on dual roles. Expect Father to insist on a therapist\nindependent of Mother’s influence and perhaps one vetted by both parties or the GAL. Mother, on the\nother hand, might request that any therapy be local to her (to ease her participation) or even that it isn’t\nnecessary because she believes Father’s compliance is the main issue. Given A.K.’s anxiety, a trauma-\ninformed counselor might be appointed to specifically address the mother–daughter relationship in a safe\nsetting. The final order could require Mother to attend parenting or anger management counseling as well,\nif the court finds the root cause was her past behavior (the trial evidence of bruising and yelling could\nprompt such requirements).\nAlienation vs. Estrangement: The Mother’s narrative likely frames Father’s behavior as parental\nalienation – pointing to A.K.’s alignment with Father and refusal to see Mother as something Father\nencouraged (she even accused him on Facebook of this 112 ). The Father’s narrative is one of justified\nestrangement – that A.K.’s fear of Mother is due to Mother’s own actions (the “mistreatment” that even the\ntrial court recognized) and that he has tried to heal the relationship (by inviting Mother to events, etc. 55\n99 ). The evidence leans toward estrangement: A.K.’s reactions (panic attacks, etc.) are hard to fake for a\nchild, and Father did facilitate many contacts. However, the Mother will seize on any evidence that Father\ncould have done more or that he harbors bitterness (for example, Father’s bankruptcy and refusal to sell\nthe house as ordered could be cast as him prioritizing his interests over cooperation). The GAL’s report will\nbe pivotal here – an unbiased view of whether the Father has been encouraging or discouraging the\nchildren’s relationship with Mother. If the GAL opines that Father has done what he can and Mother needs\nto take accountability for repairing her bond with A.K., that will support maintaining Father’s custody and\npossibly continuing a cautious approach to Mother’s visitation. Conversely, if the GAL suspects Father of\nsubtle alienation, the court might impose remedies (like makeup visitation, counseling for Father, or even a\nchange in custody if extreme – though that seems unlikely given the history).\nIn Camera & Child’s Testimony: A.K. may not testify in open court (to protect her), but her voice will be\nheard either via GAL or another in camera interview with Judge Hall. B.M., the younger child (now about 8),\nhas been having regular visitation with Mother without noted issue – Father’s affidavit indicates he “ensured\nB.M. maintained his normal visitation” even when A.K. would not go 99 . This split situation (one child\nvisiting, one refusing) is telling: it undercuts a pure alienation claim (since B.M. wasn’t kept away from\n13\nMother by Father) and highlights that A.K.’s refusal is specific to her own relationship with Mother. The\noutcome for A.K. may thus be different than for B.M. (e.g. A.K. might get a tailored plan, whereas B.M.’s\nvisitation with Mother might remain standard). The final order could, for example, suspend or strictly\nsupervise A.K.’s visitation until A.K. chooses to resume normal visits, while allowing B.M. unsupervised\nvisits as before.\nConclusion – Preparation Notes: Each document in the Master_Court_Files has been reviewed to trace this\ncomplex post-divorce saga. The oral bench ruling vs. written order discrepancy stands out as a critical\nissue 25 26 , as do the Mother’s lapses in participation 49 . For trial, focus on establishing: (1) Father\nacted in good faith and the child’s reluctance was genuine (use police reports, counselor Dixon’s and Dr.\nTyler’s testimony, Father’s documented offers of extra contact 56 99 ); (2) Mother, despite being loving,\nfailed to consistently follow through on the court’s reunification opportunities (use Father’s log of missed\ndinners 49 and Turner’s early withdrawal, plus Mother’s own admissions if any); (3) A.K.’s best interest at\nthis point (nearly two years later) may require a modified approach – perhaps suspension of forced\nvisitation until she engages in therapy on her terms, or continuing only in a therapeutic setting –\nbecause forcing contact has arguably caused more harm (Turner’s sessions led to panic attacks 88 ); and (4)\nensure any future order is crystal-clear to avoid the confusion that arose from the 11/6/24 order. All file\nreferences (orders, motions, transcripts) have been noted above for quick access during trial preparation,\nand a tabulated chronology is provided to outline the sequence of events with pinpoint citations. This\nshould enable counsel to articulate a fact-based narrative and address any claimed inconsistencies with\nconfidence, supported by the record. 25 14\n1 9 10 12 14 18 46 48 49 50 51 52 54 55 56 57 58 59 60 61 62 63 64 68 74 78 88 90 99 112\nshortened_affidavit_v2_mcgregor.docx\nhttps://www.dropbox.com/preview/master_court_files/07_other/shortened_affidavit_v2_mcgregor.docx\n2 3 4 8 77 103 2025-02-27_final_divorce_decree.pdf\nhttps://www.dropbox.com/preview/master_court_files/01_orders/2025-02-27_final_divorce_decree.pdf\n5 6 7 75 76 84 85 92 93 94 95 96 107 108 109 110 111 bankruptcy transcript .pdf\nhttps://www.dropbox.com/preview/master_court_files/19_bankruptcy_chapter_13/bankruptcy%20transcript%20.pdf\n11 13 15 16 17 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 47 69 70 71 72\n79 80 81 82 83 86 87 101 102 105 106 comparison of bench ruling vs. final written order (mcgregor v.\ngilliland).pdf\nhttps://www.dropbox.com/preview/comparison%20of%20bench%20ruling%20vs.\n%20final%20written%20order%20%28mcgregor%20v.%20gilliland%29.pdf\n39 order granting motion's motion for court ordered holiday visitation 11.6.2025.pdf\nhttps://www.dropbox.com/preview/master_court_files/01_orders/\norder%20granting%20motion%27s%20motion%20for%20court%20ordered%20holiday%20visitation%20%2011.6.2025.pdf\n40 41 42 43 44 45 2024-09-20_transcript_divorce_trial_part2.pdf\nhttps://www.dropbox.com/preview/master_court_files/02_transcripts/2024-09-20_transcript_divorce_trial_part2.pdf\n53 65 66 67 91 100 2025-09-10_exhibits_from_dr._tyler's_deposition.pdf\nhttps://www.dropbox.com/preview/master_court_files/04_evidence%20%26%20exhibits/\n2025-09-10_exhibits_from_dr._tyler%27s_deposition.pdf\n14\n73 89 extensions & enlargements-appellant brief_1.pdf\nhttps://www.dropbox.com/preview/master_court_files/11_appeal_documents/extensions%20%26%20enlargements-\nappellant%20brief_1.pdf\n97 98 104 my bankruptcy reply .pdf\nhttps://www.dropbox.com/preview/master_court_files/19_bankruptcy_chapter_13/my%20bankruptcy%20reply%20.pdf\n15",
  "source_metadata": {
    "method": "pdfplumber",
    "pages": 15
  },
  "modified_time": 1767929814.0
}