{
  "doc_id": "2243fa0c9e7c90044dab671af414170c605e909b389c3cb9bdadb7db79641b5a",
  "file_path": "C:\\Users\\blain\\Dropbox\\Master_Court_Files\\03_Pleadings\\OBJECTION TO MOTION TO SET ASIDE COURT ORDERED HOLIDAY VISITATION 11.6.25.pdf",
  "file_name": "OBJECTION TO MOTION TO SET ASIDE COURT ORDERED HOLIDAY VISITATION 11.6.25.pdf",
  "doc_type": "pdf",
  "date": null,
  "parties": [],
  "raw_text": "AlaFile E-Notice\n70-DR-2023-900051.01\nJudge: KEVIN HALL\nTo: DAVIS DIANNE JAMES\ndianne@diannedavislaw.com\nNOTICE OF ELECTRONIC FILING\nIN THE CIRCUIT COURT OF TALLAPOOSA COUNTY, ALABAMA\nCHRISTOPHER BLAINE MCGREGOR V. BRITTANY MICHELLE GILLILAND\n70-DR-2023-900051.01\nThe following matter was FILED on 11/6/2025 5:20:52 PM\nD001 GILLILAND BRITTANY MICHELLE\nMOTION TO SET ASIDE ORDER GRANTING COURT-ORDERED HOLIDAY VISITATION\n[Filer: AGRICOLA BARBARA HAMLIN]\nNotice Date: 11/6/2025 5:20:52 PM\nPATRICK CRADDOCK\nCIRCUIT COURT CLERK\nTALLAPOOSA COUNTY, ALABAMA\n395 LEE STREET\nALEXANDER CITY, AL, 35010\n256-234-4361\npatrick.craddock@alacourt.gov\nDOCUMENT 425\nELECTRONICALLY FILED\n11/6/2025 5:20 PM\n70-DR-2023-900051.01\nCIRCUIT COURT OF\nTALLAPOOSA COUNTY, ALABAMA\nPATRICK CRADDOCK, CLERK\nIN THE CIRCUIT COURT OF TALLAPOOSA COUNTY, ALABAMA\nCHRISTOPHER BLAINE MCGREGOR,\nRespondent,\nv. CASE NO.: 70-DR-2023-900051.01\nBRITTANY MICHELLE GILLILAND,\nPetitioner.\nOBJECTION TO MOTION TO SET\nASIDE COURT ORDERED HOLIDAY VISITATION\nCOMES NOW, Petitioner BRITTANY GILLILAND, by and through the undersigned\ncounsel of record, Barbara H. Agricola, with the law firm of Agricola Law, LLC, and files this\nObjection to Motion to Set Aside Order Granting Court-Ordered Holiday Visitation. In support\nthereof, Petitioner states as follows:\n1. On November 5, 2025, Mother filed a Motion for Court-Ordered Holiday Visitation\nwhich was granted by this Honorable Court on November 6, 2025 [Doc. 416];\n2. On November 6, 2025, Father filed a Motion to Set Aside in regards to holiday\nvisitation, citing that due to reunification therapy not occurring in its entirety, that the\npreviously ordered visitation was not to come into effect. Further, Father states that the\nweekly dinners were to replace the previously ordered visitation in the interim.\nHowever, this did not address the matter of holiday visitation, in which no visitation\nwas decided. As a result, the Parties have opted to follow the holiday visitation\nagreement as set out in the Parties’ Final Decree of Divorce. However, Father will not\nagree as to the Minor Child A.K. The purpose of Mother’s Motion for Court Ordered\nHoliday Visitation was specifically because of what is unfolding now with Father once\nagain blocking visitation with A.K.\nBrittany Michelle Gilliland v. Christopher Blaine McGregor\nCircuit Court of Tallapoosa County, Alabama\nCase No.: 70-DR-23023-9000051.01\nObjection to Motion to Set Aside\nPage 1 of 4\nDOCUMENT 425\n3. Ironically, it is Father’s own actions that have blocked the continuation of reunification\ntherapy. Had all ten sessions occurred, it is likely that the Parties would have already\nresumed their previously ordered visitation as set out in the Final Decree;\n4. The reunification therapist has communicated on several occasions through her\ncounseling report, and through multitudes of emails and text correspondence between\nthe Parties of her policies which resulted in the therapist terminating the Parties as\nclients. Despite this, Father willfully continued to ignore the counseling policies. See\nemail correspondence between Kelly Turner and the Parties, attached as Exhibit A;\n5. In regard to family dinners, Father refuses to cooperate with Mother in regard to her\nweekly schedule which is the reason for many missed dinners. This most recent dinner\non November 2, 2025, Mother respectfully asked Father to schedule dinner at 1:30pm,\nwhich she has requested for months. Father is well aware that Mother has Sunday\nchurch until 12:15 and has a newborn baby which has a varying feeding schedule.\nDespite Father being well aware that Mother is not available until after 12:15 because\nof church, and Mother pleading numerous times to adjust the meeting time between the\nParties and Minor Children, he has boldly denied her. Thus, he has deprived her of\nprecious bonding time with the Minor Child A.K. and Mother;\n6. Furthermore, for the upcoming Sunday, on November 9, 2025, Mother has requested\nthat Father bring Minor Child A.K. to A.K.’s sister’s baby dedication at Mother’s\nchurch. Father blatantly struck down this proposal and stated that the baby dedication\n“doesn’t concern our two children.” Mother’s newborn is the biological sibling of the\ntwo Minor Children in this action. It is abundantly clear by Father’s demeanor and\nactions that he wishes to deprive the Minor Children and Mother of being able to foster\nBrittany Michelle Gilliland v. Christopher Blaine McGregor\nCircuit Court of Tallapoosa County, Alabama\nCase No.: 70-DR-23023-9000051.01\nObjection to Motion to Set Aside\nPage 2 of 4\nDOCUMENT 425\na relationship with their new half-sibling. This Court should note that no father would\never in good conscience want his children to view any other family member, especially\na young baby, as “not their concern” unless it was to further drive a wedge between\nMother and the Minor Children. See Exhibit A, text correspondence between the\nParties;\n7. The April 14, 2025 Order referenced by Father was clearly a temporary order filed by\nthis Court and not in reference to holiday visitation. Father’s assertion that Mother\nshould have given holiday gifts to A.K. during dinners is an irrelevant point. Mother’s\nwish to exchange gifts to her children during the holidays is specifically to spend\nprecious family bonding time during a holiday season in which family are meant to\ncome together. Despite this, Father still wishes to deprive Mother of this;\n8. Father’s Motion for Contempt was filed only days after this Court ordered for Minor\nChild A.K.’s counseling to continue. Mother has full intention of complying with this\nCourt’s orders, unlike Father, and does not wish to force this Court to meddle over\nminor disagreements. Mother intends to sign the required consent documentation as\nsoon as she is able to do so;\n9. The very fact that Father would even file a motion so as to deprive Mother of only five\n(5) days of visitation with the Minor Child A.K. during the holiday season is a\ndisgusting display of Father’s true intentions. To reiterate, Mother has been completely,\nand utterly unable to exercise ANY of her visitation with the Minor Child A.K. since\nthis action was initiated specifically because of Father’s actions;\n10. Mother respectfully requests this Honorable Court honor the Parties’ holiday visitation\nagreement and uphold its order stating as such. The longer that Mother is unable to\nBrittany Michelle Gilliland v. Christopher Blaine McGregor\nCircuit Court of Tallapoosa County, Alabama\nCase No.: 70-DR-23023-9000051.01\nObjection to Motion to Set Aside\nPage 3 of 4\nDOCUMENT 425\nexercise any visitation with Minor Child A.K. the more the parental alienation by\nFather will worsen.\nWHEREFORE, PREMISES CONSIDERED, Mother respectfully requests this\nHonorable Court uphold its November 6, 2025 Order on Holiday Visitation.\nRespectfully submitted on November 6, 2025.\n/s/ Barbara H. Agricola (AGR004))\nAttorney for Petitioner\nOF COUNSEL:\nAGRICOLA LAW\n127 South 8th Street\nOpelika, Alabama 36801\nTelephone: 334.759.7557\nFacsimile: 334.759.7558\nbarbara@agricolalaw.com\nwww.agricolalaw.com\nCERTIFICATE OF SERVICE\nThis is to certify that I have this day served the following with a copy of the foregoing, by\nelectronic filing in the AlaCourt E-File System and/or by placing same in an envelope, properly\naddressed, and depositing it in the United States Mail, with adequate postage prepaid on November\n6, 2025.\nDianne James Davis\nAttorney for Father\n107 Main Street\nAlexander City, Alabama 35010\n/s/ Barbara H. Agricola\nOF COUNSEL\nBrittany Michelle Gilliland v. Christopher Blaine McGregor\nCircuit Court of Tallapoosa County, Alabama\nCase No.: 70-DR-23023-9000051.01\nObjection to Motion to Set Aside\nPage 4 of 4\nDOCUMENT 426\nELECTRONICALLY FILED\n11/6/2025 5:20 PM\n70-DR-2023-900051.01\nCIRCUIT COURT OF\nTALLAPOOSA COUNTY, ALABAMA\nPATRICK CRADDOCK, CLERK\nDOCUMENT 426\nDOCUMENT 426\nDOCUMENT 427\nELECTRONICALLY FILED\n11/6/2025 5:20 PM\n70-DR-2023-900051.01\nCIRCUIT COURT OF\nTALLAPOOSA COUNTY, ALABAMA\nPATRICK CRADDOCK, CLERK\nDOCUMENT 427\nDOCUMENT 427\nDOCUMENT 427\nDOCUMENT 427\nDOCUMENT 427\nDOCUMENT 427\nDOCUMENT 427",
  "source_metadata": {
    "method": "pdfplumber",
    "pages": 16
  },
  "modified_time": 1767901542.0
}