{
  "doc_id": "2605b971218e046bfc38c7a161877f46a409b9ac9850eb233adb596b3249b6c3",
  "file_path": "C:\\Users\\blain\\Dropbox\\Master_Court_Files\\01_Orders\\2024-11-06_Order_RT.pdf",
  "file_name": "2024-11-06_Order_RT.pdf",
  "doc_type": "pdf",
  "date": null,
  "parties": [],
  "raw_text": "AlaFile E-Notice\n70-DR-2023-900051.01\nJudge: STEVEN R PERRYMAN\nTo: YOUNG THOMAS FREDRICK JR\ntyoung@mhhlaw.net\nNOTICE OF ELECTRONIC FILING\nIN THE CIRCUIT COURT OF TALLAPOOSA COUNTY, ALABAMA\nCHRISTOPHER BLAINE MCGREGOR V. BRITTANY MICHELLE GILLILAND\n70-DR-2023-900051.01\nThe following matter was FILED on 11/6/2024 8:56:03 AM\nNotice Date: 11/6/2024 8:56:03 AM\nPATRICK CRADDOCK\nCIRCUIT COURT CLERK\nTALLAPOOSA COUNTY, ALABAMA\n395 LEE STREET\nALEXANDER CITY, AL, 35010\n256-234-4361\npatrick.craddock@alacourt.gov\nDOCUMENT 66\nELECTRONICALLY FILED\n11/6/2024 8:56 AM\n70-DR-2023-900051.01\nCIRCUIT COURT OF\nTALLAPOOSA COUNTY, ALABAMA\nPATRICK CRADDOCK, CLERK\nIN THE CIRCUIT COURT OF TALLAPOOSA COUNTY, ALABAMA\nALEX CITY DIVISION\nMCGREGOR CHRISTOPHER BLAINE, )\nPlaintiff, )\n)\nV. ) Case No.: DR-2023-900051.01\n)\nGILLILAND BRITTANY MICHELLE, )\nDefendant. )\nOrder\nThis matter came before the Court for a show cause hearing on July 31, 2024,\nconcerning the Petition for Contempt filed by the Petitioner, Brittany Michelle Gilliland\n(hereinafter “Mother”), and the Counterclaim for Contempt filed by the Respondent,\nChristopher Blaine McGregor (hereinafter “Father”). These claims relate to alleged\nviolations of the Court’s February 27, 2024, Final Decree of Divorce, specifically\nregarding visitation with the Parties’ minor child, A.K.\nPrior to the hearing, the Parties agreed that the Court would conduct an in\ncamera interview with the minor child, A.K., whose relationship with the Mother and\nMother’s visitation were central issues to the claims at hand. Present during the in\ncamera interview and the hearing were the Parties’ respective counsel, Barbara\nAgricola and Matthew Holdren for the Mother, and Tom Young for the Father, as well as\nthe court reporter.\nThe Court received testimony from the minor child concerning her current\nrelationship with the Mother and her reasons for not abiding by the court-ordered\nvisitation as laid out in the divorce decree. Following the in camera interview, counsel\nfor both Parties, along with the Court, agreed that proceeding with the show cause\nhearing was not appropriate at this time.\nAccordingly, it is hereby ORDERED:\n1. Continuation of Show Cause Hearing: The show cause hearing scheduled for July\n31, 2024, is hereby continued generally, until further motion of either Party to set the\nmatter for a hearing after the court-ordered counseling begins.\n2. Reunification Therapy: Effective immediately, Mother and A.K. shall begin attending\njoint counseling/therapy sessions with Kelly Turner, a specialist in reunification therapy.\nUpon the therapist submitting her reunification report to the Court, A.K. and Mother\nshall continue to see Ms. Turner, provided no ethical conflicts exist, until Mother feels\nthat reunification counseling is no longer necessary.\n3. CAC Joint Counseling Sessions: At this time, the CAC is unavailable to conduct joint\nDOCUMENT 66\ncounseling sessions. Once the CAC determines that joint counseling sessions would be\nbeneficial to the CAC counseling plan, Mother shall be permitted to attend any and all\nsessions with A.K. that the CAC permits.\n4. Cost of Counseling: The costs of any joint counseling sessions attended by Mother\nand A.K. shall be paid in accordance with the terms for covered and uncovered medical\nexpenses as outlined in the divorce decree, in that any medical expenses not covered\nby the Father’s insurance for A.K. shall be divided equally between the Parties. If\nFather ever impedes upon these counseling sessions, causes A.K. to miss the\nsessions, or allows A.K. to miss the sessions, for any reason other than emergency,\nthis will be considered willful contempt of this Court’s order.\n5. Reunification Specialist’s Report: The Parties are directed to provide a copy of this\nOrder to the reunification specialist and A.K.’s counselor. The Court hereby requests\nthat the specialist submit a report to this Court and to counsel for both Parties after 10\njoint reunification therapy sessions with the Mother and A.K., or, if earlier, when the\nspecialist believes that the Mother and A.K. have established a relationship sufficient to\nmake the previously ordered visitation beneficial to A.K.\n6. Weekly Family Dinners: Beginning immediately, the Parties shall attend weekly\ndinners together, including the Mother, Father, A.K., and the Parties’ minor son. These\ndinners shall take place every Wednesday evening at 6:30pm CST. These Wednesday\nevening dinners shall take priority over all other events and shall only be cancelled in\ncase of emergency. If the Wednesday night dinner is cancelled, the Parties shall have a\n“make-up” dinner the following day.\nDONE this 6thday of November, 2024.\n/s/ STEVEN R PERRYMAN\nCIRCUIT JUDGE",
  "source_metadata": {
    "method": "pdfplumber",
    "pages": 3
  },
  "modified_time": 1758991462.0
}