{
  "doc_id": "29801d86b9a57148bff8c6d0ecce42b023adcbc4ce1d1a1b0e7de37a15627e12",
  "file_path": "C:\\Users\\blain\\Dropbox\\Master_Court_Files\\23_Extra_Dont_Include\\Example of Visitation proposal Updated 10.31.25.docx",
  "file_name": "Example of Visitation proposal Updated 10.31.25.docx",
  "doc_type": "docx",
  "date": null,
  "parties": [],
  "raw_text": "PARENTING CLAUSES  \n\nCHANGE to Daily FaceTime Calls\nBoth parties shall have reasonable telephone access to the minor child(ren) while they are in the physical control of the other parent. The minor children should also have reasonable telephone access to both parties during a 1-hour time period as agreed upon by the parties, taking into consideration the children's schedule. If a conflict develops regarding phone time, it shall be nightly between 7:00 p.m. -  8:00 p.m.\n\nCurrent Daily FaceTime Call\nEach parent shall have the right to call or Facetime with the minor children once a day while the children are with the other parent.\n\nVisitation\nThe Mother shall have visitation periods as follows: Friday 6:00 PM to Sunday 6:00PM – Every other weekend\nIf A.K.M wishes to visit with Mother, Father must allow & support the visit. In the event A.K.M. wishes not to visit, Visitation shall not be forced by either the Father or the Mother. \n\nCurrent Visitation by Divorce Decree\nThe Mother shall have visitation periods as follows: From picking up the children on Thursday at school until taking the children back to school on the following Monday morning on the 1st & 3rd weeks of each month. \n\nFinal Decision Making – In the event the Mother & Father can not agree on education or medical, Father hold the right to final decision making.\n\nChild Support – The Mother shall pay the Father $300 per month in child support by the 15th of each month. Mother and Father should split any medical, dental, vision, or orthodontic expense for the children not covered by insurance expense over $1000.00. All other medical cost to be covered by the Father. Health insurance to be covered by the Father. For any expense over $1000.00, the paying party shall notify the other party within 20 days of the date expense incurred; thereafter, the non-paying party shall reimburse the paying party its share within 14 days of being notified of the expense.\n\nCurrent Child Support- Mother shall pay the father $617 by the 15th of each month. The Father shall maintain health and dental insurance on the minor children. Any medical, dental, vision, or orthodontic expense for the children not covered by insurance shall be equally divided between the parties. The party shall notify the other party within 20 days of the expense incurred; thereafter, the non-paying party shall reimburse the paying party its share within 14 days of being notified of the expense.\n\nBack Child Support & Medical – Father agrees to release mother from any and all past due medical bills. (Use this as a last resort)",
  "source_metadata": {
    "method": "python-docx",
    "size": 537952,
    "modified_time": 1767901578.0
  },
  "modified_time": 1767901578.0
}