{
  "doc_id": "2d8403b07a823cfc92b0d2f0ac2ebc6029ee040ece7b3d557ea5150b33c5c27b",
  "file_path": "C:\\Users\\blain\\Dropbox\\Master_Court_Files\\11_Appeal_Documents\\2025-05-02_ APPEALS_DECISION_MEMORANDUM_DECISION_AFFIRMED.pdf",
  "file_name": "2025-05-02_ APPEALS_DECISION_MEMORANDUM_DECISION_AFFIRMED.pdf",
  "doc_type": "pdf",
  "date": null,
  "parties": [],
  "raw_text": "Rel: May 2, 2025\nNotice: This unpublished memorandum is being issued to the\nparties and to the trial-court judge. The memorandum is not\nsubject to publication and shall not be made a part of the public\ncourt record by the trial-court clerk. This unpublished\nmemorandum should not be cited as precedent. See Rule 54, Ala.\nR. App. P. Rule 54(d) states, in part, that this memorandum \"shall\nhave no precedential value and shall not be cited in arguments\nor briefs and shall not be used by any court within this state,\nexcept for the purpose of establishing the application of the\ndoctrine of law of the case, res judicata, collateral estoppel,\ndouble jeopardy, or procedural bar.\" Notwithstanding the\nforegoing, a party may quote or cite this unpublished\nmemorandum in an application for rehearing or a petition for a\nwrit of certiorari arising from this decision.\nALABAMA COURT OF CIVIL APPEALS\nOCTOBER TERM, 2024-2025\n_________________________\nCL-2024-0597\n_________________________\nBrittany Michelle Gilliland\nv.\nChristopher Blaine McGregor\nAppeal from Tallapoosa Circuit Court\n(DR-23-900051)\nMEMORANDUM DECISION\nCL-2024-0597\nFRIDY, Judge.\nBrittany Michelle Gilliland (\"the wife\") appeals from a judgment of\nthe Tallapoosa Circuit Court (\"the trial court\") divorcing her from\nChristopher Blaine McGregor (\"the husband\"). We affirm the trial court's\njudgment by unpublished memorandum.\nBackground\nThe husband and the wife married in 2018. (R.7.) They have two\nchildren. (Id.) On August 18, 2023, the husband filed a complaint seeking\na divorce from the wife, alleging an irretrievable breakdown of the\nmarriage and requesting, among other things, an equitable division of\nthe marital estate, sole custody of the children, and possession of the\nmarital residence. (C.12–13.) That same day, the husband filed an ex\nparte motion in which he alleged that the wife had bruised one of the\nchildren by striking or grabbing her, and he sought a pendente lite award\nof custody of the children, possession of the marital residence, and child\nsupport. (C.15–16.) The trial court entered an order awarding the\nhusband custody of the children and possession of the marital residence\npendente lite and setting the matter for a hearing on September 12, 2023.\n(C.17.)\n2\nCL-2024-0597\nOn September 8, 2023, the wife filed an answer generally denying\nall material allegations in the husband's complaint; she also asserted a\ncounterclaim for a divorce. (C.19–21.) She alleged that the husband was\nphysically and mentally abusive, and she requested custody of the\nchildren, spousal support, an equitable division of the marital estate and\nmarital debts, and possession of the marital residence. That same day,\nthe wife filed a motion to vacate the August 18, 2023, order, asserting\nthat the husband was alienating the children, that the allegation of abuse\nin the husband's ex parte motion was false, and that the husband had\ncommitted multiple acts of domestic violence, including an incident in\nMay 2023 in which he struck her on the head with a laptop computer.\n(C.23–26.) The trial court set a hearing on the wife's motion for\nSeptember 12, 2023, at the same time on which it had set the hearing on\nthe husband's ex parte motion. (C.34.)\nOn September 12, 2023, the trial court held the scheduled hearing\non the parties' motions, at which it received ore tenus testimony. (C.47.)\nThe record reflects that one of the children testified at the hearing (R.13);\nhowever, no transcript of that hearing is included in the record on appeal.\nAfter the hearing, the trial court entered a pendente lite order in which,\n3\nCL-2024-0597\namong other things, it awarded the parties joint legal custody of the\nchildren, awarded the husband sole physical custody of the children and\nuse of the marital residence, and awarded the wife visitation with the\nchildren. (C.47.)\nThe trial court held a trial in the case on November 6, 2023. (R.1.)\nDuring the trial, the following exchange occurred:\n\"[The husband's attorney]: And, Judge, a lot of these\nthings are what we've introduced before. I don't know if the\nCourt wants to take judicial notice of what you got before, but\nI'll be glad to go into them again.\n\"THE COURT: That's fine.\n\"[The wife's attorney]: Judge, I have no objection to you\nadopting the full-fledged pendente lite hearing and\nconsidering it as part of this.\n\"The [trial court]: All right. Let's do that.\n\"[The husband's attorney]: That's fine with me, Judge.\nThank you.\"\n(R.19.) (Emphasis added.)\nOn February 1, 2024, the trial court entered a judgment, which it\nvacated later that same day, stating that it had entered the judgment in\nerror. (C.83–91.) On February 27, 2024, the trial court entered a new\njudgment. (C.92–99.) In it, the trial court, among other things, awarded\n4\nCL-2024-0597\nthe parties joint legal custody of the children, awarded the husband sole\nphysical custody of the children and possession of the marital residence,\nand awarded the wife visitation with the children.\nOn March 20, 2024, the wife filed a motion to alter, amend, or\nvacate the judgment (C.100–02), which was denied by operation of law,\nsee Rule 59.1, Ala. R. Civ. P. The wife filed a timely notice of appeal.\nAnalysis\nIn her brief to this court, the wife asserts that the evidence does not\nsupport the trial court's award to the husband of sole physical custody of\nthe children. In his brief in response, the husband argues, among other\nthings, that the wife's failure to include in the record on appeal the\ntranscript from the pendente lite hearing requires affirmance of the trial\ncourt's judgment.\nOn January 18, 2025 -- more than three months after the trial-court\nclerk had certified the record on appeal and nearly two months after the\nwife had filed her brief -- the wife filed in the trial court a motion\npursuant to Rule 10, Ala. R. App. P., seeking to supplement or correct the\nrecord. In that motion, she asserted that the trial court had conducted\nthe pendente lite hearing, that a court reporter was present at that\n5\nCL-2024-0597\nhearing, and that the court reporter transcribed the parties' testimony at\nthat hearing. On February 1, 2025, the wife filed in this court a motion\npursuant to Rule 10(f), Ala. R. App. P., in which she asserted that the\ntrial court had not corrected the record within fourteen days of the filing\nof her motion, that she had requested that the transcript of the pendente\nlite hearing be made a part of the appellate record, and that a court\nreporter had been present. Notably, she wrote: \"Counsel for [the wife] did\nnot notice the absence of the transcript from the record on appeal until it\nwas pointed out in [the husband's] Brief.\"\nOn February 3, 2025, the husband filed a response to the wife's Rule\n10(f) motion, arguing that the absence of the transcript of the pendente\nlite hearing had been apparent since the record was certified as complete,\nthat the transcript of the final hearing referenced the pendente lite\nhearing being considered by the trial court in making its decision, and\nthat granting the wife relief pursuant to Rule 10(f) would be \"patently\nunfair\" because it would deprive him of the opportunity to respond to the\nadditional testimony. The husband cited Bynum v. Bynum, 296 So. 2d\n711, 725 (Ala. Civ. App. 1974), for the proposition that a judgment cannot\nbe reversed for insufficiency of the evidence when the supporting\n6\nCL-2024-0597\nevidence is not contained in the record on appeal. On February 18, 2025,\nthis court denied the wife's request to supplement the record on appeal\npursuant to Rule 10(f).\nBoth of the issues the wife raises on appeal rest on the sufficiency\nof the evidence supporting the trial court's judgment. However, the\nrecord reflects that the trial court had before it both the evidence received\nat the final hearing as well as the evidence presented at the pendente lite\nhearing. Although the transcript of the final hearing is included in the\nrecord on appeal, the transcript of the pendente lite hearing is not.\nRule 10(b), Ala. R. App. P., required the wife to include in the record\non appeal \"all evidence relevant\" to any finding or conclusion she\nintended to challenge on appeal. If the transcript was omitted despite\nbeing designated, Rule 10(f) required her to move the trial court to\nsupplement or to correct the record and to attach a copy of the transcript-\npurchase order as proof that the omitted portion of the transcript was\noriginally requested.\nIn her Rule 10(f) motion, the wife acknowledged that the transcript\nfrom the pendente lite hearing was necessary for meaningful appellate\nreview and stated that she had not realized that the transcript was\n7\nCL-2024-0597\nmissing until the husband raised the issue in his appellee's brief.\nNotably, in her brief to this court, she asserts that \"the totality of the\nevidence presented\" failed to support the trial court's custody\ndetermination. However, in her Rule 10(f) filing, she described the\ntranscript of the pendente lite hearing as containing evidence supporting\nthe \"crucial issue\" for appeal, despite its omission from the record on\nappeal. It is well settled that the appellant bears the burden of ensuring\nthat the record on appeal contains sufficient evidence to warrant reversal\nof the judgment at issue and of confirming the accuracy of the appellate\nrecord. See Goree v. Shirley, 765 So. 2d 661, 662 (Ala. Civ. App. 2000).\nWhen oral testimony is presented and a transcript of that testimony or a\nRule 10(d) statement of the evidence is not included in the record on\nappeal, this court must conclusively presume that the omitted testimony\nsupports the trial court's judgment. See Quick v. Burton, 960 So. 2d 678,\n680 (Ala. Civ. App. 2006).\nAt trial, the wife's counsel expressly stated that he did not object to\nthe trial court considering the evidence presented at the pendente lite\nhearing as part of the trial. The transcript of the final hearing further\nreflects that the trial court agreed to consider that testimony in rendering\n8\nCL-2024-0597\nits judgment. Because that testimony is not included in the appellate\nrecord -- either as a transcript or as a Rule 10(d) statement of the\nevidence -- we must conclusively presume that that testimony supports\nthe trial court's judgment. See Quick, 960 So. 2d at 680. Accordingly, the\nwife has not demonstrated reversible error.\nConclusion\nFor the foregoing reasons, the trial court's judgment is affirmed.\nAFFIRMED BY UNPUBLISHED MEMORANDUM.\nMoore, P.J., and Edwards, Hanson, and Lewis, JJ., concur.\n9",
  "source_metadata": {
    "method": "pdfplumber",
    "pages": 9
  },
  "modified_time": 1758993909.0
}