{
  "doc_id": "2f185868b452b9e8b40799f2325b08981fefcb7bf079a774d751224a4a66bb8c",
  "file_path": "C:\\Users\\blain\\Dropbox\\Master_Court_Files\\15_Letters_and_Emails\\2024-08-13_Letter_Tom_to_Matt_RT_Turner.pdf",
  "file_name": "2024-08-13_Letter_Tom_to_Matt_RT_Turner.pdf",
  "doc_type": "pdf",
  "date": null,
  "parties": [],
  "raw_text": ".\n3500 Blue Lake Drive\nRandall S. Haynes Suite 200\nReply to:\nJeremy Knowles Birmingham, AL 35243\nAmanda L. Luker\n131 MAIN STREET• PO BOX 1660\nClay Hornsby Office 205.324.4008\nALEXANDER CITY, AL 35010-1660\nNancy L. Eady Fax 205.324.0803\nLuke M. Trammell OFFICE 256.329.2000 • FAX 256.329.2015\nwww.mhhlaw.net\nOF COUNSEL\nLarry W. Morris\nGeorge L. Beck, Jr.\nTom F. Young, Jr.\nEmily Hornsby*\n*also licensed in Georgia\nAugust 13, 2024\nEMAIL ONLY: matt@agricolalaw.com\nMr. Matt Holdren\nAgricola Law\n127 South 8th Street\nOpelika, AL 36801\nRE: Gilliland v McGregor\nCase No.: 70-DR-2023-900051.01\nDear Matt:\nMy client has posed several concerns regarding your proposed order. First, if the\nreunification counseling requires my client’s attendance, we will have to take into\nconsideration that he has a job and cannot just leave at any given time. If the\nreunification counseling does not involve my client, I am assuming that your client will\nmake transportation arrangements for said counseling. Secondly, if I remember the\nJudge’s comment correctly, he mentioned Wednesday as an example but said he did\nnot care if the time spent with your client was breakfast, lunch, or dinner. There are a\nnumber of activities that AK has at times that conflict with a set date. The parties must\nbe flexible in order to make sure that a meal during the week works for everyone’s\nschedule. And last, Brittany was recently invited over to my client’s home to see the kids\nand to take pictures before they left for their first day at school. The entire time she was\nthere, she held her phone camara up for the purpose of recording everyone. This\nbehavior is obviously not conducive to a good working relationship, and we request that\nshe reframe from said behavior in future visits.\nIf we cannot reach a mutual agreed upon proposed order, I suggest that each on\nof us file our own Order with the Court, so that the Court can determine which one can\nbe enforced.\nSincerely,\nTOM F. YOUNG, JR.\nTFY/cc",
  "source_metadata": {
    "method": "pdfplumber",
    "pages": 2
  },
  "modified_time": 1759008870.0
}