{
  "doc_id": "3020bd5934e4d5d1dca1137d83de22bd2248bf188af28d343e73890d2a6b6f1a",
  "file_path": "C:\\Users\\blain\\Dropbox\\Master_Court_Files\\07_Other\\Shortened_Affidavit_v2_McGregor.docx",
  "file_name": "Shortened_Affidavit_v2_McGregor.docx",
  "doc_type": "docx",
  "date": null,
  "parties": [],
  "raw_text": "AFFIDAVIT OF CHRISTOPHER BLAINE McGREGOR\nSTATE OF ALABAMA\nCOUNTY OF TALLAPOOSA\n\nBefore me, the undersigned authority, personally appeared Christopher Blaine McGregor, who, being first duly sworn, deposes and states as follows:\nI, Christopher Blaine McGregor, am the father of two minor children, A.K. (age 13) and B.M., and the Defendant/Father in this case. This affidavit responds to the Mother’s “Objection to Motion to Set Aside Court‑Ordered Holiday Visitation” and supports my Motion as to A.K. The facts below are based on my personal knowledge and on our court orders, filings, and transcripts.\n\nAfter a contested trial concluded November 15, 2023, the Final Decree of Divorce entered February 27, 2024 granted me sole physical custody of A.K. and B.M., with the Mother, Brittany M. Gilliland, receiving specified visitation. Evidence showed the Mother physically and emotionally mistreated A.K., including bruising from inappropriate discipline, and that the children were more stable and thriving in my care. DHR opened an investigation November 7, 2023 and issued a “Not Indicated” finding January 5, 2024—meaning abuse was not substantiated, but the concerns raised at trial were not resolved or disproven.\n\nBeginning March 2024, A.K. became fearful and refused visitation with the Mother; she has not spent an overnight or unsupervised weekend with the Mother since the Mother was removed from our home in August 2023. At multiple exchanges, including at school, A.K. panicked; law enforcement was called more than once, and officers advised that A.K. should not be forced into the Mother’s car. At the July 31, 2024 show‑cause hearing, Judge Steven Perryman interviewed A.K. in camera, declined to hold me in contempt, and acknowledged the situation was a genuine issue between A.K. and the Mother—not disobedience by me. He outlined gradual reunification: A.K. would continue with her CAC counselor; the Mother could join some sessions; and both parents and children would have one low‑pressure family meal each week—breakfast, lunch, or dinner—to normalize visitation first, with any specialized reunification therapy to occur later after progress.\n\nA written order dated November 6, 2024—drafted by the Mother’s counsel and signed by the Court—required immediate reunification therapy with Kelly Turner and fixed weekly Wednesday dinners at 6:30 p.m., departing from the Judge’s flexible oral guidance. Despite the differences, I complied fully with the November 6 order.\n\nFrom January through August 2025, approximately 30 weekly reunification meals were scheduled; the Mother missed well over half, often without notice, cutting off critical chances to rebuild trust. Illustrative dates include: January 10 (no‑show after she rescheduled to Saturday morning), February 5 (canceled Wednesday, then no‑show Thursday), February 12 (no‑show; next morning she falsely accused me of refusing a make‑up), April 20/Easter (no participation), May 11/Mother’s Day (declined dinner; picked up only B.M.), June 1 (last‑minute cancel), June 22 and June 29 (missed), July 6 and July 13 (missed after announcing she “won’t be able to do dinners until I get back to work”), July 20 (left town early to return to Clanton before dark), August 3 (no response/no‑show), August 10 (agreed to 1:30 p.m. at Who’s Diner but never came), August 17 (refused to come to Alexander City and insisted I deliver A.K. to Clanton), and August 24 (missed, citing childcare for step‑children). I attended every scheduled meeting, paid virtually all costs, and kept detailed logs. The Mother relocated to Clanton, Alabama, and told me she had quit her job and lacked a fixed schedule; to accommodate her, I agreed to move the weekly dinners from Wednesdays to Sundays (generally 1:00–6:00 p.m., sometimes 1:30 p.m. per her request). Even with that flexibility, she repeatedly failed to attend. Her pattern continues to cause A.K. emotional harm. On July 31, 2025, during B.M.’s exchange, I encouraged the Mother to step out and speak with A.K.; she remained in her car, and A.K. texted later, upset that her mother “never even got out of the car to speak to me or congratulate me.” The Mother has also failed to reimburse her share of medical expenses and is approximately $1,500 behind on child support.\n\nI have complied with all orders and encouraged the children’s relationship with their Mother. I have never told A.K. to refuse visitation. I repeatedly rescheduled, drove to neutral locations, and even shared holidays I was not required to share—including giving the Mother additional time Thanksgiving 2024, inviting her for Easter 2025, and arranging a Mother’s Day 2025 dinner she declined. When the Mother gave birth in 2025, I took both children to the hospital with gifts, snacks, and to meet their new sibling. I hosted A.K.’s birthday at my home and invited the Mother and her husband against A.K.’s wishes; they attended from roughly 3:00 p.m. to 9:00 p.m., we shared dinner, cake, and ice cream, and played volleyball—even as the Mother posted publicly on Facebook accusing me of alienation while sitting in my living room. I have also facilitated phone/video contact upon request and ensured B.M. maintained his normal visitation. On multiple occasions I traveled to make contact easier—for example, meeting in Prattville for dinner and then taking both children with the Mother to Target and a thrift store so she had extra informal time. I have also invited the Mother and her step‑children to join us for shopping and dinner to allow additional time with A.K.\n\nRegarding reunification therapy: before any order existed, on August 20, 2024 Kelly Turner texted both parties that she was the court‑appointed therapist and referenced a first session the day before (August 19) with the Mother; A.K. had not attended as she was sick and this text was the first I had heard about reunification with Kelly Turner. I replied that no order had been entered and asked whether Ms. Turner had any prior relationship with the Mother; she did not answer. After the Court’s November 6, 2024 appointment, I ensured A.K. attended every scheduled session. In November 2024, Ms. Turner set a session that directly conflicted with A.K.’s long‑scheduled pediatric behavioral evaluation. I begged by text and email on November 12, 2024 to reschedule, explaining the appointment’s importance; Ms. Turner refused and directed me to email only. As a result, I complied with the therapy order and A.K. missed the medical evaluation. Ms. Turner often failed to reply promptly to my emails and appeared to coordinate primarily with the Mother. At an early joint session, Ms. Turner told A.K. she did not believe the Mother had ever hurt her and that, based on Ms. Turner’s court experience, “the court doesn’t believe you either.” A.K. left traumatized, suffered a panic attack, required a pediatric visit the next day, and was prescribed anti‑anxiety medication for future sessions. Ms. Turner withdrew in January 2025 and, on February 12, 2025—the eve of a hearing—filed an affidavit accusing me of manipulating the process, despite never meeting me in person or observing me with my children. My counsel moved to strike her affidavit as one‑sided and unsupported.\n\nI have not alienated A.K. from her Mother. A.K.’s distrust stems from the Mother’s conduct, including a July 2023 incident that left bruises, and from repeated missed opportunities since the order. I continue to facilitate contact; I have also observed inconsistencies—for example, the Mother sold, on Facebook Marketplace, items she claimed I prevented her from giving to A.K for Christmas. These facts undercut allegations that I obstructed contact.\n\nForcing overnight holiday visitation upon A.K. in 2025 would likely inflict serious emotional harm and set back reunification. My request is temporary and limited to A.K. for the 2025 holidays. A tailored pause on A.K.’s overnight Thanksgiving and Christmas visitation this year will protect her well‑being, support gradual progress through counseling and weekly meals, and better position the Mother–daughter relationship to succeed in the future.\n\nAccordingly, I respectfully ask the Court to overrule the Mother’s Objection and grant my Motion to Set Aside Court‑Ordered Holiday Visitation for A.K. for the 2025 holiday season. I affirm the truth of the foregoing to the best of my knowledge and submit this affidavit solely to protect my daughter’s welfare and serve the children’s best interests.\n\nFurther affiant sayeth not.\n\n_____________________________________\nChristopher Blaine McGregor\n\nSubscribed and sworn before me this _____ day of ______________, 2025.\n\n_____________________________________\nNotary Public\nMy Commission Expires: ___________",
  "source_metadata": {
    "method": "python-docx",
    "size": 30520,
    "modified_time": 1767901577.0
  },
  "modified_time": 1767901577.0
}