{
  "doc_id": "381a3531ec0d6d805f82cba77ba508062476276784e710ec360cab5c7b61e2b6",
  "file_path": "C:\\Users\\blain\\Dropbox\\Master_Court_Files\\20_Jan_Contempt_Info\\Missed and Disrupted Reunification Dinners.docx",
  "file_name": "Missed and Disrupted Reunification Dinners.docx",
  "doc_type": "docx",
  "date": null,
  "parties": [],
  "raw_text": "Missed and Disrupted Reunification Dinners\nThe Court ordered weekly reunification dinners to help rebuild the relationship between Brittany (“Mother”) and our daughter, A.K. The order required attendance unless there was an emergency and to make up any missed dinner the following day.\nBetween January and August 2025, Brittany failed to attend, canceled, or cut short the majority of those dinners.\nOn January 10, 2025, Brittany rescheduled the court-ordered dinner to Saturday morning. I arrived with both children at 9:00 a.m. as agreed; she did not appear.\nOn February 5, 2025, Brittany texted that she could not attend that Wednesday’s dinner because of work. She proposed Thursday instead but did not show up then either.\nOn February 12, 2025, I waited with the children for thirty minutes; Brittany never arrived. The next morning, she accused me by text of “refusing make-up dinner” and threatened contempt even though she had not appeared the night before.\nOn April 20 (Easter) and May 11 (Mother’s Day), I offered dinners so she could spend time with A.K.; she failed to participate.\nFrom June through August 2025, Brittany routinely ignored or canceled Sunday dinners. On June 1, June 22, and June 29 she gave late-day excuses. In July she wrote she “won’t be able to do dinners until I get back to work,” missing July 6 and 13 entirely. On July 20 she left a planned dinner early, saying she needed to return to Clanton before dark.\nOn August 3, I sent multiple texts asking her what time she would meet us; she never answered or appeared. On August 10, she agreed to meet at 1:30 p.m. at Who’s Restaurant but never came. On August 17, she refused to come to Alexander City, insisting I drive to Clanton. On August 24, she again failed to appear, citing childcare for her stepchildren.\nOut of roughly thirty scheduled dinners from January through August, Brittany missed more than half. Each absence or cancellation is documented in the attached logs and text-message exhibits (Exhibits A–C).\n\n2. Father’s Efforts to Facilitate Visitation and Holiday Compliance\nI have complied with every visitation and counseling order and have gone beyond what was required to promote contact between Brittany and the children.\nFlexibility and Communication: I have kept all weekly dinner time slots open, waited with the children each week, and repeatedly messaged Brittany asking if she planned to attend. When she requested changes, I accommodated them. I only insisted on following the written schedule after she began using my flexibility to accuse me of “missing” dinners.\nSpecial Occasions:\nOn Mother’s Day 2025, I helped both children make gifts for their mother and invited Brittany to have dinner with A.K. Although she came by to pick up B.M., she declined to stay for the dinner and left early.\nOn Easter 2025, I again offered for Brittany to join us for dinner so A.K. could see her mother. Brittany did not attend.\nFor summer 2025 visitation, I proactively offered Brittany an extra week with B.M. during a work trip. She initially refused, then changed her mind; I still allowed her to keep him that week. Counsel for both parties confirmed the arrangement by email on June 2 2025 (Exhibit G).\nTimely Exchanges and Compliance: I have never denied Brittany her visitation with either child. When she arrived for B.M., I ensured punctual exchanges. When she sought to extend time without notice, I reminded her of the court’s schedule but did not refuse access.\nReunification Therapy Cooperation: After the Court ordered reunification therapy for A.K. and Brittany, I cooperated fully. I provided A.K.’s calendar and transportation and supported the sessions. I never contacted the therapist or court to block Brittany’s participation.\nMy actions consistently reflect cooperation and the children’s best interests. The documentary record (Exhibits E–G) confirms that any disruption of visitation resulted from Brittany’s choices, not mine.\n\n3. Inconsistencies in Mother’s Claims vs. Record\nClaim of Missed Dinners: Brittany’s counsel alleged that I failed to attend dinners that she herself canceled or skipped. For example, her attorney claimed in February 2025 that I “missed” a rescheduled dinner when the texts show she canceled and then failed to appear. The record demonstrates that I was present and waiting each scheduled time (Exhibit H).\nClaim of No Communication: Brittany has repeatedly asserted that I “did not communicate plans.” Text-message records show the opposite. On September 14 2025 I texted Brittany that morning confirming the 1–6 p.m. Sunday dinner; she did not respond and later claimed nothing had been planned. The standing order itself fixed the time—no additional planning was needed (Exhibit H).\nClaim of Alienation: Brittany accuses me of alienating A.K. from her. In reality, I have encouraged every reasonable effort at contact. I never prevented communication, and I have facilitated gifts, calls, and therapy sessions. Brittany attended 1 of 12 soccer games, 2 of 16 football games, & 0 of 30 basketball games. \nHoliday Visitation: Brittany objects to setting aside forced holiday visitation for A.K., ignoring the reality that A.K. has expressed severe distress about being forced into visits. When Brittany suddenly demanded summer visitation with A.K. on July 14 2025—after no contact for months—A.K. texted me, “No!! Please I’m scared, why is this starting now. I don’t wanna go I’m gonna have a nervous breakdown if I have to go.” (Exhibit I). Forcing holiday visitation under those conditions would be emotionally harmful and contrary to the Court’s gradual reunification plan.\n\n4. Response to Allegations Concerning Reunification Therapy and Kelly Turner\nCourt Intent (July 31 2024 Hearing): Judge Perryman stated that before any reunification therapy began, A.K. would have individual counseling followed by joint sessions with her mother once appropriate. The transcript (pp. 26 ll. 20-23; 28 ll. 8-11, 14-19; 29 ll. 11-25; 30 ll. 1-6, filed Feb 11 2025) confirms this. The later November 6 2024 order omitted that sequence and directed immediate joint therapy with Kelly Turner. My subsequent filings sought to correct that mistake, not obstruct therapy.\nFull Cooperation: I complied with the November 6 order. I allowed Brittany to select and schedule Kelly Turner, ensured A.K. attended both sessions, and never canceled or interfered. Turner’s own February 12 2025 affidavit admits she met only with Brittany and A.K., never with me, and relied solely on Brittany’s statements. That record shows the process was one-sided through no fault of mine.\nTurner Withdrew Voluntarily: On February 14 2025 my counsel noticed Turner for deposition so her statements could be examined. That same night at 11:46 p.m., Turner emailed:\n“I did withdraw myself from the case via that email. I have not agreed to continue RT at this time … If there is a court order that specifically indicates me to continue with RT, I respectfully would decline.”\nThis email, attached as Exhibit N, proves Turner withdrew of her own accord, not because of any interference by me.\nMy Immediate Follow-Up: I then filed 2025-02-13_MOTION_TO_STRIKE_AFFIDAVIT_OF_KELLY_TURNER.pdf and 2025-02-14_Motion_for_Reunification_Counselor_with_Exhibits_A_B_&_C.pdf, requesting that Caroline Taylor, M.S., LPC—an independent reunification specialist—be appointed so therapy could continue ethically and effectively.\nMischaracterization in Mother’s Objection: Agricola’s filings claim I “sabotaged” therapy. Those allegations are false. Turner’s own affidavit and withdrawal email demonstrate she ceased participation voluntarily after realizing her process was compromised.\nConsistency with Court’s Intent: All my actions aligned with Judge Perryman’s stated goal—to proceed carefully and protect A.K.’s well-being. I supported therapy, cooperated with scheduling, and immediately sought replacement counseling when Turner withdrew.\n\n5. Conclusion and Verification\nI have complied in full with every order of this Court and have made continuous efforts to encourage a healthy relationship between the children and their mother. The attached records show that I have acted transparently, while the Petitioner has repeatedly failed to participate and misrepresented facts.\nFor these reasons, I respectfully ask the Court to deny the Objection to Motion to Set Aside Order Granting Court-Ordered Holiday Visitation.",
  "source_metadata": {
    "method": "python-docx",
    "size": 20381,
    "modified_time": 1767929815.0
  },
  "modified_time": 1767929815.0
}