{
  "doc_id": "3ca8cf58848ade69aef2c85f876c1a2d2f2af53d3828a59ce2eb26f0c56d1723",
  "file_path": "C:\\Users\\blain\\Dropbox\\Master_Court_Files\\01_Orders\\2025-02-27_Final_Divorce_Decree.pdf",
  "file_name": "2025-02-27_Final_Divorce_Decree.pdf",
  "doc_type": "pdf",
  "date": null,
  "parties": [],
  "raw_text": "AlaFile E-Notice\n70-DR-2023-900051.00\nJudge: STEVEN R PERRYMAN\nTo: YOUNG THOMAS FREDRICK JR.\ntyoung@mhhlaw.net\nNOTICE OF ELECTRONIC FILING\nIN THE CIRCUIT COURT OF TALLAPOOSA COUNTY, ALABAMA\nCHRISTOPHER BLAINE MCGREGOR V. BRITTANY MICHELLE GILLILAND\n70-DR-2023-900051.00\nThe following matter was FILED on 2/27/2024 12:56:23 PM\nNotice Date: 2/27/2024 12:56:23 PM\nPATRICK CRADDOCK\nCIRCUIT COURT CLERK\nTALLAPOOSA COUNTY, ALABAMA\n395 LEE STREET\nALEXANDER CITY, AL, 35010\n256-234-4361\npatrick.craddock@alacourt.gov\nDOCUMENT 156\nELECTRONICALLY FILED\n2/27/2024 12:56 PM\n70-DR-2023-900051.00\nCIRCUIT COURT OF\nTALLAPOOSA COUNTY, ALABAMA\nPATRICK CRADDOCK, CLERK\nIN THE CIRCUIT COURT OF TALLAPOOSA COUNT'-,-----~·--\nAT ALEXANDER CITY\nCHRISTOPHER BLAINE )\nMCGREGOR, )\n)\nPlaintiff, )\n)\nvs. ) CASE NO: DR-2023-900051\n)\nBRITT ANY MICHELLE )\nGILLILAND, )\n)\nDefendant. )\nFINAL DECREE OF DIVORCE\nTHIS CAUSE coming to be heard on the 15th day of November, 2023, for trial.\nThe Plaintiff was present with counsel, Tom F. Young, Jr. The Defendant was present\nwith counsel, Thomas A. Radney. Testimony was taken ore tenus. Based on the\npleadings and evidence and testimony presented, it is ORDERED, ADJUDGED and\nDECREED as follows:\n1. The paities shall be divorced on the grounds of incompatibility. The\nPlaintiff is hereby forever DIVORCED from the Defendant.\n2. That either patty may file an appeal within forty-two ( 42) days from the\ndate this decree is executed.\n3. That neither party shall again marry except to each other until sixty ( 60)\ndays after the date of this decree.\n4. If an appeal from this decree is taken within sixty (60) days, neither paity\nshall marry again except to each other during the pendency of said appeal.\n5. The paities shall live completely and separately apait, and neither patty\nshall hereinafter in any way harass, threaten, intimidate, or otherwise act in any way to\nobviously embatrnss or humiliate the other paity.\n6. The mai·ital residence located at 536 Rocky Creek Road, Alexander City,\nAlabama, shall be awarded to the Husband. He shall be responsible for all debts, taxes,\ninsurance, maintenance and expenses related to the prope1ty. The Wife shall be divested\nof all rights, title and interest in the property. Upon receipt of the payment referenced\nDOCUMENT 156\nbelow, the Wife shall execute a Quit Claim Deed conveying her interest in the prope1ty to\nthe Husband,\n7. The Husband shall pay to the Wife one-half (1/2) of the equity in the residence\nwhich is fifty-one thousand four hundred eleven dollars and 21/100 ($51,411.21). This\namount shall be paid as follows: $10,000.00 within 10 days of this order, followed by\nmonthly payments of $2,000.00 per month for 21 consecutive months beginning April 1st.\nThe court is aware that the total of the payments above total $52,000.00. The additional\n$588. 79 awarded may be avoided by the Husband by paying the full $51,411.21 within 90\ndays of this order. Othe1wise, the additional $588.79 shall be consideration for the delay in\nthe Wife receiving full payment. If the Husband fails to timely make these payments, then the\nhouse shall be placed on the market for sale with a licensed real estate agent. Upon sale, the\nnet proceeds shall be equally divided between the parties.\n8, The Wife shall be awarded the following personal prope1ty. She shall\nprovide the Husband notice of the date and time she plans to retrieve these items.\nMaster Bedroom:\na. White Best brand chair\nb. ½ Wall decor\nc. Lamps\nUpstairs:\na, ½ ofMemory boxes\nb, Cricut and supplies\nC, TV 75\"\nd, End tables and coffee table\ne. Kid's clothes/AK's dance clothes/DVDs\nAK'sRoom:\na. Half of her clothing\nb Half her dance awards\nBennett's Room:\na. Frame\nb. Mattress and box springs\nC, 2 nightstands\nd. Dresser\ne. Half of his clothing\nf. ½ Memories in closet\nDOCUMENT 156\ng. Bedding and pillows\nPlayroom:\na. 2 white storage units\nb. 2 framed silhouette pictures\nc. Half of toys\nd. Playmat\ne. Anywhere chair\nf. Train table\ng. Bounce house\nh. 1 toy box\n1. Basketball hoop\nHall Closet:\na. Euro pillows\nb. Beach items\nc. Blankets\nLiving Room:\na. Sofa table and decor items/lamp\nb. Credenza and decor items\nc. Books\nKitchen:\na. Rae Dunn collections\nb. Dutch oven\nc. White Pioneer Woman dinnerware\nd. White serving items/bowls\ne. Christmas dinnerware\nf. Kid's Christmas plates\ng. Crockpots (big and 2 small)\nh. Plant (my grandmother's lily plant)\nDining Room:\na. Brown shelf with Rae Dunn items\nDOCUMENT 156\nb. Rae Dunn and other decor on hutch\nOutdoor:\na. 7-piece table and umbrella\nb. Rug\nBasement:\na. 2 highchairs\nb. ½ Memory boxes\nc. Christmas decor (Blaine keeps Grinch tree and decor)\nd. Kid's Christmas decor\ne. Fall decor\nf. Easter decor\nMiscellaneous:\na. Canon camera/Camcorder\n9. The parties shall equally divide the dogs and puppies.\n10. The Husband shall be awarded the furniture and personal prope1ty\nlocated at the residence not specifically awarded to Wife.\n11. The Wife shall be awarded the 2018 Acura MDX. The Husband shall pay\ndebt cmTent through February 29, 2024. Beginning March 1, 2024, the Wife shall\nassume any debt associated therewith and shall hold the Husband harmless from any\nliability for said indebtedness. She shall be responsible for the tags, taxes, insurance\nand maintenance.\n12. The Husband shall be awarded the 2015 Nissan Altima. He shall\nassume any debt associated therewith and shall hold the Wife harmless from any\nliability for said indebtedness. He shall be responsible for the tags, taxes, insurance,\nand maintenance. The Husband is also awarded the Lawn mower and golf cart. He\nshall pay all indebtedness thereon and hold the Wife harmless for payment thereof.\n13. The paities are awarded joint legal custody of the minor children. The\nHusband is awarded the physical custody of the minor children. The Wife shall have\nvisitation periods as follows: From picking up the children on Thursday at school until\ntaking the children back to school on the following Monday morning on the 1st and 3rd\nweeks of each month. Joint legal custody means that both parents shall be involved in\nDOCUMENT 156\nthe life of the child. Each shall have access to all educational, medical, religious and\nsocial records/occmTences in the life of the child. Each shall have the right to make\nappointments, consult and counsel with any educational or medical professionals\nregarding the children. Each party shall have the right to participate in school\nconferences, events and activities and the right to consult with teachers, school\npersonnel, medical and health care providers, psychologists, and other counselors who\nare working with the minor children. Each party shall be listed as an emergency\ncontact for all schools and medical providers. The patties shall consult each other\nregarding all major decisions. The Patties shall promptly inform the other parent of\nany serious illness and/or injury to the children that requires medical attention. Each\nParty shall provide the other with any medications the children are taking at the time\nof visitation exchanges. Each party shall administer the medication as prescribed. Each\nshall provide the other with sufficient infotmation to allow the other Party to obtain\nrefills of said medications. Each shall notify the other of any medical, educational,\nreligious, or social appointment or event and give the other the reasonable opportunity\nto patticipate. Each Party shall execute any required documents to allow the other\nPatty to access all medical or dental records of the children.\n14. The Wife shall be allowed the following visitation as well:\na. For the months of June and July the 1st and 3rd full weeks, with\nboth children on a week on/week off basis exchanging on Fridays\nat 6:00 p.m.\nb. The parties shall alternate the Christmas holiday with the Mother\nhaving even numbered years from December 18th at 6:00 p.m.\nuntil December 25th at noon and the Father having odd numbered\nyears. The Mother shall have odd numbered years from December\n25th at noon until January 1st at 6:00 p.m. and the Father having\neven numbered years.\nc. The parties shall alternate the Thanksgiving holiday with the\nFather having even numbered years and the Mother having odd\nnumbered years. This visitation shall begin at 6:00 p.m. on\nWednesday and end at 6:00 p.m. the following Sunday.\nDOCUMENT 156\nd. Mother's Day/Father's Day: The minor children shall be with the\nMother on Mother's Day and with the Father on Father's Day\nregardless of the specified visitation schedule from 9:00 a.m. to\n6:00 p.m.\ne. The patties shall alternate Spring break with the Wife having even\nyears and the Husband having odd years.\nf. At times and places mutually agreed upon by the patties.\n15. Each parent shall have the right to call or Facetime with the minor\nchildren once a day while the children are with the other parent.\n16. The Wife shall pay to the Husband the sum of$617.00 per month as child\nsuppott for the use and benefit of the minor children, by the 15th day of each month\nbeginning March 2024.\n17. The Husband shall claim the children every year for income tax purposes.\n18. The Father shall maintain health and dental insurance on the minor\nchildren. Any medical, dental, vision or orthodontic expense for the children not covered\nby insurance shall be equally divided between the patties. The paying patty shall notify\nthe other patty within 20 days of the expense incmTed; thereafter, the non-paying patty\nshall reimburse the paying party its share within 14 days of being notified of the expense.\n19. Each party shall retain any financial account, checking account, savings\naccount, retirement account, 401 (k), or the like upon which he/she is primary holder. The\nother patty shall execute any document necessary to relinquish any right that he/she may\ngave in said account.\n20. Each party shall pay his/her own debt beginning the first month after the\nsigning oft his decree.\n21. This Final Decree ofD ivorce including the provisions regarding child\ncustody and visitation are Court orders enforceable against the Husband and Wife. Each\nis reminded that he/she is required to follow this order. As parents, each must assure that\nthe minor children follow this order, where applicable. Each must infonn his/her family\nnot to interfere or influence the terms of this order. If either patty willfully violated the\ntetms of this order, he/she will be subject to sanctions, penalties and attorney's fees.\n22. Neither party shall annoy, hai·ass, or alarm the other. Each shall\nDOCUMENT 156\ncommunicate with the other for the sole purpose of canying out the terms of this decree\nor necessary issues regarding the children. Neither shall make any negative or\nderogatmy comments to the other or in the presence of the children. Neither party shall\ndiscuss this case or any legal proceeding between the patties hereto with or in the\npresence of the minor children.\n23. Neither party is ordered to pay alimony.\n24. Each patty shall pay his/her own attorney fees.\n25. Each patty shall execute any document or provide any information\nnecessary to can-y out the terms of this decree.\n26. Alabama law requires each party in this action who has either custody of\nor the right of visitation with a child to notify other patties who have custody of or the\nright of visitation with the child of any change in his or her address or telephone\nnumber, or both, and of any change or proposed change of principal residence and\ntelephone number of numbers of a child. This is a continuing duty and remains in effect\nas to each child subject to the custody or visitation provisions of this decree until such\nchild reaches the age of majority or becomes emancipated and for so long as you at·e\nentitled to custody of or visitation with a child covered by this order. Ift here is to be a\nchange of principal residence by you or by a child subject to the custody or visitation\nprovisions 'of this order, you must provide the following information to each other\nperson who has custody or visitation rights under this decree as follows:\n(1) The intended new residence, including the specific street address, if\nknown.\n(2) The mailing address, if not the same as the street address.\n(3) The telephone number or numbers at such residence, if known.\n(4) If applicable, the name, address, and telephone number of the school\nto be attended by the child, if known.\n(5) The date of the intended change of principal residence of a child.\n(6) A statement of the specific reasons for the proposed change of\nprincipal residence of a child, if applicable.\n(7) A proposal for a revised schedule of custody of or visitation with a\nDOCUMENT 156\nchild, if any.\n(8) Unless you are a member of the Armed Forces of the United States\nof America and are being transferred or relocated pursuant to a non\nvoluntary order of the government, a warning to the non-relocating\nperson that an objection to the relocation must be made within 30\ndays of the receipt of the notice or the relocation will be permitted.\nYou must give notice by ce1tified mail of the proposed change of principal\nresidence on or before the 45th day before a proposed change of principal residence.\nIf you do not know and cannot reasonably become aware of such information in\nsufficient time to provide a 45-day notice, you must give such notice by ceitified mail\n11 ot later than the 10th day after the date that you obtain such information.\nYour failure to notify the other parties entitled to notice of your intent to\nchange the principal residence of a child may be taken into account in a modification\nof the custody of or visitation with the child.\nIf you, as the non-relocating patty, do not commence an action seeking a\ntemporary or pe1manent order to prevent the change of principal residence of a child\nwithin 30 days after receipt of notice of the intent to change the principal residence of\nthe child, the change of principal residence is authorized.\nDONE and ORDERED this the 27th day ofFebruary,2024.\n\\s\\ Steven R. Penyman\nSteven R. Perryman Circuit Comt Judge",
  "source_metadata": {
    "method": "pdfplumber",
    "pages": 9
  },
  "modified_time": 1759007597.0
}