{
  "doc_id": "3dcbaa98a9eefa799f1d0c7924a601cb1d1a5e1873f0942a5afc954a0ab53eee",
  "file_path": "C:\\Users\\blain\\Dropbox\\Master_Court_Files\\20_Jan_Contempt_Info\\Cross-Examination Questions for Kelly Turner, LPC (Reunification.pdf",
  "file_name": "Cross-Examination Questions for Kelly Turner, LPC (Reunification.pdf",
  "doc_type": "pdf",
  "date": null,
  "parties": [],
  "raw_text": "Blaine McGregor <blaine35010@gmail.com>\n(no subject)\n1 message\nBlaine McGregor <blaine35010@gmail.com> Wed, Nov 19, 2025 at 4:12 PM\nTo: Blaine McGregor <blaine35010@gmail.com>\nCross-Examination Questions for Kelly Turner, LPC (Reunification\nTherapist)\n1. Timeline of Involvement\nEarly Engagement Before Court Order: Ms. Turner, you first introduced yourself to the parties on August 20, 2024 – before any court order named you –\ncorrect? In a group text you stated, “I am the therapist that will be doing the reunification therapy per the court recommendations. We had our first session\nyesterday scheduled…” . There was no court order in place on August 20 appointing you, was there? Who informed you that you were “pre-approved” to\nstart reunification therapy at that time ?\nSelection and Prior Contact: Isn’t it true that your engagement began at the mother’s initiative, not by mutual agreement or neutral selection? The father was\nsurprised by your early involvement and even responded that no final decision had been made by the court . He also asked pointedly whether you had “any\nsessions with Brittany prior” to starting reunification therapy . For the record, did you have any prior therapeutic or consultative contact with Ms. Gilliland (the\nmother) before taking this case? Yes or no – can you confirm that you had no prior history or relationship with her?\nNumber of Sessions Conducted: You ultimately conducted very few therapy sessions in this case, correct? In fact, you saw the child and mother together\nonly two times (on or around Nov 26, 2024 and Dec 12, 2024) before you halted the therapy . Despite this limited contact, you formed strong negative\nconclusions about the father’s influence after just those two sessions . Do you believe two sessions were an adequate basis to judge the entire reunification\nprocess?\nWithdrawal in January 2025: On January 14, 2025, you abruptly withdrew from the case via email, citing “Blaine’s most recent email (which Brittany was not\nincluded)” as the reason . To be clear, you told the parties you were removing yourself because the father supposedly emailed you without copying the\nmother – that was the sole explanation given at the time, correct? Can you identify that “email” you relied on? The father contends he never sent you any\nemail excluding Ms. Gilliland . If no such email exists, what was the real reason for your sudden withdrawal?\nAffidavit on Eve of Hearing: One month later – on February 12, 2025 (the night before a court hearing) – you signed a sworn Affidavit prepared by the\nmother’s attorney and it was filed at 5:46 PM that evening . In that affidavit, you blamed the father for the failure of therapy, saying the process “felt highly\nmanipulative” and was not going to be effective . You essentially attributed your withdrawal to the father’s alleged behavior, correct? Why did you wait until\nthe 11th hour before the February 13 hearing to provide this damning affidavit, instead of raising these issues earlier? Were you attempting to influence the\njudge without being cross-examined?\nInconsistency in Resuming Therapy: After filing your affidavit stating reunification therapy with you would not be effective, were you aware that at the\nFebruary 13, 2025 hearing the mother’s attorney represented that you were “back on board” to continue therapy? Father’s counsel noted it was “highly\nunusual” – you made harsh statements in your affidavit about discontinuing therapy, yet within 24 hours you were presented as willing to resume . Which is\nit, Ms. Turner – had you concluded therapy was futile, or were you in fact prepared to continue as the therapist for the mother and child? Can you explain\nthis apparent about-face to the court?\n2. Communication and Consent\nLack of Informed Consent and Policy Disclosure: You did not provide the parents with any written counseling agreement, informed consent form, or office\npolicy document at the start of your involvement, did you? The father testifies that you “never provided or communicated her policies” to them . Isn’t obtaining\ninformed consent – especially in a court-ordered minor therapy – a basic ethical and legal requirement in Alabama? If you had no signed intake or consent\nform from the father for treating his child, how do you justify proceeding with therapy (and later disclosing information) without that fundamental step ?\nAppointment Scheduling and Confirmation Process: Isn’t it true that you failed to establish a clear, two-parent communication channel for scheduling\nappointments? The record shows the father often only learned of appointments from the mother and begged you to confirm them directly . In fact, you admit\nin your own report that your office policy was to require confirmation within 24 hours, yet the father’s understanding was that he deferred scheduling to Ms.\nGilliland and would have the child attend any appointments she set . Did you ever explicitly ask Mr. McGregor to personally confirm each appointment? If\nnot, why did you later portray his non-response as “refusal to respond,” instead of a miscommunication that you as the professional could have corrected?\nExcluding Father from Communications: You allowed and even participated in one-sided communications with the mother, didn’t you? For example, on\nDecember 3, 2024, Ms. Gilliland confirmed a session with you via a private email that excluded the father . You then treated that session as confirmed\nwithout Mr. McGregor’s knowledge. Isn’t that right? Why would a neutral therapist ever discuss or confirm appointments with one parent behind the other\nparent’s back in a reunification therapy context? Doesn’t that kind of exclusion undermine trust and consent from the other parent?\nFailure to Notify Both Parents of Cancellations: On December 23, 2024, you had to cancel a scheduled session due to your son’s surgery. You chose to\ninform only the mother and “assumed she would have told” the father . As a result, the father and the child drove an hour to your office only to find no\nsession . You’ve acknowledged this was “totally…my fault” and apologized for the oversight . Can you explain why you did not use the group email or a\ndirect call to reach Mr. McGregor about the cancellation? Do you typically rely on one party to relay critical information to the other in therapy cases, or was\nthis a serious departure from standard practice?\nConsent for Release of Information: Prior to signing the February 12, 2025 affidavit, did you obtain written authorization from either parent to disclose\ninformation from the therapy sessions to the court? The Alabama counseling code (ABEC) and ACA Ethics require client consent or a court mandate before\nrevealing therapy communications . You did not have Mr. McGregor’s consent to share details or your opinions from the therapy, did you? In hindsight, do\nyou agree that divulging therapy interactions in a public affidavit – without a release – compromised your ethical duty of confidentiality?\nIdentification of the “Client” and Billing Practices: Ms. Turner, who did you consider to be your “client” in this reunification therapy – the child (A.K.), the\nmother, or the family unit? It appears you never clearly communicated this. In fact, the father discovered that you did not even list A.K. as a patient in your\nrecords. You reportedly told him that A.K. “was not a patient” of yours . Is that accurate? If the court order was to provide reunification therapy for the child,\nwhy would the child not be recorded as your patient? Did you bill these sessions under Ms. Gilliland’s name and insurance as if it were her therapy instead ?\nPlease explain to the court why you would bill and document this case as “family therapy” for the mother rather than counseling for A.K. – isn’t that\neffectively misrepresenting the nature of the treatment? And weren’t you aware that prioritizing insurance billing convenience over identifying the true client\n(the minor child) is unethical ?\n3. Conflicts of Interest and Dual Relationships\nNeutrality vs. Alignment: As a reunification therapist, you are expected to remain neutral between the parents, correct? Yet throughout your involvement, you\nappeared to align with the mother’s preferences. You were initially selected by the mother’s side and even stated they told you that you were “essentially pre-\napproved” for the role . Did you ever consider recusing yourself or ensuring the father also agreed to your appointment to avoid a perception of bias? How\ndo you defend your impartiality when from the outset the father was concerned you were “already connected to Mother” ?\nRelying Solely on Mother’s Narrative: You have admitted that all the background information and history you gathered about this case came “strictly from the\nMother.” You did not independently verify any of it . You never reached out to the child’s CAC therapist, never spoke with the Department of Human\nResources (DHR) about the prior abuse investigation, and never contacted the child’s physician or school counselors, correct ? So you formed your clinical\nimpressions by listening to only one side of this high-conflict custody dispute. Do you recognize that as a serious risk for confirmation bias? How could you\nensure “the best interest of the child” while ignoring input from neutral professionals and the father’s perspective altogether?\nScheduling and Accommodations Favoring One Side: Isn’t it true that you often went along with the mother’s scheduling demands even when they conflicted\nwith the children’s needs? For example, the mother (Ms. Gilliland) scheduled a therapy session on 11/12/24 at the exact same time as A.K.’s long-planned\npediatric appointment for ADHD – a critical medical evaluation . The father alerted you that “Brittany purposely scheduled the RT appointment at the same\ntime” and pleaded with you to reschedule so A.K. wouldn’t have to miss her doctor’s appointment . Instead of immediately protecting the child’s welfare, you\nhesitated and said you “couldn’t do this over text,” initially refusing to adjust the session time . Ultimately, no timely accommodation was made – the father\nfelt forced to comply with your session, and A.K. missed her medical appointment . Do you consider it impartial or ethical to insist on the mother’s chosen\ntherapy schedule at the expense of the child’s healthcare needs? How does that reflect on your priorities as the therapist in charge?\nPerspective on Each Parent: Your own written Case Summary (filed later with the court) is very telling. You wrote, “Overall, Brittany was easy to work with,\nalways communicative and compliant,” whereas “Blaine…presented with…resistance… passive aggressive… tones…leading to the removal from the\ntherapeutic relationship.” . So in your narrative, the mother did nothing wrong and the father was solely to blame for therapy breaking down. Isn’t that a\nrather one-sided assessment? Did you ever question any of the mother’s actions (for instance, her role in scheduling conflicts or her own behavior with the\nchild)? Or did you reflexively view the mother as the “compliant” party and the father as the problem? Please explain how such a stance is consistent with\navoiding favoritism or dual allegiance in a family therapy context.\nDual Role – Therapist Turned Witness: You would agree that acting simultaneously as a treating therapist and as an expert witness or evaluator in the same\ncase is a conflict of roles, correct? The 2014 ACA Code of Ethics explicitly forbids counselors from evaluating current clients for legal proceedings (ACA\nStandard E.13.c, adopted by Alabama’s Board) . Yet that is exactly what you did, isn’t it? While still involved (at least on paper) as the reunification therapist,\nyou provided a sworn affidavit – essentially a forensic evaluation of the family dynamics and the father’s influence – for use in court. By becoming an\nadvocate for the mother’s position in your affidavit, you stepped out of a therapeutic role and into a partisan, evaluative role . Did you realize this was an\nethical breach when you agreed to draft the affidavit? How do you justify to this Court that you could remain a neutral therapist after effectively taking the\nmother’s side in litigation?\nFinancial/Insurance Conflict of Interest: You were aware that the court’s order anticipated using the father’s insurance to cover A.K.’s therapy costs\n(underscoring that A.K. was the identified client), correct ? Yet you apparently chose to bill the sessions under Ms. Gilliland’s name as if it were her therapy.\nBy treating the mother as the client for billing purposes, you stood to make the process easier for the mother (to use her insurance or avoid needing the\nfather’s insurance cooperation) . Isn’t that a conflict of interest? Didn’t that decision effectively put you in a dual relationship – where you were, on paper, the\nmother’s therapist – instead of solely the reunification counselor for the child? Explain why you would risk that ethical grey area. Were you trying to\naccommodate the mother’s insurance situation at the expense of transparency about who your patient was?\n4. Accuracy and Timing of Court Reports\nLast-Minute Filing of Affidavit: Your February 12, 2025 affidavit was filed mere hours before the February 13 court hearing . You knew, did you not, that this\nwould give the father practically no time to respond to or scrutinize your claims? In fact, the very next morning the father’s attorney moved to strike your\naffidavit as untimely and “full of hearsay” given your minimal involvement . Do you routinely provide critical reports at the eleventh hour in court cases? What\nwas your purpose in timing the affidavit when you did? Do you acknowledge that dropping a surprise affidavit against one parent on the eve of a hearing\ncould be seen as an ambush that undermines fairness?\nBasis for Conclusions – Two Sessions: In your affidavit, you reached sweeping conclusions about the father – suggesting he was manipulating the child and\nthat reunification was futile – after only two joint sessions and without ever even meeting the father in a family session . You wrote that “personality traits of\ndominance, attempt to dominate and need to control the narrative, with manipulative tactics” led to your decision to withdraw . On what factual basis did you\nmake such psychological assessments of Mr. McGregor? You had never conducted any formal evaluation of him, spoken with him one-on-one, or observed\nhim with A.K. beyond a greeting in the lobby – isn’t that true ? Would you agree that those characterizations in your report were more reflective of what the\nmother told you (or your subjective impressions), rather than any reliable therapeutic assessment after two brief sessions?\nReason for Termination – Shifting Explanations: There seems to be a contradiction in why you claim you terminated the therapy. In your January 14, 2025\nwithdrawal email, you pointed to a specific email from the father (alleging he excluded the mother on a communication) as the reason you “cannot continue\nto assist” . But a month later, in your affidavit, you gave a different reason – that the whole process “felt highly manipulative” and unlikely to succeed due to\nthe father’s conduct . And in your court-filed summary you added that the father’s “aggressive…passive aggressive” tone made you uncomfortable\ncontinuing . Why did you not mention any “manipulative tactics” or professional ethics concerns in your original withdrawal email? Isn’t it the case that your\nrationale evolved over time – becoming far more negative toward Mr. McGregor only after you began working with the mother’s attorney? How can the Court\ntrust that the story in your affidavit wasn’t influenced by advocacy needs, given that it diverged from what you said initially?\nAllegation of Ex-Parte Email: Let’s pin down the January 14 email issue: You asserted that the father emailed you without including the mother, and that this\nwas so improper that you quit the case . Mr. McGregor flatly denies ever sending you an email that excluded Ms. Gilliland . To this day, you have refused to\nidentify which email you meant. So, can you now clarify: what exactly did Mr. McGregor communicate that made you decide to withdraw? If you cannot point\nto a specific inappropriate email, should we conclude that the real reasons for your withdrawal were something else?\nOmissions and Misleading Statements: In providing information to the Court (via your affidavit or reports), did you disclose the whole truth of the situation?\nFor example, you opined that A.K.’s resistance to her mother was due to the father “coaching” or influencing her . Yet you omitted any mention of A.K.’s prior\nabuse allegations against her mother or the ongoing trauma therapy A.K. was undergoing at the Child Advocacy Center. You knew about those allegations\nand that DHR had been involved, correct? (The father even referenced A.K.’s CAC appointments in emails to you .) By leaving that context out, your report\npainted the father as the sole cause of the child’s reluctance and ignored a major alternative explanation (that the child’s fear of the mother was rooted in her\nown reported experiences). Do you agree that failing to mention such a critical fact misled the court about the root cause of the reunification difficulties ?\nWhy did you not at least note that A.K. had made abuse claims and was in counseling for it?\nFailure to Mention Outcome of Investigations: You also didn’t inform the court that those abuse allegations had been investigated by authorities (and that, for\na time, the mother’s visits were suspended). In fact, DHR and law enforcement declined to charge the father and eventually allowed reunification to proceed,\nindicating the father wasn’t the one found at fault in that context. By February 2025, you were aware no official agency had substantiated that the father was\nmanipulating A.K. – the only “findings” of alienation came from the mother’s side. Why, then, present your personal “finding” of parental alienation as if it\nwere fact, without acknowledging the lack of any independent support? Did you feel comfortable making what Father’s motion called “blanket statements”\nthat “border on violation of the standard of care” for a counselor ?\nAccuracy of Summary Report (October 2025): In your final “Summation of Services” filed with the court (Document 365, filed 10/16/2025), you chronicled the\nevents from November–December 2024 and effectively reiterated the claims from your affidavit . Notably, in that report you acknowledged a major error on\nyour part: “looking back…it was the responsibility of the clinician to communicate to both parties; however…this did not happen” regarding the canceled\nsession . You also conceded that failing, yet you still cast the father’s understandable anger at that mistake as “aggressive and offensive” . Isn’t it true that\nyour court reports consistently minimized the mother’s missteps and magnified the father’s, even when you yourself had made a serious lapse in protocol?\nHow can the Court rely on the accuracy of your reporting when it appears slanted to favor one side?\nMother’s Non-Compliance Overlooked: You wrote that “Blaine never responded…so I removed myself” and that he was non-compliant with confirmations .\nYet you failed to mention that neither you nor Ms. Gilliland showed up for the December 23, 2024 session (the father and A.K. did show up, only to find it\ncanceled) – effectively you and the mother “missed” that session, not the father . You also didn’t highlight that Mr. McGregor never actually missed any\nsession with the child; in fact, he even left a family holiday gathering early and skipped a pediatric appointment to make the reunification sessions you and\nMs. Gilliland scheduled . These facts would show the father was trying to comply, wouldn’t they? But your affidavit and summary left the impression that he\nwas simply uncooperative. Why did you omit or gloss over evidence of the father’s compliance and the mother’s contributions to scheduling failures? Can\nyou point to anywhere in your reports where you were critical of or even mildly concerned about Ms. Gilliland’s actions in this process?\n5. Ethical Obligations Regarding Minors in Reunification Therapy\nPrioritizing the Child’s Welfare: Under Alabama law and the ACA Code of Ethics, your primary responsibility is to promote the welfare of the client – here, the\nminor child – and to “do no harm” (Principle of Nonmaleficence) . Do you believe your actions in this case upheld that duty to A.K.? For instance, do you\nthink it was in A.K.’s best interest to force her to miss her ADHD medical appointment in order to attend a therapy session you could have easily rescheduled\n? How about the harm to A.K.’s trust when she arrived for a session on Dec. 23 only to find it canceled without explanation – might that have caused her\nanxiety or confusion? In hindsight, didn’t these missteps risk harming the very child you were supposed to help?\nRespecting Minor Client’s Trauma and Voice: Reunification therapy often requires sensitivity to a child’s trauma and fears. Yet from the first full session (Dec.\n12, 2024), you confronted A.K. in a way that she perceived as not believing or respecting her feelings. According to your own notes, A.K. expressed that\nthese therapy appointments “should not take precedence” over her life and felt upset that her schedule wasn’t respected – and you believed her remarks\nwere “regurgitated” coaching from her father . When A.K. explained that her dad “always has her best intentions in mind,” you took that as a “red flag” and\nevidence of “parental alienation” by the father . Did you ever consider that A.K.’s resistance could stem from her own lived experience (such as the alleged\nabuse by her mother and the abrupt changes imposed on her life) rather than simply brainwashing by her father? Reports show that after that session, A.K.\nsuffered a panic attack, apparently because she felt the therapist (you) did not believe that her mother had hurt her . Are you aware of that? If so, what does\nthat indicate to you about whether your approach was appropriate for a traumatized child?\nInvolving Both Parents and Informed Consent (Ethical Standards A.2, A.7): The ACA Code (2014) emphasizes that in family counseling involving a minor,\nboth parents (if legal guardians) should be appropriately informed, consent to the process, and be kept involved in major decisions . Mr. McGregor was a\njoint legal custodian of A.K., yet he testifies you frequently made decisions or schedule changes without consulting or even informing him – he’d find out after\nthe fact or from others . For example, you unilaterally paused the therapy (by withdrawing) and coordinated with the mother and her attorney on an affidavit,\nall without any input from or notice to the father. Do you acknowledge that by marginalizing one parent in the therapeutic process, you violated these ethical\nobligations ? Why did you not take care to include the father in decision-making, given that reunification therapy inherently involves rebuilding trust with both\nthe child and the estranged parent?\nConfidentiality and Trust with a Minor Client: Did you explain to A.K., a 12-year-old child, how information from her therapy might be used or disclosed?\nTypically, counselors must clarify limits of confidentiality to minor clients and their parents. In this case, you took what happened in therapy and turned it into\na court affidavit without A.K.’s or her father’s permission. Do you see how that could feel to A.K. like a betrayal of her confidence? How can a child trust a\ntherapist who might later testify or report against one of her parents? Please address whether you considered the impact on A.K. when you chose to inject\nyourself into the legal battle.\nProfessional Competence in Reunification Therapy: What specific training or credentials do you have in reunification therapy with minors in high-conflict\ncustody cases? The mother’s proposed court order touted you as “a specialist in reunification therapy.” Did you hold yourself out as a specialist ? If so, are\nyou familiar with standard protocols for reunification therapy (for example, guidelines from professional bodies or scholarly literature)? Describe how you\nfollowed recognized best practices. If not, why did you accept this complex assignment? The reason I ask: an independent professional writing to the father’s\ncounsel in August 2024 observed that you “appeared to enable [the mother’s] resistance” and that your approach was “not in the children’s therapeutic best\ninterests.” This was noted early on by a third party. Did anyone ever question your methods or approach during the process, and did you take any steps to\nadjust for the sake of the children?\nOutcome Responsibility: You understand that the goal of court-ordered reunification therapy is to help heal the parent–child relationship and facilitate the\nchild’s healthy contact with both parents. By withdrawing abruptly and then siding with one parent’s narrative, do you feel you upheld that goal? The outcome\nof your involvement was that reunification failed under your watch – the child did not resume normal visitation with her mother, and the process became even\nmore litigious. If you had maintained neutrality, adhered to ethical guidelines, and truly prioritized the child’s needs over the parental conflict, do you believe\nthe outcome might have been better? Or in simpler terms, Ms. Turner: do you recognize that your conduct – however well-intended – may have caused\nmore harm than good to a vulnerable child caught between her parents? (Consider your answer in light of the ethical mandate to “avoid harm” and “act in the\nbest interest of the client.”) .",
  "source_metadata": {
    "method": "pdfplumber",
    "pages": 6
  },
  "modified_time": 1767929815.0
}