{
  "doc_id": "3ed9e1309282511efc5c6d3fee90414492b80b03469d608faec6471b1248a4d2",
  "file_path": "C:\\Users\\blain\\Dropbox\\Master_Court_Files\\20_Jan_Contempt_Info\\Information to help answer motion.pdf",
  "file_name": "Information to help answer motion.pdf",
  "doc_type": "pdf",
  "date": null,
  "parties": [],
  "raw_text": "5. Given the above circumstances, Mother should have been able to fully exercise her\nvisitation awarded to her in the Parties’ Final Order of Divorce. However, as seen by Father’s\nprior history in blocking any and all visitation with the Minor Child A.K., it should come as\nno surprise to this Court that Mother was unable to exercise her holiday visitation;\n• The fact they stated “However, as seen by Father’s prior history in blocking any and\nall visitation with the Minor Child A.K., it should come as no surprise to this Court\nthat Mother was unable to exercise her holiday visitation;” is a problem and a lie.\n• Mother asserts that Father has a “history in blocking any and all visitation” with A.K.\nand suggests this is why she was unable to exercise Christmas 2025 visitation. This\nassertion is both unsupported by the record and mischaracterizes the procedural\nhistory of this case.\no They have provided no proof that I have blocked any visation.\no The court agreed after an in camera interview with AK – Read Transcript. Use\nQuote from Judge.\no Father did not deny visitation in willful disregard of the Court’s order. Rather,\nas detailed in prior filings and incorporated herein, he informed Mother of a\nlong-planned church retreat for A.K. during the holiday window, which was\ncommunicated on December 15, 2025, with the deposit having been paid\nmonths earlier. – See attached Text messages\no The allegation that Father has a “history of blocking any and all visitation” is\ncontrary to the record. In fact, the Court has previously declined to find\nFather in contempt. At the July 2024 hearing, Judge Perryman stated explicitly\nthat Father’s conduct did not amount to contempt, recognizing the child’s\nunwillingness and the complexity of the situation.\no It is inaccurate to claim that Father “blocked” holiday visitation when, as\ndetailed in the prior response, A.K. herself declined to leave with her mother\non December 25, 2025. Father informed Mother in advance of A.K.’s church\nretreat, attempted to facilitate the exchange, and encouraged A.K. to go. At\nno point did he interfere with the order.\no This pattern does not reflect obstruction. It reflects ongoing adherence to the\nCourt’s directives under difficult circumstances involving a minor child with\nunresolved emotional resistance to visitation—resistance that the Court has\nacknowledged and structured its orders around.\no The Court has never found Father in contempt regarding visitation.\nAssertions that he has ignored court warnings or acted willfully to prevent\nMother’s parenting time are not supported by rulings or the procedural\nhistory. The record instead shows a consistent and cautious judicial\napproach focused on gradual reunification and therapeutic readiness—not\nforced visitation against a resistant child’s will.\no\n6. On December 4, 2025, the undersigned’s office reached out to opposing counsel to\nconfirm the holiday visitation dates per the agreement. Opposing counsel stated, “Blaine’s\nChristmas is from 12-18-2025 to Christmas Day (12-25) at 6:00, then Brittany has 12-25 at\n6:00 until 1-1-2026 at 6:00 for her Christmas, then her weekend would be Jan 2, 3, 4,” which\nthe undersigned then confirmed and relayed to Mother. The undersigned corrected that the\npick-up time for Mother on December 25, 2025 is in fact 12:00pm, not 6:00pm which\nopposing counsel previously stated, which was confirmed by the opposing counsel in order\nto avoid any potential miscommunication between Mother and Father when the time to\nexchange the Minor Children came;\n• Further undermining Mother’s argument, she failed to exercise her regular\ncustodial weekend immediately following the holiday. On January 1, 2026, she\nreturned Bennett to Father at approximately 6:00 p.m. but did not return to pick him\nup for her scheduled visitation from January 2 through January 4. This occurred\ndespite her claim that she coordinated exchange plans through counsel to avoid any\nconfusion. No contact or attempt was made by Mother to retrieve Bennett for that\nvisitation period. This omission reflects a lack of follow-through on Mother’s part\nand contradicts the narrative that miscommunications or Father’s actions have\nobstructed her access to the children.\n7. On December 21, 2025, the Parties met for their weekly family dinner. During this dinner,\nFather explained that the Minor Child, A.K., had planned for an extracurricular trip through\nher church from December 27, 2025 until January 6, 2026. This would “coincidentally”\nconflict with Mother’s holiday visitation which was to begin on December 25, 2025 and end\non January 1, 2026. Since this was during Mother’s visitation, she had arranged for A.K. to\nattend a family gathering before promptly returning A.K. to Father’s home for her trip;\n• Response to Allegation No. 7 – Alleged Withholding of Information and\nMischaracterization of Trip\n• Mother claims that Father interfered with visitation and failed to provide information\nrelated to A.K.’s holiday plans, referring specifically to an “extracurricular trip.” This\nallegation is inaccurate and omits essential facts.\n• The trip at issue was not a generic extracurricular activity—it was a church youth\nretreat organized by First Baptist Church in Alexander City, Alabama, scheduled for\nDecember 27 through December 30, 2025, in Gatlinburg, Tennessee. Father\ninformed Mother of the trip well in advance and sought her input and permission.\nOn December 15, 2025, Father texted Mother stating:\n• “AK wants to do this… it’s $200. It’s 12/27 – 12/30. Do you have a problem with her\ngoing out of state to TN for it?”\n• He also attached the official link to the church’s Winterblast 2025 page, providing\nfull details of the event and payment information. At no point did Mother respond\nwith any objection or concern. Then, on December 26, 2025, Father sent another\nmessage to remind Brittany of the trip and offer her a chance to speak with A.K.\nbefore departure:\n• “AK leaves for TN in the morning for winterblast. I have to have her at the church at\n7am – they return Tuesday. Call her tonight before she leaves.”\n• These texts, backed by screenshots, show clear communication, transparency, and\nan opportunity for Mother to participate. The claim that the trip was concealed is\ncontradicted by this documented effort to inform and involve her.\n• Point out it’s a lie that I told Brittany about this trip duing the 12/21 Dinner as proof\nprovided by the text. Point out that the trip was not from 12/27 until 1/6 but just as I\noutlined in the text it was from 12/27 – 12/30.\n8. Following this dinner, Mother received a phone call from Father where he had only\nmentioned the Minor Child, B.M., for holiday visitation;\n• Mother asserts that Father’s use of only one child’s name during a phone call\nwas intended to exclude or imply that A.K. would not be made available for\nvisitation. This assumption is incorrect and unsupported.\n• If Father referenced only one child (such as Bennett) during a call, it was not\nintended to imply that A.K. would be withheld. The name mentioned likely\nreflected the specific logistical detail being discussed at that moment—not an\nexclusion of the other child. At no time did Father state or suggest that A.K.\nwould not be made available. In fact, A.K. was present and available for the\nDecember 25, 2025 exchange, and Brittany personally interacted with both\nchildren during that time.\n• The last contact between the parties prior to the holiday exchange occurred\nbefore Father left the December 21, 2025 family dinner in Prattville, Alabama.\nThat gathering—attended by Brittany, her husband, their children, and Brittany’s\nextended family—did not conclude until approximately 10:30 p.m. Father then\nmade the 1.5-hour drive back to Alexander City and did not have further\ncommunication with Brittany before the scheduled exchange. The fact that\nBrittany saw both children on December 25, spoke with A.K., and invited her to\njoin a family event confirms that A.K. was not being hidden or withheld.\n• Father complied with the Court’s holiday order, and any mention of only one\nchild during a phone call cannot be reasonably interpreted as an attempt to\ninterfere with or mislead regarding visitation.\n10. When the exchange of the Minor Children occurred on December 25, 2025,\nFather asked if the pick-up time could be pushed back one hour so that Minor Child\nB.M. could play with his Christmas present. Mother informed Father that she was\nalready on the road to pick up the Minor Children, to which Father then informed\nB.M. that Mother refused to allow him to play with his toy, causing B.M. to be upset\nwith Mother upon Mother’s arrival. This was another manipulation tactic by Father\nto foster negative emotions towards Mother and to change the Minor Child’s\nperception of Mother;\n• Mother alleges that Father made disparaging remarks to the parties’ minor\nson, B.M., on Christmas Day, specifically claiming that Father told B.M. that\n“his Mother refused to allow him to play with his toys,” causing B.M. to be\nupset with her upon her arrival. This allegation is entirely false and\nmisrepresents the events of that day.\n• On December 25, 2025, Father called Mother at 11:00 a.m., one hour before\nthe scheduled 12:00 p.m. pickup time, to ask when she would arrive. Brittany\nconfirmed that she was already on her way. Father did not inform Bennett\nthat his mother was coming to pick him up until she had already arrived,\nspecifically to avoid upsetting him in advance. When Father told Bennett\nthat his mother was outside, Bennett became visibly upset about the\ntransition.\n• To help ease the exchange and make the moment more positive, Father\nasked Brittany’s husband, Bradley, to take a picture of him with the children\non the front steps. He also invited Brittany to take a picture with them, and\nshe agreed. Because Bennett was still emotional, Father suggested that\neveryone do “pouting faces” in the photos to help lighten the mood and\nmake it feel more playful. A copy of that photo is attached as evidence.\n• In further effort to support the transition, Father asked Bennett if he wanted\nto show his mom what Santa had brought. When Bennett said yes, Father\ninvited Brittany and her husband into the home, and Bennett proudly\nshowed them his new gaming PC in the playroom. During this brief visit,\nFather also introduced Bradley to his father. Afterward, everyone went back\noutside, and Father placed Bennett in Brittany’s vehicle.\n• The suggestion that Father told Bennett something negative about his mother\nis unsupported and contradicted by these actions. Father clearly made every\neffort to create a warm, peaceful, and emotionally supportive exchange—not\none based in tension or manipulation.\n• Father has consistently gone above and beyond to support the children's\nrelationship with their mother, including:\n• Moving Christmas (Santa) to December 23 to prevent B.M. from\nexperiencing the emotional conflict of receiving gifts and then having to leave\na few hours later on Christmas Day;\n• Facilitating calls between the children and Brittany the night before and\nthe morning of Santa’s visit at his home;\n• Bringing both children to attend Brittany’s church’s candlelight service in\nClanton on December 21st then making another 1 hr drive and to have\nChristmas dinner with Brittany’s extended family in Prattville on\nDecember 21 and then driving 1.20 min home that night.\n• Participating in a family dinner and Walmart outing just days before this\nfiling, during which Brittany took pictures of Father with her infant daughter.\n• These events show a consistent pattern of cooperation and care—not\nalienation or manipulation. Father categorically denies making any\nstatement to B.M. that would cast Mother in a negative light, and he strongly\nobjects to the repeated use of language suggesting that he employs\n“manipulation tactics.” The documented facts show otherwise: that Father\nsupports co-parenting and has acted in the best interests of both children.\n11. Furthermore, Father’s sister, Katie McGregor, was at Father’s residence helping the\nMinor Child ,A.K., pack for her trip at the time of the visitation exchange. When Mother\nasked if A.K. was coming with B.M. into the car for pick up, Father reportedly stated “if you\nwant to go you can go” to A.K., to which she declined and went back inside Father’s\nresidence;\n• Mother alleges that Addie Kate was “packing for her church youth trip” during the\nscheduled Christmas Day pickup, implying she was unavailable. This is false. At the\ntime of the exchange on December 25, 2025, at 12:00 p.m., A.K. was not packing.\nBoth children came outside for the exchange. Photos were taken of the family on the\nfront steps. Afterward, everyone returned inside briefly so Bennett could show\nBrittany and Bradley his Christmas gifts. Father then placed Bennett in Brittany’s\nvehicle.\n• While outside, Brittany asked A.K. if she would like to go with her to a family\ngathering at Bradley’s family’s home. She told A.K. she would bring her back later\nthat evening. Father encouraged A.K. to go, but did not pressure her. As the\ndiscussion continued between A.K. and her mother, Father stated:\n• “This is between you and your mother,”\nand then went inside the home. About ten minutes later, A.K. came inside. Father\ndid not interfere in their discussion and did not obstruct the visitation.\n• Mother’s additional claim that “Katie” was present in the home during this exchange\nis also false. Katie is not Father’s sister, but his sister-in-law, and she was not\npresent at the home during the pickup. Dated and timestamped video\nsurveillance footage from Katie’s residence confirms that she remained at her own\nhome until approximately 3:00 p.m. on Christmas Day—three hours after the\nexchange occurred. The only other person present at Father’s home during the\npickup was his father.\n• This is another unsupported accusation and a clear attempt to misrepresent the\nfacts before the Court.\n12. This Court has been explicitly clear regarding visitation especially as it relates to putting\nthe responsibility of exercising visitation in the Minor Child A.K.’s hands. Father has\npreviously made and continues to make zero attempt to encourage visitation between the\nMinor Child A.K. and Mother and consistently engages in parental alienation;\n• Father did not unilaterally “leave the decision up to the child.” If Mother had wished\nto enforce the visitation or believed Father was obstructing it, she could have\ninvolved law enforcement, as she has on prior occasions. She did not do so. The\nCourt has never found Father in contempt for these exchanges, and in fact, both\ncounsel and the Court agreed after the in camera interview with A.K. that the\npreviously scheduled show cause hearing would not proceed. That decision\nfollowed the Court’s acknowledgment that A.K.’s statements carried weight in\ndetermining visitation progress.\n• Accusations that Father has made “zero attempts” to support visitation or that he\nengages in “parental alienation” are direct attacks on his character and are not\nsupported by the record. Father has encouraged visitation, attended therapy,\nfacilitated communication, and followed the court’s orders. The in camera interview\nand court’s subsequent actions contradict Mother’s narrative.\n13. On July 24, 2025, this Court issued an Order stating, in part, “Both parties are to parent\nand not permit the/a child to control the operations of this Court’s orders.” See July 24,\n2025 Order [Doc. 222]\n• Mother previously attempted to enforce visitation under an outdated version of the\ncustody order, despite the fact that a newer Temporary Order was in effect. Her\nfiling to enforce a superseded schedule prompted Father to file a Motion to Clarify,\nwhich was granted by the Court on August 7, 2025. That order confirmed the most\nrecent order controlled and clarified that the schedule Mother was attempting to\nenforce was no longer valid. Both the April 14, 2025 Temporary Order and the\nAugust 7, 2025 Clarification Order are attached.\n• These events show that any confusion in the record stemmed from Mother’s\nattempt to act under a repealed order—not from Father’s conduct.\n14. This Court also stated during the July 31, 2024 Show Cause Hearing that “I don’t mind\ntalking to her again and letting her know if she don’t do what I tell her she’s got to do, then I\nmay have to change custody.” See Transcript page 6, lines 16-18 [Doc. 138] and, “A ten-\nyear-old can’t tell us what we’re going to do,” See Transcript page 6, line 25 [Doc. 138];\n• Mother cites early remarks made by Judge Perryman, such as:\n• “I don't mind talking to her again and letting her know if she don't do what I tell her\nshe's got to do, then I may have to change custody, and a ten-year-old can't tell us\nwhat we're going to do.”\n• These comments were made before the judge heard any evidence and before\nconducting the in camera interview with A.K. After speaking with A.K. directly,\nJudge Perryman shifted tone significantly. He ordered only weekly family dinners\nas visitation and denied reunification therapy, responding to Mother’s counsel’s\nquestion with:\n• “No, not now.”\n• He made clear that the Court would not force visitation without therapeutic support\nand emotional readiness. The in camera interview was central to this shift in the\nCourt’s approach, demonstrating the judge’s responsiveness to the facts and to\nA.K.’s lived experience.\n15. This Court’s position has been made clear since the initiation of this action that the\nMinor Child is not to dictate whether visitation is to be exercised. Father has continued to\nblatantly disregard this Court’s orders and refuses to bear any responsibility for ensuring\nthat visitation is properly exercised. Father continues to place this burden onto a minor and\ninstills distaste towards A.K.’s own mother, creating a rift and severing any familial bond\nthat Mother attempts to create, which is the definition of parental alienation. Indeed,\nFather has even successfully blocked the reunification therapy that was ordered by the\nCourt with no consequences;\n• Christopher Blaine McGregor (“Father”) has scrupulously followed the court’s\ncustody and visitation orders and, in many instances, exceeded their requirements\nto facilitate the children’s relationship with Brittany Gilliland (“Mother”). As Father\naffirms, “I have fully complied with all court-ordered visitation arrangements and\noften exceeded them to support the children’s relationship with their Mother.” Far\nfrom instilling distaste for Mother or alienating the children, Father has consistently\nencouraged contact and goodwill. For example, during holidays in 2024 – when the\nFinal Decree did not entitle Mother to Thanksgiving custody – Father voluntarily\narranged extra time for Mother to be with the children. He allowed Mother to have\ndinner with A.K. on Thanksgiving Eve and spend special time with the younger child,\neven though this was beyond what the court order required. On Mother’s Day 2025,\nFather helped both children prepare gifts for Mother and invited Mother to join A.K.\nfor dinner – an offer Mother declined. Father still brought A.K. out to Mother’s car\nthat day to ensure A.K. could hand over the gifts and personally wish Mother a\nhappy Mother’s Day. These actions demonstrate Father’s good-faith efforts to\nnurture, not undermine, the mother–child bond.\n• At no point has Father engaged in a campaign of disparagement or blocked the\nchildren’s communication with Mother. In fact, the record shows Father facilitated\nphone calls, gift exchanges, and counseling sessions aimed at reunifying Mother\nand A.K.. He has never spoken negatively about Mother to the children.\n• Father has obeyed both the letter and spirit of those provisions. The only\nimpediments to Mother’s relationship with A.K. have been those arising from A.K.’s\nown well-founded emotional reservations and Mother’s repeated failure to take\nadvantage of visitation opportunities – not any interference or poisoning of the well\nby Father.\n• Father Did Not “Let the Child Control” Visitation: Allegation 15 claims Father\nallows the minor child to dictate visitation. This is incorrect. Father has encouraged\nA.K. to attend scheduled visits and therapy, but he also must respond to the reality\nof A.K.’s trauma and fear.\n• What Father refuses to do is forcibly drag a terrified child into a car against her\nwill without addressing the underlying issues. As he explained, “I cannot in good\nconscience force our child into a situation that she finds scary or traumatic.” This\napproach is entirely consistent with the Court’s guidance. At the July 31, 2024\nhearing (before A.K.’s in-camera interview), Judge Perryman emphasized that the\ngoal was to avoid “screwing up” the child and to rebuild trust gradually: “we’re going\nto send everybody to counseling, and then we’ll be back here and see if we can’t get\nthings better.” The Judge made clear that reunification therapy should start slowly –\nfirst with A.K. and her individual counselor, then joint sessions with Mother “after\ny’all have some indication … that things are progressing”. In line with that intent,\nFather has prioritized A.K.’s emotional well-being while encouraging her to heal and\neventually resume normal visitation. He is not “controlled” by the child; he is\nfollowing professional and court guidance to ensure that contact is meaningful and\nnot harmful.\nMother Missed ~50% of Court-Ordered Reunification Dinners: The contempt allegation\nfaults Father for allegedly withholding visitation, but the factual record shows it has been\nMother who failed to show up to visitation opportunities. After the divorce, the Court\nordered weekly “reunification dinners” to help reintroduce Mother into A.K.’s life (originally\nWednesday evenings, later moved to Sundays). From January through August 2025, roughly\n30 weekly reunification dinners were scheduled – and Mother missed more than half of\nthem. Some she canceled in advance with flimsy excuses; others she simply no-showed,\nleaving A.K. waiting. Each absence is documented in text messages and logs (Exhibits A–C)\n– for example, on January 10, 2025, Mother asked to reschedule a dinner to Saturday\nmorning, which Father agreed to, but then Mother never appeared at the rescheduled\ntime. On February 12, 2025, Mother neither showed up nor gave notice, then later tried to\nblame Father by claiming she wasn’t informed of the plan (despite a standing court order\nand shared Google calendar). The pattern continued through the spring and summer:\nEaster Sunday (April 20, 2025) – Mother failed to participate; Mother’s Day (May 11, 2025) –\nMother again skipped the chance to see A.K., aside from picking up the younger child;\nmultiple Sundays in June–August 2025 – Mother would cancel last-minute or simply never\nrespond to Father’s messages about meeting times. By August, Mother was outright\nrefusing to come to the designated location (Alexander City) at all, insisting Father drive\nA.K. to meet her halfway – contrary to the court’s order that Mother exercise visitation in\nAlex City. In sum, Mother’s own choices “resulted in any disruption of visitation,” not\nFather’s actions. Father, for his part, kept every weekly dinner slot open, had the children\nready and waiting, and frequently reached out to confirm Mother’s plans – only to be met\nwith silence or cancellations. He even adjusted schedules repeatedly at Mother’s request\n(e.g. moving visits from Wednesdays to Sundays to accommodate Mother’s work and\nrelocation). The undisputed record is that Father was present for every scheduled\nexchange; it was Mother who more often failed to appear or cut visits short.\nMother Missed ~75% of A.K.’s Medical Appointments: The allegation that Father blocks\nMother from the child’s life is further disproven by Mother’s own absence at critical events\nlike doctor’s appointments. Father has kept Mother informed of all major medical visits for\nthe children. Yet Mother has attended only a small fraction of A.K.’s medical and therapy\nappointments since the divorce. The attendance log of health visits (Exhibit __) shows that\nMother was a no-show for roughly three out of every four appointments. By way of\nillustration, at A.K.’s pediatric sick visit on August 28, 2023, the clinic records note\n“Brittany – No Show”, with Father having to accompany A.K. alone. This was not an\nisolated incident – it is representative of a trend. Mother consistently failed to appear\ndespite having joint notice and rights, thereby forgoing opportunities to engage in A.K.’s\nhealth and daily life. It is ironic for Mother to accuse Father of blocking communication with\nthe school or medical providers, when the reality is Mother seldom shows up even when\nshe is expected. Father cannot be blamed for Mother’s own lack of involvement. To the\ncontrary, Father has never barred Mother from any school or medical information – he has\nprovided updates and even added Mother to shared calendars for events. If Mother missed\na vaccine appointment or a school function, it was due to her absence or inattention, not\nbecause Father hid it from her. In fact, the Final Decree’s joint legal custody terms require\nboth parents to confer on major decisions, and Father has abided by that – for instance,\nconsulting Mother about A.K.’s counseling and inviting her input on activities. It is Mother\nwho chose not to attend or sometimes not even to respond.\nMother Missed ~94% of A.K.’s Extracurricular Activities: Father also documents that\nMother has rarely supported A.K. at her extracurricular activities. A.K. is an active pre-teen\nwith sports and school events. Father ensured Mother was informed of all games, recitals,\nand activities, and the schedule was readily available. Yet Mother’s attendance has been\nabysmal. Out of A.K.’s entire 2024–2025 sports season, Mother attended only 1 of 12 of\nA.K.’s soccer games, 2 of 16 of her cheer/football games, and 0 of 30 basketball games. In\ntotal, Mother was present for just 3 out of 58 games – a 5% attendance rate, meaning she\nmissed approximately 94% of A.K.’s events. Again, this underscores that if anyone has been\nabsent from the child’s life, it is Mother. Father, by contrast, was at every game or practice,\nand even took on all the driving and expenses for these activities (often with no\ncontribution from Mother). Father also made sure Mother knew she was welcome at all\nevents; he never discouraged her from coming. Her near-total non-attendance speaks for\nitself. It is simply not credible for Mother to claim Father “alienated” the child, when Mother\nhas voluntarily alienated herself by failing to show basic support and presence. As Father\nnotes, he has “gone out of my way to facilitate Mother’s visitation, and it is Mother who has\noften been unable or unwilling to utilize the time allotted to her.” Any suggestion that Father\nprevented Mother from being involved is flatly false.\nIn summary, the evidence of the past two years shows Father has bent over backwards to\ninclude Mother – flexible scheduling, extra holiday time, constant communication – while\nMother has spurned half or more of the opportunities given to her. This directly refutes\nAllegation 15’s premise that Father is the one flouting court orders or poisoning the\nchildren’s minds. On the contrary, Father’s compliance and facilitation are well-\ndocumented, and it is Mother’s pattern of non-compliance that has hindered her\nrelationship with A.K.\nFather’s Efforts to Encourage and Continue Reunification Therapy\nAllegation 15 also accuses Father of “blocking reunification therapy.” The record proves the\nopposite. Father has been the driving force behind initiating, maintaining, and when\nnecessary, re-starting reunification therapy between Mother and A.K. Far from impeding\ntherapy, Father has diligently followed every court directive and even sought corrections\nwhen the process derailed due to no fault of his own.\nCourt’s Intent vs. Written Order: It is important to recall the court’s intended plan for\nreunification therapy. During the July 31, 2024 hearing (where the Court interviewed A.K. in\ncamera), Judge Perryman made the gradual approach clear on the record: A.K. would first\ncontinue individual counseling (with Mother participating in some of those sessions), and\nonly after progress was observed would a separate reunification therapist commence joint\nMother–daughter therapy. The Judge specifically said Mother should attend counseling\nsessions with A.K.’s regular counselor “at least eight/ten times” and “that needs to start\nimmediately”, and “then a separate reunification [counselor] after we get down the road\nwith this a little bit and see if we can’t get things better.”*. Father understood this phased\nplan and agreed with it – it aligned with ensuring A.K. was emotionally ready. However,\nwhen the written order came out on November 6, 2024, it omitted the phase-in sequence\nand instead directed that reunification therapy with a specific counselor (Kelly Turner)\nbegin right away. Despite concerns that this contradicted the court’s stated intent, Father\ncomplied fully with the November 6 order. He did not challenge or ignore it; rather, he\npromptly facilitated the ordered therapy: he allowed Mother’s attorney to choose the\nreunification therapist (Ms. Turner), let Mother set the initial appointments, and made\nA.K. available for every scheduled session.\nFull Compliance and Participation: Father never impeded the reunification counseling. To\nthe contrary, he went to great lengths to make it successful. He provided a shared Google\ncalendar to both Mother and Ms. Turner to coordinate sessions and communicated his\nopenness and availability for any appointment. Father made sure to attend with A.K. every\nsession that was scheduled and communicated to him. He even rearranged other family\nplans – for example, cutting short a family Christmas gathering on December 23, 2024 –\nbecause Mother and Ms. Turner set a therapy session that day. (Notably, Mother herself\nmissed that December 23 session after insisting on it; she and the therapist canceled last-\nminute after Father and A.K. had already altered their holiday plans to attend.) Father’s\ndedication is summed up in his affidavit: “I attended with A.K. whenever sessions were set,\nand I went so far as to leave holiday family time and rearrange schedules to make therapy a\npriority.” He never once refused a session, never showed up late (aside from instances\nwhere Mother failed to confirm times), and never caused a cancellation. In fact, Father\nconfirms, “I never missed or canceled a session that I was made aware of, and I\naccommodated every appointment that was communicated to me.” The same cannot be\nsaid for Mother – it was her inconsistent scheduling and attendance that undermined the\ncontinuity of therapy.\n• Therapist Kelly Turner’s Withdrawal: The reunification therapy with Ms. Turner\nultimately fell apart not because of any act of Father, but because Ms. Turner herself\nunilaterally withdrew from the case after only two joint sessions. Critically, Ms.\nTurner’s own communications and affidavit make clear why she quit – and it was not\ndue to Father “blocking” anything. On February 12, 2025, Ms. Turner submitted an\naffidavit (since she could not attend a hearing) in which she made certain\n“prejudicial statements regarding the Father” despite never having met or spoken\nwith him in person. She admitted her conclusions were based solely on limited\nemail interactions. Father’s counsel rightfully sought to cross-examine these\nconclusions by noticing Ms. Turner for a deposition on February 14, 2025. That\nsame night (Feb. 14), at 11:46 PM, Ms. Turner emailed both parties stating: “I am\nremoving myself from this case. I wish you both the best… I am not going to be able\nto continue to assist moving forward. If you need any suggestions for other\ntherapists I can provide options.” Ms. Turner specifically referenced an email from\nFather (in which Mother was allegedly not copied) as the reason for her abrupt\nwithdrawal. Father was baffled by this, as he had included Mother on all\ncommunications and immediately responded asking what email she was referring\nto. It later emerged that Mother had been emailing Ms. Turner separately behind the\nscenes – for example, Mother confirmed an appointment time with Ms. Turner via a\nprivate email that excluded Father. Thus, any confusion about who was attending\nor confirming sessions was caused by Mother’s unilateral communications, not by\nFather. Ms. Turner apparently “felt” manipulated by the situation (perhaps due to\nthese crossed communications) and chose to quit. But the key point is this: Father\ndid not fire or pressure the therapist to withdraw. Ms. Turner’s own affidavit\nstates, “this situation felt highly manipulative and… I realized that this process was\nnot going to be conducive nor effective, and a decision was made to withdraw.”\nThose were her words and decision. Father was blindsided by Ms. Turner’s exit; he\nhad been preparing to attend every session and was “ready and willing to continue\nthe reunification therapy” with her. There is no evidence whatsoever that Father\ncaused or encouraged Ms. Turner’s withdrawal. In fact, the evidence shows the\nopposite – Father was dismayed by her quitting and took immediate steps to get the\ntherapy back on track with a new\n• Allegation 15 also accuses Father of “blocking reunification therapy.” The record\nproves the opposite. Father has been the driving force behind initiating,\nmaintaining, and when necessary, re-starting reunification therapy between Mother\nand A.K. Far from impeding therapy, Father has diligently followed every court\ndirective and even sought corrections when the process derailed due to no fault of\nhis own.\n• Court’s Intent vs. Written Order: It is important to recall the court’s intended plan\nfor reunification therapy. During the July 31, 2024 hearing (where the Court\ninterviewed A.K. in camera), Judge Perryman made the gradual approach clear on\nthe record: A.K. would first continue individual counseling (with Mother participating\nin some of those sessions), and only after progress was observed would a separate\nreunification therapist commence joint Mother–daughter therapy. The Judge\nspecifically said Mother should attend counseling sessions with A.K.’s regular\ncounselor “at least eight/ten times” and “that needs to start immediately”, and\n“then a separate reunification [counselor] after we get down the road with this a\nlittle bit and see if we can’t get things better.”*. Father understood this phased plan\nand agreed with it – it aligned with ensuring A.K. was emotionally ready. However,\nwhen the written order came out on November 6, 2024, it omitted the phase-in\nsequence and instead directed that reunification therapy with a specific counselor\n(Kelly Turner) begin right away. Despite concerns that this contradicted the court’s\nstated intent, Father complied fully with the November 6 order. He did not\nchallenge or ignore it; rather, he promptly facilitated the ordered therapy: he allowed\nMother’s attorney to choose the reunification therapist (Ms. Turner), let Mother\nset the initial appointments, and made A.K. available for every scheduled session.\n• Full Compliance and Participation: Father never impeded the reunification\ncounseling. To the contrary, he went to great lengths to make it successful. He\nprovided a shared Google calendar to both Mother and Ms. Turner to coordinate\nsessions and communicated his openness and availability for any appointment.\nFather made sure to attend with A.K. every session that was scheduled and\ncommunicated to him. He even rearranged other family plans – for example, cutting\nshort a family Christmas gathering on December 23, 2024 – because Mother and\nMs. Turner set a therapy session that day. (Notably, Mother herself missed that\nDecember 23 session after insisting on it; she and the therapist canceled last-\nminute after Father and A.K. had already altered their holiday plans to attend.)\nFather’s dedication is summed up in his affidavit: “I attended with A.K. whenever\nsessions were set, and I went so far as to leave holiday family time and rearrange\nschedules to make therapy a priority.” He never once refused a session, never\nshowed up late (aside from instances where Mother failed to confirm times), and\nnever caused a cancellation. In fact, Father confirms, “I never missed or canceled a\nsession that I was made aware of, and I accommodated every appointment that was\ncommunicated to me.” The same cannot be said for Mother – it was her inconsistent\nscheduling and attendance that undermined the continuity of therapy.\n• Therapist Kelly Turner’s Withdrawal: The reunification therapy with Ms. Turner\nultimately fell apart not because of any act of Father, but because Ms. Turner herself\nunilaterally withdrew from the case after only two joint sessions. Critically, Ms.\nTurner’s own communications and affidavit make clear why she quit – and it was not\ndue to Father “blocking” anything. On February 12, 2025, Ms. Turner submitted an\naffidavit (since she could not attend a hearing) in which she made certain\n“prejudicial statements regarding the Father” despite never having met or spoken\nwith him in person. She admitted her conclusions were based solely on limited\nemail interactions. Father’s counsel rightfully sought to cross-examine these\nconclusions by noticing Ms. Turner for a deposition on February 14, 2025. That\nsame night (Feb. 14), at 11:46 PM, Ms. Turner emailed both parties stating: “I am\nremoving myself from this case. I wish you both the best… I am not going to be able\nto continue to assist moving forward. If you need any suggestions for other\ntherapists I can provide options.” Ms. Turner specifically referenced an email from\nFather (in which Mother was allegedly not copied) as the reason for her abrupt\nwithdrawal. Father was baffled by this, as he had included Mother on all\ncommunications and immediately responded asking what email she was referring\nto. It later emerged that Mother had been emailing Ms. Turner separately behind the\nscenes – for example, Mother confirmed an appointment time with Ms. Turner via a\nprivate email that excluded Father. Thus, any confusion about who was attending\nor confirming sessions was caused by Mother’s unilateral communications, not by\nFather. Ms. Turner apparently “felt” manipulated by the situation (perhaps due to\nthese crossed communications) and chose to quit. But the key point is this: Father\ndid not fire or pressure the therapist to withdraw. Ms. Turner’s own affidavit\nstates, “this situation felt highly manipulative and… I realized that this process was\nnot going to be conducive nor effective, and a decision was made to withdraw.”\nThose were her words and decision. Father was blindsided by Ms. Turner’s exit; he\nhad been preparing to attend every session and was “ready and willing to continue\nthe reunification therapy” with her. There is no evidence whatsoever that Father\ncaused or encouraged Ms. Turner’s withdrawal. In fact, the evidence shows the\nopposite – Father was dismayed by her quitting and took immediate steps to get the\ntherapy back on track with a new counselor.\n16. After numerous instances of Father showing clear disregard for this Court’s authority it\nis abundantly clear that Fathershould be held in contempt of this Court and be ordered to\npay attorney’s fees to Mother associated with all filings related to the Parties’ holiday\nvisitation. Mother also requests that make-up visitation time between the Minor Child A.K.\nbe ordered immediately as zero visitation between A.K. and Mother was exercised due to\nFather’s noncompliance. WHEREFORE, PREMISES CONSIDERED, Mother respectfully\nprays this Honorable Court hold Father in contempt of this Court and ORDER attorney’s\nfees associated with the filing of this motion and other related filings be paid by Father to\nMother and ORDER immediate make-up visitation with the Minor Child A.K. and Mother.\nFinally, Father wishes to highlight that until Mother’s own behavior changes – until she\nmakes consistent efforts to show up, to participate in counseling, and to obey the court-\nordered schedules – progress will remain slow. The reunification process is not a one-sided\nobligation on Father; it requires Mother’s active participation and reliability, which have\nbeen sorely lacking.\nNecessity of Holding Mother Accountable Going Forward\nFather respectfully submits that Allegation 15 is meritless and should be denied in its\nentirety. The accusation of parental alienation and blocking therapy is thoroughly disproven\nby the documented facts and history above. Instead, the evidence shows Mother has\nrepeatedly failed to fulfill her court-ordered responsibilities (attendance at weekly\nreunification dinners, involvement in the children’s appointments and activities, timely\nengagement in therapy, etc.), and those failures – not any misconduct by Father – have\nstalled the reunification progress.\nIf anyone is in contempt of court orders regarding visitation and reunification, the evidence\npoints to Mother, not Father. By missing over half of the ordered visitations and\nneglecting the vast majority of A.K.’s important events, Mother has deprived herself of\nchances to rebuild trust with A.K.. By failing to stay for entire sessions or communicate\ntransparently with the reunification therapist, Mother contributed to the therapist’s\nfrustration and withdrawal. By objecting to Father’s motion to appoint a new counselor,\nMother delayed the re-start of joint therapy that might have helped mend their relationship\nin 2025. In short, Mother has not demonstrated the commitment necessary to reassure\nA.K. or to cooperate in reunification.\nFather maintains that he stands ready to facilitate and encourage any and all contact\nbetween Mother and A.K. that is in A.K.’s best interest. He has proven this through his\nactions over the last two years. Father is not the obstacle here. However, Father is also\ncognizant that forcing A.K. into visits with a reluctant Mother, without Mother doing the\nfoundational work to repair their bond, could be counterproductive. As Judge Perryman\nwisely noted, “Y’all get a chance to start over every single day… don’t screw your child up\nbecause she’s awesome.”. Father has taken that message to heart – he is striving to do this\nthe right way, by prioritizing A.K.’s emotional safety while steadily encouraging more\ninteraction.\nUntil Mother is held accountable and begins to demonstrate a consistent commitment\nto A.K.’s life and the court’s directives, this pattern is likely to continue. Father urges\nthe Court to require Mother to actually exercise her visitation (attend the dinners, show up\nfor the appointments, come to the games) and to actively participate in reunification\ntherapy when it resumes. If Mother fails to do so, such failures should carry consequences,\nbecause A.K. cannot be coerced back into a relationship by one parent alone – it requires\nMother’s genuine effort and presence.\nIn conclusion, Father refutes Allegation 15 and asks that the Court recognize the\nsubstantial evidence of his compliance and Mother’s non-compliance. The solution here is\nnot to punish Father for imaginary “alienation,” but rather to hold Mother to her\nobligations so that A.K. can gradually feel secure and rebuild trust in her. Father remains,\nas ever, willing to support reunification in any reasonable manner. He prays that the Court\nwill likewise encourage Mother to take responsibility for her part. Only when Mother\nconsistently shows up – in person and in good faith – can the reunification truly move\nforward.\nSupported by: Motion for Reunification Counselor (Feb. 14, 2025); Second Amendment to\nCounter-Petition for Contempt (detailing Mother’s missed visits); Transcript of July 31, 2024\nhearing (Judge Perryman); Order of July 24, 2025 (Judge Hall); Affidavit of C. McGregor (Nov.\n2025); Reunification Dinner Logs and Texts (Exhibits A–D); Medical Appointment\nAttendance Log (Exhibit E); Kelly Turner email of Feb. 14, 2025 (Exhibit N); and other record\nevidence cited herein. The facts overwhelmingly show Father’s compliance and Mother’s\ndefault, not the other way around. Father respectfully requests that Allegation 15 be\ndismissed on the merits, and that the Court instead take under advisement the need for\nenforcement of Mother’s compliance with the existing orders going forward.\nResponse to Allegation No. 16 – Denial of Disregard for Court Authority; Abuse of\nProcess; Request for Protective Relief and Fees\nMother alleges that Father has disregarded this Court’s authority. That allegation is false,\nunsupported, and unfounded. At no time has this Court found Father in contempt for\ndisobedience of any order, nor has Mother produced competent evidence establishing\nwillful noncompliance by Father. Repeating accusations without proof does not convert\nthem into facts.\nA. Father Has Not Disregarded This Court’s Authority\nFather has consistently complied with the Court’s orders, appeared for hearings, followed\nvisitation directives, participated in counseling when ordered, and sought clarification from\nthe Court when conflicting or ambiguous orders existed. Where disputes arose, Father\naddressed them through proper motions, not unilateral action. The Court’s repeated\nrefusal to find Father in contempt speaks for itself.\nBy contrast, Mother’s filings repeatedly rely on inflammatory conclusions rather than\nevidence, and often recycle allegations previously rejected or rendered moot by later\norders.\nB. Mother’s Pattern of Using Litigation as a Weapon\nMother has openly stated on multiple occasions that she intends to continue filing actions\nagainst Father “for 18 years,” meaning until the children reach adulthood. Video evidence\nexists documenting these statements. This is not lawful advocacy; it is an admission of\nintent to use the court system as a weapon rather than a forum for good-faith dispute\nresolution.\nThis pattern has resulted in extensive and unnecessary legal fees incurred by Father,\nparticularly related to holiday visitation filings that were avoidable and not supported by the\nunderlying facts.\nC. Thanksgiving Pickup – Evidence of Mother’s Own Failure to Engage\nDuring the Thanksgiving pickup referenced by Mother:\n• Father was inside the home.\n• A family friend walked the children, including A.K., outside.\n• Mother’s father was present with her.\n• Mother never exited the vehicle, never spoke to A.K., never asked her to come with\nher, and never attempted to engage her.\n• Mother remained in the driveway for approximately 15 minutes without making any\neffort to exercise visitation with A.K.\nThis incident directly contradicts Mother’s narrative that Father obstructs visitation. Father\ncannot be blamed for Mother’s decision to remain in her vehicle and not speak to her child.\nD. Christmas Conduct – Demonstrated Good Faith by Father\nMother did not provide A.K. a single Christmas gift, card, or acknowledgment. This was\nthe third consecutive Christmas in which Mother gave A.K. nothing.\nBy contrast:\n• Father arranged for professional photographs of the children.\n• The children helped build and present Mother with a large framed portrait of\nthemselves during the Christmas exchange.\n• Father purchased gifts for A.K. and Bennett to give to their step-siblings and sibling.\n• Father facilitated and encouraged all holiday interactions.\nThese facts are verifiable and directly undermine claims of alienation or hostility by Father.\nE. Mother’s Ongoing Financial Noncompliance\nMother is currently approximately $3,000 (about 4.5 months) behind in child support, in\ndirect violation of this Court’s orders.\nAdditionally:\n• Over the past three years, Mother has refused to pay her share of court-ordered\nmedical expenses, now exceeding $3,000.\n• Mother has refused to contribute to school expenses.\n• Over two years of weekly court-ordered meals, Mother has paid only twice.\n• Mother routinely fails to pay for the children’s food during her visitation, including\nsituations where she orders food for her stepchildren but waits for Father to arrive\nbefore ordering food for Bennett.\nThis is a documented pattern of noncompliance, not isolated oversight.\nF. Reunification Therapy Was Not Blocked by Father\nMother’s claim that Father “successfully blocked reunification therapy” is demonstrably\nfalse. The record reflects that:\n• Father complied with the reunification therapy order.\n• Father made the child available.\n• The reunification counselor conducted only two sessions and then unilaterally\nwithdrew.\n• Father promptly filed motions seeking clarification and appointment of a new\ncounselor.\n• Therapy stalled due to factors outside Father’s control, not obstruction by Father.\nG. Requested Relief\nGiven the above, Father respectfully requests that the Court:\n1. Reject Allegation No. 16 as unsupported and unfounded.\n2. Find that Mother has engaged in a pattern of abusive litigation conduct and\nmisuse of the court process.\n3. Enter a protective order limiting repetitive, duplicative, or bad-faith filings absent\nleave of court or a certification of new, material facts.\n4. Order Mother to pay Father’s reasonable attorney’s fees and costs, particularly\nthose associated with holiday visitation litigation necessitated by her conduct.\n5. Address Mother’s child support arrearage and unpaid medical expenses.\n6. Admonish Mother that continued use of the court system as a weapon against\nFather and A.K. will not be tolerated.\nFather has respected this Court’s authority at every stage. What threatens the integrity of\nthese proceedings is not Father’s conduct, but Mother’s continued pattern of unsupported\nallegations, repeated filings, and refusal to comply with existing orders.\nFather’s Motion for Protective Order and for Award of Attorney’s Fees\nFather, Christopher Blaine McGregor (“Father”), by and through undersigned counsel,\nrespectfully moves this Honorable Court for entry of a Protective Order governing future\nfilings and for an award of attorney’s fees and costs, and states as follows:\nI. Introduction\nThis motion is not filed lightly. It is necessitated by Mother’s repeated misuse of the court\nsystem through serial, unsupported filings, many of which recycle allegations previously\naddressed, clarified, or rejected by this Court. These filings have caused unnecessary\nfinancial harm to Father and emotional harm to the minor child, A.K., while diverting\njudicial resources from legitimate matters.\nFather has consistently complied with this Court’s orders and sought relief only through\nproper channels. By contrast, Mother has demonstrated a pattern of litigation conduct that\nis punitive in nature and untethered from the evidentiary record.\nII. Pattern of Abusive Litigation Conduct\nMother has filed multiple contempt and enforcement actions predicated on:\n• Mischaracterizations of oral rulings;\n• Reliance on superseded or clarified orders;\n• Allegations directly contradicted by transcripts, orders, and objective evidence;\n• Repackaged accusations previously resolved or rendered moot.\nOn multiple occasions, Mother has openly stated that she intends to continue filing actions\nagainst Father “for 18 years,” meaning until the children reach adulthood. Video evidence\nexists documenting these statements. This is not advocacy in good faith; it is an admission\nof intent to use litigation as a weapon rather than as a means of resolving legitimate\ndisputes.\nThis pattern has forced Father to repeatedly incur legal fees to defend against allegations\nthat lack factual or legal support.\nIII. Harm to the Minor Child\nMother’s conduct has not only harmed Father financially, but has also adversely affected\nA.K. The repeated litigation, accusations, and forced exchanges have occurred despite the\nCourt’s acknowledgment—after the in camera interview—that A.K. experiences significant\nemotional distress related to visitation issues.\nRather than working within the reunification framework ordered by the Court, Mother has\nrepeatedly attempted to litigate around it, increasing conflict and instability for the child.\nIV. Financial Harm and Unnecessary Attorney’s Fees\nAs a direct result of Mother’s filings—particularly those related to holiday visitation—Father\nhas incurred substantial and avoidable attorney’s fees. These filings were unnecessary,\noften contradicted by the record, and in some instances required solely because Mother\nattempted to enforce orders that had already been clarified or superseded.\nEquity and fairness require that Mother bear responsibility for the costs generated by her\nconduct.\nV. Mother’s Ongoing Noncompliance with Court Orders\nWhile repeatedly accusing Father of contempt, Mother herself remains in violation of\nmultiple court orders, including:\n• Child Support: Mother is approximately $3,000 (4.5 months) in arrears.\n• Medical Expenses: Mother has refused for more than three years to pay her share\nof court-ordered medical expenses, now exceeding $3,000.\n• Court-Ordered Meals: Over two years of weekly court-ordered meals, Mother has\npaid only twice.\n• General Support: Mother has refused to contribute to school expenses or routine\ncosts.\nThis imbalance—where one party repeatedly accuses while refusing to comply—\nunderscores the need for judicial intervention to prevent further abuse of process.\nVI. Legal Basis for Protective Relief\nAlabama courts possess inherent authority to:\n• Prevent abuse of the judicial process;\n• Limit repetitive or bad-faith filings;\n• Award attorney’s fees where equity demands.\nA narrowly tailored protective order is appropriate where a party demonstrates a pattern of\nvexatious or harassing litigation conduct, particularly in domestic relations cases involving\nminor children.\nFather is not seeking to bar Mother from legitimate access to the Court. He seeks only\nreasonable safeguards to ensure future filings are made in good faith and based on\nmaterial, verifiable facts.\nVII. Requested Relief\nFather respectfully requests that the Court enter an order:\n1. Issuing a Protective Litigation Order, such that any future contempt or\nenforcement filings by Mother must:\no Be based on new, material facts not previously litigated; and\no Include a certification of good-faith factual basis; or\no Alternatively, require leave of Court before filing_plugin\n2. Awarding Father reasonable attorney’s fees and costs, including but not limited\nto those incurred in responding to Mother’s holiday visitation filings and repeated\ncontempt motions.\n3. Addressing Mother’s child support and medical expense arrearages and\nordering compliance forthwith.\n4. Admonishing Mother that continued misuse of the court system as a means of\nharassment or leverage will not be tolerated.\n5. Granting such other and further relief as the Court deems just and proper.\nVIII. Conclusion\nFather has respected this Court’s authority at every stage. What threatens the integrity of\nthese proceedings is not Father’s conduct, but Mother’s continued pattern of unsupported\nallegations, repetitive filings, and refusal to comply with existing orders while invoking the\nCourt as a punitive tool.\nA protective order and fee award are necessary to restore balance, protect the minor child,\nand ensure that future litigation—if any—is undertaken responsibly and in good faith.\n•",
  "source_metadata": {
    "method": "pdfplumber",
    "pages": 23
  },
  "modified_time": 1767929814.0
}