{
  "doc_id": "40cd240ec777030da42ac428fc7a71c4c69285d5bfd76a867f24f6a5eed1d007",
  "file_path": "C:\\Users\\blain\\Dropbox\\Master_Court_Files\\15_Letters_and_Emails\\2025-04-02_Letter_to_Barbie_Settle_Offer.pdf",
  "file_name": "2025-04-02_Letter_to_Barbie_Settle_Offer.pdf",
  "doc_type": "pdf",
  "date": null,
  "parties": [],
  "raw_text": "LAW OFFICE OF\nDIANNE JAMES DAVIS\n107 Main Street\nAlexander City, Alabama 35010\ndianne@diannedavislaw.com\nTelephone: 256-392-3172 Facsimile: 256-392-3578\nApril 2, 2025\nVia Email Only\nBarbara H. Agricola\n127 South 8 th Street\nOpelika, AL 36801\nRe: Brittany Michelle Gilliland vs. Christopher Blaine McGregor\nIn the Circuit Court of Tallapoosa County, Alexander City Division\nCase #70-DR-2023-900051.01\nDear Barbie:\nAs you know, we have court on Thursday. It is my understanding that Brittany and\nBlaine would like to discuss a possible resolution. According to Blaine, the co-parenting has\nbeen going great. Brittany recently attended one of Addie Kate’s soccer games and sat with\nBlaine and his family, and Addie Kate stated that “it was nice to see everyone getting along”.\nAdditionally, Blaine and Brittany have worked together to schedule family dinners &\nactivities so that Brittany and Addie Kate could spend time together while also ensuring Addie\nKate felt comfortable. Blaine, Brittany, Addie Kate, & Bennett spent time together-shopping,\nplaying at the park, and lunch after Addie Kate’s soccer game. Blaine also allowed Brittany an\nextra Friday night and all-day Saturday with Bennett so they could attend Monster Jam. On one\noccasion, when Brittany was in Alexander City, she met Blaine and the kids at the park and had\ndinner afterwards. Overall, things have been much calmer, and Blaine says that Addie Kate is\nstarting to become more open minded when it comes to her mother. He truly wants a positive\nco-parenting relationship with Brittany.\nBlaine believes that forcing visitation on Addie Kate has not worked, this more natural\nand normal approach will continue to lead them in the right direction to improve the\nmother-daughter relationship between Brittany and Addie Kate.\nBrittany Michelle Gilliland v. Christopher Blaine McGregor\n70-DR-2023-900051.01\nPage 1 of 2\nBlaine proposes the following:\nRather than Bennett and possibly, in the future, Addie Kate, visiting with their mother the\n1 st and 3 r d weekends from Thursday to Monday, given Brittany’s move and the long round trip,\nBlaine suggests every other weekend from Friday to Sunday. He will gladly pick Bennett up and\nhave him ready when Brittany arrives to pick him up. This does not preclude her from picking\nhim up from school if she is able.\nRegarding Addie Kate, Blaine believes she should be allowed to decide when she’s\ncomfortable enough to visit with her mother, as forcing the issue has not been beneficial at all.\nPlease discuss with your client as Blaine believes that going to court will cause the\nrelationship to go back to square one. His words to me were “if we can’t co-parent and stay out\nof the courtroom, none of this will ever get better.”\nSincerely,\nDianne James Davis\nDJD/ts\nBrittany Michelle Gilliland v. Christopher Blaine McGregor\n70-DR-2023-900051.01\nPage 2 of 2",
  "source_metadata": {
    "method": "pdfplumber",
    "pages": 2
  },
  "modified_time": 1759002024.0
}