{
  "doc_id": "443b8421c5042ba52f2eb419de4a79d14ff1a6779a70b0b7925a6b63c0125ae6",
  "file_path": "C:\\Users\\blain\\Dropbox\\Master_Court_Files\\09_Summaries\\2024-09-12_Differences_In_Proposed_RT_Orders.pdf",
  "file_name": "2024-09-12_Differences_In_Proposed_RT_Orders.pdf",
  "doc_type": "pdf",
  "date": null,
  "parties": [],
  "raw_text": "Supporting Statement Regarding Proposed Orders\n(September 12, 2024)\nCOMES NOW the Respondent, Christopher Blaine McGregor (“Father”), and respectfully submits the\nfollowing statement in support of his proposed order and in opposition to the competing proposed\norders submitted by the Petitioner, Brittany Michelle Gilliland (“Mother”):\n1. Therapist Selection and Cost Allocation\nMother’s proposed orders designate a specific therapist (Kelly Turner) and mandate that Father share\nin the costs of reunification therapy. In contrast, Father’s proposal allows Mother the freedom to select\nan independent and certified reunification therapist, but appropriately places the full financial\nresponsibility on Mother, as she is the party seeking reunification services.\n2. Child Advocacy Center Counseling\nMother’s proposals would allow her to attend Child Advocacy Center (CAC) sessions if and when\navailable. Father’s proposal prioritizes A.K.’s ongoing mental health by requiring that CAC counseling\ncontinue as recommended until deemed unnecessary by the CAC.\n3. Weekly Family Meals\nMother’s proposed orders impose rigid weekly Wednesday evening dinners at 6:30 p.m., with a\nmandatory make-up meal if canceled. This rigidity fails to account for the realities of school,\nextracurricular activities, and work schedules. Father’s proposal instead provides for one weekly family\nmeal, with flexibility to select a mutually convenient time, and establishes Sunday lunch as a default.\n4. Contempt Provision\nMother’s proposed orders include a punitive contempt clause directed solely at Father. Father’s\nproposed order omits this provision, reflecting a focus on cooperation and the best interests of the child.\nConclusion\nMother’s proposed orders are punitive, rigid, and place undue financial and logistical burdens on\nFather. By contrast, Father’s proposal is reasonable, balanced, and child-centered. WHEREFORE,\nFather respectfully requests that this Court adopt his proposed order in full and deny the adoption of the\ncompeting proposals submitted by Mother.\nComparison of Proposed Orders (September 12,\n2024)\nIssue Brittany #1 (Doc 55) Blaine (Doc 53) Brittany #2 (Doc 51)\nShow Cause Continued until after Same. Same.\nHearing counseling begins.\nReunification With Kelly Turner. Continue Mother selects therapist Same as Brittany #1.\nTherapy until Mother feels it’s no longer (independent, certified). Only\nneeded. Costs split per decree. Mother & A.K. attend. Costs\nContempt if Father impedes. 100% Mother. Must consider\nA.K.’s schedule & CAC.\nCAC Counseling Mother may attend CAC Father ensures A.K. continues Same as Brittany #1.\nsessions once available. current CAC counseling until\nno longer needed.\nReunification Report after 10 joint sessions Same (but only Mother & A.K.). Same as Brittany #1.\nReport or earlier if sufficient\nrelationship.\nWeekly Meals Mandatory Wednesday 6:30 One weekly meal (flexible). Same as Brittany #1.\npm dinners. Priority over all. Default Sunday lunch if no\nMake-up next day if canceled. agreement.\nCost Sharing Split per decree (shared Mother pays all reunification Same as Brittany #1.\ncosts). therapy.\nContempt Clause Explicit against Father. No contempt clause. Same as Brittany #1.",
  "source_metadata": {
    "method": "pdfplumber",
    "pages": 2
  },
  "modified_time": 1758990792.0
}