{
  "doc_id": "472fae50e8cdc36a6b1dc935abb337ea07905882e71db4c959d7bef97583609c",
  "file_path": "C:\\Users\\blain\\Dropbox\\Master_Court_Files\\03_Pleadings\\Objection to motion to set aside court ordered holiday visitation email response to blaine lawyer 11.7.25.pdf",
  "file_name": "Objection to motion to set aside court ordered holiday visitation email response to blaine lawyer 11.7.25.pdf",
  "doc_type": "pdf",
  "date": null,
  "parties": [],
  "raw_text": "Blaine McGregor <blaine35010@gmail.com>\nFW: Notice of Motion Filing - 70-DR-2023-900051.01 - KMH\nBlaine McGregor <blaine35010@gmail.com> Fri, Nov 7, 2025 at 12:44 PM\nTo: Dianne Davis <dianne@diannedavislaw.com>, Traci Sinclair <paralegal@diannedavislaw.com>, Darlene Meadows <billing@diannedavislaw.com>,\ndiannejamesdavis@gmail.com\nIf they wanted to change the temporary order we had for AK, they should have shown up to court. I\nattached a list of all the missed dinners and the text that goes with them. I also bend over backwards for her,\nnot doing it anymore.\n#4\n· Turner never provided or communicated her policies.\n· I had to beg Turner to confirm APTs because Brittany would text me when the appointments were made. Brittany made\nwithout me confirming, Turner never asked me to confirm, I was begging her to confirm the apts. Brittany making RT APT\nTurner not responding Email\n· Turner has stated that AK was not a patient of hers, how can I schedule an appointment for Brittany?\n· I told Turner from day 1 that I would let Brittany schedule the appointments, provided them both with the google calendar\nfor both kids, and told them both I would have AK at whatever apt Brittany scheduled. Turner Email 1\n· Turner nor Brittany had ever asked me to confirm an appointment prior to this appointment they are referring to. Brittany\nresponded privately to Turner confirming the appointment, removing me from the email and knowing she had confirmed the\nappointment with Turner. I didn’t respond because I didn’t know Brittany had removed me from the email and confirmed\nprivately with Turner in a separate email. Private Email Turner Brittany 12.3.24\n· To date Turner has refused to answer what email she was referring to in their exhibits that states “Based off Blaine’s most\nrecent email (which Brittany was not included) unfortunately, I am removing myself from this case”. I never sent Turner an\nemail without Brittany in copy.\n· I never missed a session; Brittany & Turner however missed a session after having AK & I leave a family Christmas party\nearly so we could drive to Auburn on 12/23 for the session Brittany scheduled. Private Text Turner Brittany 1 & 2\n· Brittany and Turner purposely scheduled over AKs CAC and Dr. APTs – I had to cancel & change to accommodate the\nappointments that Brittany made with Turner. Turner Email 2\n#5\n· Brittany requested to have dinners moved from Wednesday to Sunday 1-6.\n· Brittany does not work – There is no weekly schedule to work around.\n· Brittany hasn’t requested to schedule dinner at 1:30PM for months.\n· I have bent my schedule & kids schedules again to accommodate Brittany & she still doesn’t show up.\n· See Attached Missed Dinner Schedule & Text Messages.\n#6\n· I told Brittany I was not available – She kept calling & messaging me over and over about it.\n· What I told Brittany was “If AK feels comfortable enough going you are more than welcome to pick her up and take her. I\nhowever will not be available.”\n· I can’t arrange my entire life around Brittany, Bradley, & their 3 kids. Brittany wants the dinners arranged around the baby,\nBradley’s kids, Bradley’s work schedule, her work schedule, the baby, it’s just not possible. I must prioritize our 2 children and\nat the end of the day, Ella isn’t a concern to me. I offered Brittany the opportunity to take AK if she felt comfortable going.\n#7\n· If AK is scared to have normal visits with Brittany, what makes her think AKs just going to hop in the car and ride off to\nClanton to spend the night?\n· Brittany didn’t give AK her gifts because she sold them on Facebook – Attached\n#9\n· Last Thanksgiving was my Thanksgiving – Brittany would not have been able to see Bennett because our divorce decree\ndoesn’t divide Thanksgiving day. I let Brittany pick Bennett up the night before Thanksgiving and return him home on\nThanksgiving day at 3PM. I also took AK to dinner the night before to see her mother for Thanksgiving. – Thanksgiving Text\n11.7.24\n10.12.25 Dinner.pdf\n931 7.13.25 Dinner.pdf\n957 7.20.25 Dinner.pdf\n979_980 8.3.25 Dinner.pdf\n990_994 8.10.25 Dinner.pdf\n996_998 8.17.25 Dinner.pdf\n1005 8.24.25 Dinner.pdf\n1033 9.14.25 Dinner.pdf\n1061 9.28.25 Dinner.pdf\n1166_1167 10.19.25 Dinner.pdf\n1183_1184 10.26.25 Dinner.pdf\nBrittany AKs Gift on Facebook.jpg\nBrittany Making RT APT Turner not responding to…\nObjection Info 11.7.25.docx\nPrivate Email Turner Brittany 12..3.24 303PM.png\nPrivate Text Between Brittany & Turner.png\nPrivate Text Turner Brittany No Show APT .png\nText about Ella dedication.pdf\nThanksgiving Text 11.7.24.pdf\nTurner Email 1.pdf\nTurner Email 2.pdf\nTurner Email 3 12.12.24.pdf\nTurner Email 4.pdf\nTurner Email 5.pdf\n[Quoted text hidden]\nMissed Dinners 11.7.25.pdf\n419K",
  "source_metadata": {
    "method": "pdfplumber",
    "pages": 4
  },
  "modified_time": 1767901541.0
}