{
  "doc_id": "47fb85681dda30670b83db02d5e163af7d7a3e01b741f6b47450b3cd53efc5a6",
  "file_path": "C:\\Users\\blain\\Dropbox\\Master_Court_Files\\10_Motions\\2026-01-08_MOTION FOR CONTEMPT.pdf",
  "file_name": "2026-01-08_MOTION FOR CONTEMPT.pdf",
  "doc_type": "pdf",
  "date": null,
  "parties": [],
  "raw_text": "AlaFile E-Notice\n70-DR-2023-900051.01\nJudge: KEVIN HALL\nTo: DAVIS DIANNE JAMES\ndianne@diannedavislaw.com\nNOTICE OF ELECTRONIC FILING\nIN THE CIRCUIT COURT OF TALLAPOOSA COUNTY, ALABAMA\nCHRISTOPHER BLAINE MCGREGOR V. BRITTANY MICHELLE GILLILAND\n70-DR-2023-900051.01\nThe following matter was FILED on 1/8/2026 9:24:27 AM\nD001 GILLILAND BRITTANY MICHELLE\nMOTION FOR CONTEMPT\n[Filer: AGRICOLA BARBARA HAMLIN]\nNotice Date: 1/8/2026 9:24:27 AM\nPATRICK CRADDOCK\nCIRCUIT COURT CLERK\nTALLAPOOSA COUNTY, ALABAMA\n395 LEE STREET\nALEXANDER CITY, AL, 35010\n256-234-4361\npatrick.craddock@alacourt.gov\nDOCUMENT 437\nELECTRONICALLY FILED\n1/8/2026 9:24 AM\nSTATE OF ALABAMA Revised 3/5/08 Case No. 70-DR-2023-900051.01\nUnified Judicial System CIRCUIT COURT OF\nTALLAPOOSA COUNTY, ALABAMA\n70-TALLAPOOSA District Court Circuit Court DR202390005101\nPATRICK CRADDOCK, CLERK\nCIVIL MOTION COVER SHEET\nCHRISTOPHER BLAINE MCGREGOR V. BRITTANY\nName of Filing Party:D001 - GILLILAND BRITTANY MICHELLE\nMICHELLE GILLILAND\nOral Arguments Requested\nName, Address, and Telephone No. of Attorney or Party. If Not Represented.\nBARBARA H. Agricola\n127 SOUTH 8TH STREET\nOPELIKA, AL 36801\nAttorney Bar No.: AGR004\nTYPE OF MOTION\nMotions Requiring Fee Motions Not Requiring Fee\nDefault Judgment ($50.00) Add Party\nJoinder in Other Party's Dispositive Motion Amend\n(i.e.Summary Judgment, Judgment on the Pleadings,\nChange of Venue/Transfer\norother Dispositive Motion not pursuant to Rule 12(b))\n($50.00) Compel\nJudgment on the Pleadings ($50.00) Consolidation\nContinue\nMotion to Dismiss, or in the Alternative\nSummaryJudgment($50.00) Deposition\nRenewed Dispositive Motion(Summary Designate a Mediator\nJudgment,Judgment on the Pleadings, or other Judgment as a Matter of Law (during Trial)\nDispositiveMotion not pursuant to Rule 12(b)) ($50.00)\nDisburse Funds\nSummary Judgment pursuant to Rule 56($50.00)\nExtension of Time\nMotion to Intervene ($297.00)\nIn Limine\nOther\nJoinder\npursuant to Rule ($50.00)\nMore Definite Statement\n*Motion fees are enumerated in §12-19-71(a). Fees Motion to Dismiss pursuant to Rule 12(b)\npursuant to Local Act are not included. Please contact the\nNew Trial\nClerk of the Court regarding applicable local fees.\nObjection of Exemptions Claimed\nLocal Court Costs $ 0 Pendente Lite\nPlaintiff's Motion to Dismiss\nPreliminary Injunction\nProtective Order\nQuash\nRelease from Stay of Execution\nSanctions\nSever\nSpecial Practice in Alabama\nStay\nStrike\nSupplement to Pending Motion\nVacate or Modify\nWithdraw\nOther Motion for Contempt\npursuant to Rule NA (Subject to Filing Fee)\nCheck here if you have filed or are filing contemoraneously Date: Signature of Attorney or Party\nwith this motion an Affidavit of Substantial Hardship or if you\n/s/ BARBARA H. Agricola\nare filing on behalf of an agency or department of the State, 1/8/2026 9:22:19 AM\ncounty, or municipal government. (Pursuant to §6-5-1 Code\nof Alabama (1975), governmental entities are exempt from\nprepayment of filing fees)\n*This Cover Sheet must be completed and submitted to the Clerk of Court upon the filing of any motion. Each motion should contain a separate Cover Sheet.\n**Motions titled 'Motion to Dismiss' that are not pursuant to Rule 12(b) and are in fact Motions for Summary Judgments are subject to filing fee.\nDOCUMENT 438\nELECTRONICALLY FILED\n1/8/2026 9:24 AM\n70-DR-2023-900051.01\nCIRCUIT COURT OF\nTALLAPOOSA COUNTY, ALABAMA\nPATRICK CRADDOCK, CLERK\nIN THE CIRCUIT COURT OF TALLAPOOSA COUNTY, ALABAMA\nCHRISTOPHER BLAINE MCGREGOR,\nRespondent,\nv. CASE NO.: 70-DR-2023-900051.01\nBRITTANY MICHELLE GILLILAND,\nPetitioner.\nMOTION FOR CONTEMPT\nCOMES NOW, Petitioner BRITTANY GILLILAND, by and through the undersigned\ncounsel of record, Barbara H. Agricola, with the law firm of Agricola Law, LLC, and files this\nMotion for Contempt. In support thereof, Petitioner states as follows:\n1. On November 6, 2025, This Honorable Court ordered Father to comply with the\nParties’ holiday visitation schedule as set out in the Parties’ Divorce Settlement\nAgreement [Doc. 416];\n2. On November 6, 2025, Father filed a Motion to Set Aside Order Granting Holiday\nVisitation as an attempt to deprive Mother of her parental right to see her own child\n[Doc. 422];\n3. On November 12, 2025 this Honorable Court issued an Order denying Father’s motion\n[Doc. 429]. The Order states, in part:\nIt is well established law that both a parent and a child have a fundamental right to free\nassociation, care, and control with each other, provided the parent is a fit parent, and\nthat right extends to reasonable rights of visitation for a non-custodial situation.\nSee November 12, 2025 Order ¶ 1.\n4. This Honorable Court also restated that the evidence provided thus far does not\n“provide a sufficient basis to deprive either parent of visitation” for this holiday season.\nSee Order [Doc. 429].\nBrittany Michelle Gilliland v. Christopher Blaine McGregor\nCircuit Court of Tallapoosa County, Alabama\nCase No.: 70-DR-2023-900051.01\nMotion for Contempt\nPage 1 of 6\nDOCUMENT 438\n5. Given the above circumstances, Mother should have been able to fully exercise her\nvisitation awarded to her in the Parties’ Final Order of Divorce. However, as seen by\nFather’s prior history in blocking any and all visitation with the Minor Child A.K., it\nshould come as no surprise to this Court that Mother was unable to exercise her holiday\nvisitation;\n6. On December 4, 2025, the undersigned’s office reached out to opposing counsel to\nconfirm the holiday visitation dates per the agreement. Opposing counsel stated,\n“Blaine’s Christmas is from 12-18-2025 to Christmas Day (12-25) at 6:00, then\nBrittany has 12-25 at 6:00 until 1-1-2026 at 6:00 for her Christmas, then her weekend\nwould be Jan 2, 3, 4,” which the undersigned then confirmed and relayed to Mother.\nThe undersigned corrected that the pick-up time for Mother on December 25, 2025 is\nin fact 12:00pm, not 6:00pm which opposing counsel previously stated, which was\nconfirmed by the opposing counsel in order to avoid any potential miscommunication\nbetween Mother and Father when the time to exchange the Minor Children came;\n7. On December 21, 2025, the Parties met for their weekly family dinner. During this\ndinner, Father explained that the Minor Child, A.K., had planned for an extracurricular\ntrip through her church from December 27, 2025 until January 6, 2026. This would\n“coincidentally” conflict with Mother’s holiday visitation which was to begin on\nDecember 25, 2025 and end on January 1, 2026. Since this was during Mother’s\nvisitation, she had arranged for A.K. to attend a family gathering before promptly\nreturning A.K. to Father’s home for her trip;\n8. Following this dinner, Mother received a phone call from Father where he had only\nmentioned the Minor Child, B.M., for holiday visitation;\nBrittany Michelle Gilliland v. Christopher Blaine McGregor\nCircuit Court of Tallapoosa County, Alabama\nCase No.: 70-DR-2023-900051.01\nMotion for Contempt\nPage 2 of 6\nDOCUMENT 438\n9. As a result, the undersigned reached out once more to the opposing counsel on Tuesday,\nDecember 23, 2025 to confirm that Father will comply with this Court’s orders, no\nresponse was received;\n10. When the exchange of the Minor Children occurred on December 25, 2025, Father\nasked if the pick-up time could be pushed back one hour so that Minor Child B.M.\ncould play with his Christmas present. Mother informed Father that she was already on\nthe road to pick up the Minor Children, to which Father then informed B.M. that Mother\nrefused to allow him to play with his toy, causing B.M. to be upset with Mother upon\nMother’s arrival. This was another manipulation tactic by Father to foster negative\nemotions towards Mother and to change the Minor Child’s perception of Mother;\n11. Furthermore, Father’s sister, Katie McGregor, was at Father’s residence helping the\nMinor Child ,A.K., pack for her trip at the time of the visitation exchange. When\nMother asked if A.K. was coming with B.M. into the car for pick up, Father reportedly\nstated “if you want to go you can go” to A.K., to which she declined and went back\ninside Father’s residence;\n12. This Court has been explicitly clear regarding visitation especially as it relates to\nputting the responsibility of exercising visitation in the Minor Child A.K.’s hands.\nFather has previously made and continues to make zero attempt to encourage visitation\nbetween the Minor Child A.K. and Mother and consistently engages in parental\nalienation;\n13. On July 24, 2025, this Court issued an Order stating, in part, “Both parties are to parent\nand not permit the/a child to control the operations of this Court’s orders.” See July 24,\n2025 Order [Doc. 222];\nBrittany Michelle Gilliland v. Christopher Blaine McGregor\nCircuit Court of Tallapoosa County, Alabama\nCase No.: 70-DR-2023-900051.01\nMotion for Contempt\nPage 3 of 6\nDOCUMENT 438\n14. This Court also stated during the July 31, 2024 Show Cause Hearing that “I don’t mind\ntalking to her again and letting her know if she don’t do what I tell her she’s got to do,\nthen I may have to change custody.” See Transcript page 6, lines 16-18 [Doc. 138] and,\n“A ten-year-old can’t tell us what we’re going to do,” See Transcript page 6, line 25\n[Doc. 138];\n15. This Court’s position has been made clear since the initiation of this action that the\nMinor Child is not to dictate whether visitation is to be exercised. Father has continued\nto blatantly disregard this Court’s orders and refuses to bear any responsibility for\nensuring that visitation is properly exercised. Father continues to place this burden onto\na minor and instills distaste towards A.K.’s own mother, creating a rift and severing\nany familial bond that Mother attempts to create, which is the definition of parental\nalienation. Indeed, Father has even successfully blocked the reunification therapy that\nwas ordered by the Court with no consequences;\n16. After numerous instances of Father showing clear disregard for this Court’s authority\nit is abundantly clear that Father should be held in contempt of this Court and be ordered\nto pay attorney’s fees to Mother associated with all filings related to the Parties’ holiday\nvisitation. Mother also requests that make-up visitation time between the Minor Child\nA.K. be ordered immediately as zero visitation between A.K. and Mother was exercised\ndue to Father’s noncompliance.\nWHEREFORE, PREMISES CONSIDERED, Mother respectfully prays this Honorable\nCourt hold Father in contempt of this Court and ORDER attorney’s fees associated with\nthe filing of this motion and other related filings be paid by Father to Mother and ORDER\nimmediate make-up visitation with the Minor Child A.K. and Mother.\nBrittany Michelle Gilliland v. Christopher Blaine McGregor\nCircuit Court of Tallapoosa County, Alabama\nCase No.: 70-DR-2023-900051.01\nMotion for Contempt\nPage 4 of 6\nDOCUMENT 438\nRespectfully submitted on January 8, 2026.\n/s/ Barbara H. Agricola (AGR004)\nAttorney for Petitioner\nOF COUNSEL:\nAGRICOLA LAW\n127 South 8th Street\nOpelika, Alabama 36801\nTelephone: 334.759.7557\nFacsimile: 334.759.7558\nbarbara@agricolalaw.com\nwww.agricolalaw.com\nBrittany Michelle Gilliland v. Christopher Blaine McGregor\nCircuit Court of Tallapoosa County, Alabama\nCase No.: 70-DR-2023-900051.01\nMotion for Contempt\nPage 5 of 6\nDOCUMENT 438\nCERTIFICATE OF SERVICE\nThis is to certify that I have this day served the following with a copy of the foregoing, by\nelectronic filing in the AlaCourt E-File System and/or by placing same in an envelope, properly\naddressed, and depositing it in the United States Mail, with adequate postage prepaid on January\n8, 2026.\nDianne James Davis\nAttorney for Father\n107 Main Street\nAlexander City, Alabama 35010\n/s/ Barbara H. Agricola\nOF COUNSEL\nBrittany Michelle Gilliland v. Christopher Blaine McGregor\nCircuit Court of Tallapoosa County, Alabama\nCase No.: 70-DR-2023-900051.01\nMotion for Contempt\nPage 6 of 6\nDOCUMENT 439\nELECTRONICALLY FILED\n1/8/2026 9:24 AM\n70-DR-2023-900051.01\nCIRCUIT COURT OF\nTALLAPOOSA COUNTY, ALABAMA\nPATRICK CRADDOCK, CLERK\nINTHECIRCUITCOURTOF TALLAPOOSACOUNTY,ALABAMA\nALEXCITYDIVISION\nMCGREGORCHRISTOPHERBLAINE, )\nPlaintiff, )\n)\nV. ) CaseNo.: DR-2023-900051.01\n)\nGILLILANDBRITTANYMICHELLE, )\nDefendant. )\nR\nE\nOrderD\nR\nO\nFor goodcause shown,Mother'sMotion for Contempt isherebyGRANTED.\nD\nE\nDONEthis[To be filled by the Judge].\nS\nO\n/s/[To be filled by the Judge]\nP CIRCUITJUDGE\nO\nR\nP",
  "source_metadata": {
    "method": "pdfplumber",
    "pages": 9
  },
  "modified_time": 1767896625.0
}