{
  "doc_id": "494313fb9152ca33be42446e0907cd9095c71c821495e2c8b7b38c95230dabab",
  "file_path": "C:\\Users\\blain\\Dropbox\\Master_Court_Files\\20_Jan_Contempt_Info\\Response 2.docx",
  "file_name": "Response 2.docx",
  "doc_type": "docx",
  "date": null,
  "parties": [],
  "raw_text": "IN THE CIRCUIT COURT OF TALLAPOOSA COUNTY, ALABAMA\nALEXANDER CITY DIVISION\n\nCHRISTOPHER BLAINE MCGREGOR, Plaintiff / Respondent\nv.\nBRITTANY MICHELLE GILLILAND, Defendant / Petitioner\nCASE NO. DR-2023-900051.01\nAFFIDAVIT OF CHRISTOPHER BLAINE MCGREGOR\nIN RESPONSE TO OBJECTION TO MOTION TO SET ASIDE ORDER GRANTING COURT-ORDERED HOLIDAY VISITATION\nI, Christopher Blaine McGregor, being duly sworn, depose and state the following facts in response to Brittany Michelle Gilliland’s Objection to Motion to Set Aside Court-Ordered Holiday Visitation filed November 6, 2025. All statements are true and based on my personal knowledge, supported by the attached exhibits.\n1. Missed and Disrupted Reunification Dinners\nThe Court ordered weekly reunification dinners to help rebuild the relationship between Brittany (“Mother”) and our daughter, A.K. The order required attendance unless there was an emergency and to make up any missed dinner the following day.\n\nBetween January and August 2025, Brittany failed to attend, canceled, or cut short the majority of those dinners. On January 10, 2025, Brittany rescheduled the court-ordered dinner to Saturday morning. I arrived with both children at 9:00 a.m. as agreed; she did not appear. On February 5, 2025, Brittany texted that she could not attend that Wednesday’s dinner because of work. She proposed Thursday instead, but did not show up then either. On February 12, 2025, I waited with the children for thirty minutes; Brittany never arrived. The next morning she accused me by text of “refusing make-up dinner” and threatened contempt even though she had not appeared the night before. On April 20 (Easter) and May 11 (Mother’s Day), I offered dinners so she could spend time with A.K.; she failed to participate. From June through August 2025, Brittany routinely ignored or canceled Sunday dinners. On June 1, June 22, and June 29 she gave late-day excuses. In July she wrote she “won’t be able to do dinners until I get back to work,” missing July 6 and 13 entirely. On July 20 she left a planned dinner early, saying she needed to return to Clanton before dark. On August 3, I sent multiple texts asking her what time she would meet us; she never answered or appeared. On August 10, she agreed to meet at 1:30 p.m. at Who’s Restaurant but never came. On August 17, she refused to come to Alexander City, insisting I drive to Clanton. On August 24, she again failed to appear, citing childcare for her stepchildren.\n\nOut of roughly thirty scheduled dinners from January through August, Brittany missed more than half. Each absence or cancellation is documented in the attached logs and text-message exhibits (Exhibits A–C).\n2. Efforts to Facilitate Visitation and Holiday Compliance\nI have complied with every visitation and counseling order and have gone beyond what was required to promote contact between Brittany and the children. \n\nI have made every attempt to kept all weekly dinner time slots open or work with Brittany on adjustments when the kids schedule had a conflict, waited with the children each week, and repeatedly messaged Brittany asking if she planned to attend. When she requested changes, I almost always accommodated them. I only insisted on following the written schedule after she began using my flexibility to accuse me of “missing” dinners.\n\nOn Mother’s Day 2025, I helped both children make gifts for their mother and invited Brittany to have dinner with A.K. Although she came by to pick up B.M., she declined to meet for dinner and left with Bennett to go back to Clanton later returning Bennett and never doing dinner with AK. On Easter 2025, I again offered for Brittany to join us for dinner so A.K. could see her mother. Brittany did not attend. \nIn addition to my weekly compliance with the Court’s orders, I have made numerous personal efforts to encourage meaningful contact between Brittany and A.K. On several occasions, I have driven A.K. to Clanton so Brittany could visit with her when Brittany was unable to travel to Alexander City. In June 2025, when Brittany said she could not attend a scheduled dinner in Alexander City, I drove to Prattville so she could spend time with A.K. After dinner, we took both children shopping at Target and a local thrift store for a few hours so Brittany could have additional time with her daughter. I also took A.K. and B.M. to Walmart to choose gifts for their mother and her new baby, and then personally drove them to the hospital so they could visit Brittany and meet their new sister. Earlier this summer, I invited Brittany and her husband to A.K.’s small family birthday party at my home; they both joined us having dinner, cake, ice cream, and  played volleyball from 3:00PM to 9:00PM. Photographs from that day are attached as Exhibit G-1, further reflecting my consistent efforts to foster a healthy relationship between Brittany and the children.\n3. Inconsistencies in Mother’s Claims vs. Record\nBrittany’s filings contain multiple inaccuracies. Her counsel alleged that I failed to attend dinners that she herself canceled or skipped. Text messages show that I was present and waiting each scheduled time (Exhibit H). She has claimed I failed to communicate plans, yet on September 14 2025 I texted Brittany confirming the 1–6 p.m. Sunday dinner; she did not respond and later said nothing was planned. The standing order already set that time. Brittany also accuses me of alienating A.K. from her. I have encouraged every effort possible at contact and never prevented communication. When Brittany demanded summer visitation with A.K. on July 14 2025 while I was out of town—after months without contact or Brittany participating in AKs activities—A.K. texted me: “No!! Please I’m scared, why is this starting now. I don’t wanna go I’m gonna have a nervous breakdown if I have to go.” Forcing holiday visitation under those conditions would be emotionally harmful and contrary to the Court’s gradual reunification plan.\n4. Response to Allegations Concerning Reunification Therapy and Kelly Turner\nAt the July 31, 2024 hearing, Judge Steven Perryman directions were gradual steps toward reunification — continuing A.K.’s individual counseling at CAC, allowing the mother to attend some sessions, and adding flexible weekly family meals. Judge Perryman stated that before any reunification therapy began, A.K. would have individual counseling followed by joint sessions with her mother once appropriate. The transcript filed February 11, 2025, confirms this. \n\nDespite this, Attorney Barbi Agricola drafted orders imposing immediate reunification therapy with Kelly Turner and fixed Wednesday dinners. Although Judge Perryman was clear in his direction that RT would come later, not now when Agricola asked on the record about RT.  Before any order was signed, Turner acted as if appointed, texting both parents on August 20, 2024, that she was “court-appointed” and referencing “notes from the court.” She began scheduling sessions, communicated privately with the mother, and worked with the Mother to schedule RT appointments on top of existing doctors, ADHD evaluation, & CAC appointments made weeks prior to RT being ordered. When Father tried to communicate professionally, Turner often replied with a single “Y” or gave dismissive responses. Evidence also shows Turner communicated privately with the mother outside the joint group text, giving one-sided updates and instructions. (Private Text)\nTurner showed bias toward the mother, dismissed father’s communications, and failed to coordinate with A.K.’s existing CAC counselor. Her conduct contradicted Judge Perryman’s intent and violated basic counseling ethics\nHowever, I complied with the November 6 order. After providing Brittany with the kid’s activities and appointments via a Google calendar, I agreed for Brittany to schedule with Kelly Turner to ensure compliance with the order. Although Brittany and Turner scheduled over AKs existing appointments, I ensured A.K. attended both RT sessions and never canceled or interfered. Turner’s own February 12 2025 affidavit admits she met only with Brittany and A.K., never with me, and relied solely on Brittany’s statements.\n \nOn February 14, 2025, my counsel noticed Turner for deposition so her statements could be examined. That same night at 11:46 p.m., Turner emailed: “I did withdraw myself from the case via that email. I have not agreed to continue RT at this time … If there is a court order that specifically indicates me to continue with RT, I respectfully would decline.” This email, attached as Exhibit N, proves Turner withdrew voluntarily.\n\nI then filed a motion to strike affidavit of Kelly Turner a Motion for Reunification Counselor, requesting appointment of Caroline Taylor, M.S., LPC, to continue therapy neutrally and ethically. Agricola’s filings claim I “sabotaged” therapy, but the record shows the opposite. All my actions aligned with Judge Perryman’s goal to proceed carefully and protect A.K.’s well-being.\n5. Conclusion and Verification\nI have complied in full with every order of this Court and have made continuous efforts to encourage a healthy relationship between the children and their mother. The attached records show that I have acted transparently, while the Petitioner has repeatedly failed to participate and misrepresented facts. For these reasons, I respectfully ask the Court to deny the Objection to Motion to Set Aside Order Granting Court-Ordered Holiday Visitation.",
  "source_metadata": {
    "method": "python-docx",
    "size": 31715,
    "modified_time": 1767929814.0
  },
  "modified_time": 1767929814.0
}