{
  "doc_id": "526fc7f6244de0c2dd766a3e749875a2c4f06ce3af823c73c8efd5bde1fc9939",
  "file_path": "C:\\Users\\blain\\Dropbox\\Master_Court_Files\\10_Motions\\2024-05-02 Contempt Petition.pdf",
  "file_name": "2024-05-02 Contempt Petition.pdf",
  "doc_type": "pdf",
  "date": null,
  "parties": [],
  "raw_text": "DOCUMENT 1\nELECTRONICALLY FILED\n5/2/2024 4:52 PM\n70-DR-2023-900051.01\nCIRCUIT COURT OF\nTALLAPOOSA COUNTY, ALABAMA\nPATRICK CRADDOCK, CLERK\nIN THE CIRCUIT COURT OF TALLAPOOSA COUNTY, ALABAMA\nCHRISTOPHER BLAINE MCGREGOR,\nRespondent,\nv.\nCASE NO.: 70-DR-2023-900051.01\nBRITTANY MICHELLE GILLILAND,\nPetitioner.\nCONTEMPT PETITION\nCOMES NOW, Petitioner-Mother BRITTANY MICHELLE GILLILAND (hereinafter\n“Mother”), by and through her undersigned counsel of record, Barbara H. Agricola and Matthew\nA. Holdren, of Agricola Law, LLC, in the above-styled cause and states unto this Honorable Court\nas follows:\nBackground:\n1. That on February 27, 2024, this Court entered a Final Decree of Divorce (“Decree”)\nbetween the Parties, wherein specific terms were ordered concerning custody, visitation,\nproperty distribution, and other relational conduct between the Parties. The Parties share\ntwo (2) Minor Children, namely, A.K. (d.o.b.: 5/24/2012) and B.M. (d.o.b.: (5.10.2019).\nAllegations of Contempt:\n2. Respondent-Father, Christopher Blaine McGregor (hereinafter “Father”), was ordered,\ninter alia, to adhere to specific provisions regarding custody, visitation, property division,\nand child support, which are enumerated in detail in the Decree. Since the issuance of the\nDecree, Father has willfully and repeatedly violated the Court’s order in ways that are\ndetrimental to Mother, the Minor Children’s well-being, and Mother's rights as detailed\nhereinbelow.\nBrittany Michelle Gilliland v. Christopher Blaine McGregor\nCircuit Court of Tallapoosa County\nCase No.: 70-DR-2023-900051.01\nContempt Petition\nPage 1 of 8\nDOCUMENT 1\nFather has Blocked/Withheld Visitation in direct violation of the Court’ Final Order:\n3. Since Mother filed her Motion to Alter Amend or Vacate the Final Decree of the Divorce,\nFather has intensified his efforts to alienate the children from Mother.1\n4. Father has unilaterally decided to withhold visitation, contrary to the Decree’s stipulations\nfor joint legal custody and scheduled custodial time with Mother. Father has violated\nMother’s visitation rights by not allowing her to see A.K. since March 27, 2024, directly\ncontravening the specified visitation schedule in the Decree.\n5. Pursuant to Paragraph 13 of the Final Order, Mother shall pick up the Minor Children from\nschool on Thursday and shall have them in her custody until they are returned to school the\nfollowing Monday morning. This shall occur the first and third weekends of each month.\nFather has prevented Mother from picking up the Minor Children from school during her\nscheduled custodial time and has actively hindered her communication with the Minor\nChildren’s school. He has informed the school that she is not permitted on school grounds\nand has blocked any contact with the school due to false statements and misrepresentations\nto school officials as to the custody rights of Mother. This has directly impacted Mother’s\nability to be involved in the Minor Children’s schooling and is a direct violation of the\nCourt’s Order.\nSevere Parental Alienation in violation of ¶¶ 13, 14, 22 of the Court’s Final Order:\n6. Father has engaged in a pattern of behavior including making derogatory comments about\nMother in front of the children, and manipulating the children’s perceptions of Mother,\nwhich directly violates the decree’s clear directives against such conduct.\n1 Mother’s Motion to Alter, Amend, or Vacate is still currently pending before this Court is Case No. DR-23-\n900051.00.\nBrittany Michelle Gilliland v. Christopher Blaine McGregor\nCircuit Court of Tallapoosa County\nCase No.: 70-DR-2023-900051.01\nContempt Petition\nPage 2 of 8\nDOCUMENT 1\n7. Father has systematically alienated A.K. from Mother through derogatory comments and\npsychological manipulation, labeling Mother as a “gas lighter,” “narcissist,” and “child\nabuser” in front of A.K.\n8. Father has unilaterally removed A.K. from activities she shared with Mother, such as dance\nclasses, further isolating her from Mother.\n9. These actions are willful and in direct violation of the Court’s Final Order. Mother requests\nthe Court hold Father in willful contempt and grant the proper relief to Mother.\nMisrepresentations and Psychological Manipulation in violation of ¶ 22 of the Court’s Final\nOrder:\n10. Father has misrepresented loving messages from Mother to A.K. as suggestive of self-\nharm, causing distress and manipulating the situation to depict Mother as mentally\nunstable.\n11. During Easter, Father threatened to involve the police and falsely accused Mother of\ncausing physical harm to A.K. using this fabricated scenario to further alienate Mother\nfrom her daughter.\n12. These actions are willful and in direct violation of the Decree. Mother requests the Court\nhold Father in willful contempt and grant the proper relief to Mother.\nHarassment and Embarrassment in violation of ¶¶ 5, 22 of the Court’s Final Order:\n13. Father’s actions, including making unfounded accusations and derogatory comments\npublicly and within the community, constitute harassment and are intended to embarrass\nand humiliate Mother, which is expressly forbidden by the decree.\n14. The Father has driven past Mother's home to intimidate her and falsely claimed she was\nBrittany Michelle Gilliland v. Christopher Blaine McGregor\nCircuit Court of Tallapoosa County\nCase No.: 70-DR-2023-900051.01\nContempt Petition\nPage 3 of 8\nDOCUMENT 1\nnot a fit parent because her car was not in the driveway, directly harassing and attempting\nto humiliate her.\n15. Father has used social media to defame Mother, falsely stating she is a child abuser and\nundermining her role and reputation as a parent.\n16. These actions are willful and in direct violation of the Decree. Mother requests the Court\nhold Father in willful contempt and grant the proper relief to Mother.\nProperty Distribution and Financial Non-Compliance in violation of ¶¶ 7, 8 of the Court’s\nFinal Order:\n17. Father has both delayed and defaulted on required equity payments and obstructed the\nMother’s attempts to retrieve her personal property, violating specific court orders\nregarding property and financial obligations.\n18. Father fraudulently signed Mother’s name to her 401K check and made a mobile deposit.\n19. The Father delayed the initial equity payment for the marital residence and made payments\nfrom an unauthorized account.\n20. Father has failed to make the car payments for the 2018 Acura MDX as ordered, adversely\naffecting the Mother's credit score. Father is currently one (1) month overdue on the\npayment schedule for the 2018 Acura MDX. Further, Father has threatened to involve the\npolice on Mother because an automatic payment towards the loan on vehicle was made\nfrom Father’s bank account.\n21. Father has not divided the marital property as ordered in the Decree. Specifically, Mother\nstill has not received the following:\na. One half of the Parties wall décor;\nb. Bedroom Lamps;\nBrittany Michelle Gilliland v. Christopher Blaine McGregor\nCircuit Court of Tallapoosa County\nCase No.: 70-DR-2023-900051.01\nContempt Petition\nPage 4 of 8\nDOCUMENT 1\nc. Half of Memory boxes;\nd. Cricut supplies (the Cricut was broken by Father);\ne. 75” TV, which was broken by Father and not usable;\nf. Kids Clothes/A.K.’s Dance clothes/DVDs. Father did not provide AK’s dance,\npreschool, pageant, or other home video DVDs;\ng. Half of A.K.’s clothing. Father only gave Mother clothing that the child had\noutgrown could no longer wear;\nh. Half of A.K.’s dance awards;\ni. Half of B.M.’s clothing. Father only gave Mother clothing that the child had\noutgrown could no longer wear;\nj. Half of “memories” in closet, including drawings/paintings/sentimental baby items,\nphotos etc.;\nk. Bedding and pillows- Father provided one sheet and fitted sheet. No other bedding\nwas given.\nl. Two white storage units;\nm. Two framed silhouette pictures;\nn. Euro Pillows\no. Beach Items;\np. Blankets;\nq. Décor Items that were on the sofa table. Father broke the lamp, so it is unusable.\nr. Credenza Décor Items;\ns. Rae Dunn Collection- Father provided 25% of total collection and kept the rest.\nSeveral pieces were intentionally broken by Father;\nt. White serving items;\nu. Crockpots;\nv. Outdoor table umbrella. Father provided a broken umbrella that was in the\nbasement and not the umbrella ordered to be distributed.\nw. Christmas Décor. Father kept the kids school made ornaments, the nutcrackers and\nseveral boxes of décor items that were not provided;\nx. Easter Décor;\nBrittany Michelle Gilliland v. Christopher Blaine McGregor\nCircuit Court of Tallapoosa County\nCase No.: 70-DR-2023-900051.01\nContempt Petition\nPage 5 of 8\nDOCUMENT 1\ny. Canon Camcorder and home videos;\nz. The money the plaintiff received from the Cavapoo’s puppies was not provided to\nMother. Bailey had 5 puppies and upon notice that I wanted to keep one, he gifted\ntwo of the puppies to Katie and Brian McGregor and Ally Brazzell. Three puppies\nwere sold.\n22. These actions are willful and in direct violation of the Decree. Mother requests the Court\nhold Father in willful contempt and grant the proper relief to Mother.\nFailure to Consult on Child-Related Decisions in Violation of ¶ 13 of the Court’s Final Order:\n23. Father has excluded Mother from important decisions concerning the children’s health,\neducation, and welfare, and has not informed her of significant events or allowed her\nparticipation in the children's lives as mandated by the joint legal custody agreement.\n24. Father failed to inform Mother about A.K.’s cheer practices and medical appointments,\nincluding a significant event where A.K. was vaccinated against HPV without Mother’s\nconsent or knowledge.\n25. Mother was falsely informed about the timing of AK’s etiquette dinner, preventing her\nfrom participating, and was not given access to other school events, directly violating the\nDecree.\n26. These actions are willful and in direct violation of the Decree. Mother requests the Court\nhold Father in willful contempt and grant the proper relief to Mother.\nBlocking Communication in Violation of ¶15 of the Court’s Final Order:\n27. The Father has frequently blocked Mother’s calls and messages, controlling when and if\nA.K. can communicate with her Mother. This has been used as a tool to alienate Mother\nfurther from her children, in direct violation of the decree that ensures daily communication\nrights.\nBrittany Michelle Gilliland v. Christopher Blaine McGregor\nCircuit Court of Tallapoosa County\nCase No.: 70-DR-2023-900051.01\nContempt Petition\nPage 6 of 8\nDOCUMENT 1\n28. These actions are willful and in direct violation of the Decree. Mother requests the Court\nhold Father in willful contempt and grant the proper relief to Mother.\nAttorneys’ Fees:\n29. Due to the Father’s willful violations of the Final Decree of Divorce, Mother has incurred\nsignificant attorneys’ fees and costs. These expenses have been necessary to enforce her\nrights and the Court’s orders. Consequently, Mother requests that the Court order Father to\nreimburse these attorneys’ fees and costs as part of the relief granted in this action.\nShow Cause Hearing:\n30. Mother hereby requests the Court to schedule a hearing at the earliest possible date for\nFather to show cause why he should not be found in contempt of the Final Decree of\nDivorce.\nWHEREFORE, PREMISES CONSIDERED, Petitioner respectfully prays that, upon final\nhearing of this cause, this Court will grant the following relief:\nA. Immediately set a hearing for Father to show cause as to why he has violated the\nDecree.\nB. Find Father in contempt of the Final Decree of Divorce dated February 27, 2024.\nC. Impose appropriate sanctions to compel compliance with the Court’s orders.\nD. Order immediate enforcement of Mother’s visitation rights.\nE. Award Mother her attorneys’ fees and costs incurred as a result of this action.\nF. Grant to Mother such other and further relief as the Court deems just, proper, and to\nwhich in equity and good conscience she may be entitled.\nBrittany Michelle Gilliland v. Christopher Blaine McGregor\nCircuit Court of Tallapoosa County\nCase No.: 70-DR-2023-900051.01\nContempt Petition\nPage 7 of 8\nDOCUMENT 1\nRespectfully submitted this 2nd day of May 2024.\n/s/ Barbara H. Agricola (AGR004)\nAttorney for Petitioner\nOF COUNSEL:\nAGRICOLA LAW\n127 South 8th Street\nOpelika, Alabama 36801\nTelephone: 334.759.7557\nbarbara@agricolalaw.com\nwww.agricolalaw.com\nRESPONDENT TO BE SERVED VIA PROCESS SERVER OR CERTIFIED MAIL\nChristopher Blaine McGregor\n536 Rocky Creek Road\nAlexander City, Alabama 35010\nBrittany Michelle Gilliland v. Christopher Blaine McGregor\nCircuit Court of Tallapoosa County\nCase No.: 70-DR-2023-900051.01\nContempt Petition\nPage 8 of 8",
  "source_metadata": {
    "method": "pdfplumber",
    "pages": 8
  },
  "modified_time": 1759529810.0
}