{
  "doc_id": "530a8519957cc748f9e45a9edcb9a2c0a23a6af5ff36ccf197959be94ecc7330",
  "file_path": "C:\\Users\\blain\\Dropbox\\Master_Court_Files\\20_Jan_Contempt_Info\\1.9.26 Affidavit of Christopher Blaine.pdf",
  "file_name": "1.9.26 Affidavit of Christopher Blaine.pdf",
  "doc_type": "pdf",
  "date": null,
  "parties": [],
  "raw_text": "Affidavit of Christopher Blaine McGregor – Response to Motion for Contempt\nBackground\nI, Christopher Blaine McGregor (\"Father\"), am over 19 years of age, reside in Tallapoosa\nCounty, Alabama, and am the biological father of A.K.M. and B.M.M. I submit this affidavit\nin response to Brittany Michelle Gilliland’s (\"Mother\") Motion for Contempt filed\n8 January 2026. The motion asserts that I willfully violated the court’s orders regarding\nChristmas 2025 visitation. I respectfully deny those allegations and set out the facts\nshowing that I complied with every court order and encouraged the children’s relationship\nwith their mother.\nAllegations 1–4 – Holiday‐visitation orders and motions\nMother’s allegation: Mother claims I was required to comply with the holiday schedule in\nthe court’s November 12, 2025, order and that I filed a motion to set aside that order.\nMy response:\n• July 31, 2024, hearing (Judge Perryman’s oral ruling). After an in-camera interview\nwith our daughter, Judge Steven Perryman restricted Mother’s visitation to weekly\nfamily meals. The Court explained that the child felt unsafe; there had been\nallegations of abuse, and the school later reported bruises. The judge directed that\n“we’re going to try to get to the bottom of it” and temporarily ordered lunches and\ndinners with the entire family to normalize visitation and to send both parents to\ncounseling. He insisted that we “start over today” and “see what we can’t do to not\nscrew your child up because she’s awesome”. Mother’s counsel later drafted a\nwritten order that did not fully reflect these oral instructions.\n• November 12, 2025, order. Clarified that neither parent had been deprived of\nholiday visitation because no written order had suspended it. It did not say that A.K.\nwas emotionally ready for extended holiday time; it simply recognized that a formal\norder limiting holiday visitation had not yet been entered. I complied with that order\nby preparing both children for Thanksgiving and Christmas pickups.\n• Motion: My motion aimed to ensure the order reflected the Court’s instructions and\nwas not an attempt to deprive Mother of visitation.\nAllegation 5 – “History of blocking visitation”\nMother’s allegation: Mother contends that I have a history of blocking visitation and that I\nprevented her from exercising Christmas 2025 visitation.\nMy response:\n• No contempt findings and compliance with orders. I have never been found in\ncontempt for denying visitation. During the July 31, 2024, hearing the Court\nrecognized that A.K. was afraid to visit her mother and therefore limited visitation to\nweekly dinners; the judge encouraged us to attend counseling and did not hold me\nin contempt.\n• Facilitating and encouraging contact. I have consistently encouraged the\nchildren’s relationship with their mother. I drove to neutral locations to make\nvisitation happen, rescheduled visits, and shared holidays I was not obligated to\nshare. Examples include:\no Extra time and invitations. I offered the Mother additional Thanksgiving &\nHalloween visitation in 2024 and hosted A.K.’s birthday party at my home,\ninviting Mother and her husband despite A.K.’s reluctance. Mother and her\nhusband stayed from about 3 p.m. to 9 p.m.; we shared dinner, cake and\nice-cream, and played volleyball, while the Mother was publicly accusing me\nof alienation on social media as she sat in my living room.\no Hospital and Mother’s Day. When Mother gave birth in 2025, I took both\nchildren to the hospital with baby gifts and snacks for their Mother so they\ncould meet their new sibling. For Mother’s Day 2025, I helped the children\nbuy presents and offered dinner. Mother declined and took Bennett back to\nClanton without spending time with A.K.\no Travel to facilitate contact. I routinely met Mother halfway or at her\nrequested locations. For example, I met her in Prattville for dinner and took\nthe children shopping at Target and a thrift store so she could spend extra\ninformal time with them. On December 21, 2025, I drove both children to\nClanton because Mother wanted them to attend her church’s candlelight\nservice. A.K. declined to stay, but Bennett did; afterward I drove an hour to\nPrattville to have dinner with Mother, her father, husband, and extended\nfamily.\n• Conclusion: The Court’s limitations on visitation were based on A.K.’s emotional\nstate, not on any misconduct caused by me. I have made the children available for\nevery visit, reminded them of their mother’s love, and never told them to refuse\nvisitation. I have even invited Mother’s step-children to join us for shopping and\ndinner to allow her more time with A.K. All these efforts undercut the claim that I\nhave a history of blocking visitation.\nAllegations 6–9 – Communication and scheduling issues around Winterblast\nMother’s allegations: Mother asserts that on December 21, 2025, I told her A.K. had a\n“extracurricular” trip December 27 – January 1, 2025, that this “coincidentally” conflicted\nwith her visitation, and that I later mentioned only Bennett when discussing holiday\nvisitation.\nMy response:\n• Advance notice and consent. On December 15, 2025, I texted Mother that A.K.\nwanted to attend a Winterblast church retreat in Gatlinburg from December 27 to\nDecember 30 and that the fee was $200. I asked if she had any problem with A.K.\ngoing out of state for the trip. I also sent a screenshot of the church’s Winterblast\nweb page with deposit information. Mother did not voice any objection. On\nDecember 26, 2025, I texted Mother again reminding her that A.K. would leave early\nthe next morning and suggested she call A.K. that evening before the long drive.\nThese text messages (attached as Exhibit A) show that I gave Mother timely notice\nand invited her input.\n• Deposit paid in October 2025. To secure A.K.’s place on the trip I paid the $200\ndeposit to First Baptist Church of Alexander City on October 1, 2025. A copy of the\ncancelled check (check #137) made payable to FBCAC for $200 is attached as\nExhibit B. The memo line notes that the payment is for Addie Kate and matches the\namount referenced in my December text.\n• Holiday phone call. During a phone call about holiday logistics, I may have referred\nto Bennett when discussing pickup times. This was not intended to exclude A.K.;\nboth children were present and ready for the exchange. I never stated that A.K.\nwould be withheld. Ultimately, opposing counsel clarified that pickup for Mother’s\nChristmas time would occur at noon on December 25th (not 6 p.m.), and I followed\nthat directive.\n• Counsel communications. The confusion about the pickup time was resolved\nwhen counsel confirmed noon on December 25th; however, Mother filed her\ncontempt motion anyway. Despite the court’s schedule giving her Christmas from\nnoon December 25th until January 1, 2026, Mother failed to pick up Bennett for her\nscheduled weekend visitation 2–4 January 2026.\nAllegation 10 – Bennett’s toy and exchange on December 25, 2025\nMother’s allegation: Mother alleges that I asked to delay the holiday exchange by an hour\nso Bennett could play with his new toy and that I told Bennett his mother refused to let him\nplay, causing him to become upset.\nMy response:\n• At about 11 a.m. on December 25, 2025, I phoned Mother to ask when she would\narrive. When she said she was already on her way, I did not insist on a delay. I never\ntold Bennett that his mother refused to let him play. I didn’t tell him he was leaving\nuntil his Mother was outside.\n• Bennett became upset about leaving with his Mother. To ease the transition, I\nsuggested we take a quick photograph on our front porch—everyone briefly\n“pouting” considering Bennetts mood (photographs included as Exhibit C). I then\ninvited Mother and her husband inside so Bennett could show them his new\ncomputer from Santa. The exchange was cordial; I introduced Brittany’s husband to\nmy father. After the kids showed their gifts, we all went back outside. I buckled him\ninto Mother’s vehicle. At no time did I disparage Mother or blame her for Bennett’s\nemotions. My actions were intended to make the transition pleasant.\nAllegation 11 – Sister helping A.K. pack and leaving the decision to A.K.\nMother’s allegation: Mother claims that my sister assisted A.K. in packing on\n25 December 2025 and that I told A.K., “if you want to go you can go,” leaving the decision\nup to her.\nMy response:\n• The person Mother refers to is my sister-in-law, not my sister. She was not at my\nhome during the exchange. Security footage from her home shows she remained at\nher own home until after 3 p.m. on Christmas Day—long after the exchange had\nended. Only my father was present in the house.\n• Packing and conversation. No one was helping A.K. pack at that time—the\nWinterblast trip did not depart for two days. Both children came outside for the\nexchange. After taking photographs and inviting Mother inside, I told A.K. that the\nconversation was between her and her mother; I then returned inside to give them\nprivacy. About ten minutes later A.K. came inside on her own and stated she was\nnot ready to leave. I did not instruct her to return to the house or prevent her from\ngoing with her mother. Mother did not attempt further engagement and left without\ntaking A.K. The July 31, 2024, order directed both parents to “parent and not permit\nthe child to control the operations of this Court’s orders.” I complied by encouraging\nA.K. to go, but I did not physically force her into the car as neither did her Mother.\nAllegations 12–15 – Encouragement of visitation, parental alienation, control of\nvisitation and therapy\nMother’s allegations: Mother alleges that I made “zero attempt” to encourage visitation,\nengaged in parental alienation, let A.K. control visitation, and blocked court-ordered\nreunification therapy.\nMy response:\n• Encouragement of visitation. I have urged A.K. to attend scheduled dinners and\ncounseling with her mother. I drove the children to Mother’s church service in\nClanton on December 21, 2025, and then travelled to Prattville to join Mother’s\nfamily for dinner. I facilitated weekly dinners, phone calls and video chats whenever\nrequested. I scheduled medical appointments and school events and informed\nMother of them. Mother missed approximately half of the weekly dinners she\nrequested and attended roughly 15 percent of the children’s school and medical\nappointments.\n• A.K.’s emotional state and the Court’s orders. Judge Perryman recognized that\nA.K. was frightened and ordered a gradual approach. He instructed both parents to\nattend counseling and told us that there would be a separate reunification\ncounselor later “after we get down the road with this a little bit and see if we can’t\nget things better”. He emphasized that we should begin with weekly family dinners\nand that the goal was not to “screw [our] child up”. I followed that directive by\nmaking the children available and encouraging them to go.\n• Parental alienation. I have never disparaged Mother from the children. I facilitated\nphone calls, and FaceTime call to the point both children get aggravated with me for\npushing them to interact with their Mother. I even moved Santa’s visit to December\n23rd so Bennett wouldn’t feel conflicted about leaving after only having his gifts for a\nfew hours on Christmas Day. Her absence, not my conduct, has strained her\nrelationship with A.K.\n• Reunification therapy. After the July 31, 2024, hearing, Judge Perryman directed\nthat therapy proceed gradually and that a separate reunification counselor would be\nappointed later. Despite that oral ruling, the order drafted by Mother’s counsel\nappointed Kelly Turner for immediate joint therapy. On August 20, 2024, before any\norder existed, Ms. Turner texted both parties stating she had already held a session\nwith Mother and would be our court-appointed therapist. I responded that there was\nno order and asked whether she had a prior relationship with Mother; she did not\nanswer. After the Court signed the order submitted by Mother’s counsel on\nNovember 6, 2024, that appointed Ms. Turner, I ensured A.K. attended every\nscheduled session. When Ms. Turner scheduled a session that conflicted with A.K.’s\nlong-scheduled pediatric behavioral evaluation, I sent a text on November 12, 2024\nasking to reschedule; Ms. Turner refused and told me to communicate only by\nemail. As a result, A.K. missed her medical evaluation that she had been waiting for\nweeks for.\n• Therapist’s conduct. During the first joint session Ms. Turner told A.K. she did not\nbelieve Mother had ever hurt her and stated that “the court doesn’t believe you\neither,” causing A.K. to suffer a panic attack requiring a pediatric visit and\nanti-anxiety medication. Ms. Turner withdrew in January 2025. On February 12, 2025\n(the eve of a hearing) she filed an affidavit accusing me of manipulating the process,\ndespite only having two sessions, never meeting me in person or observing me with\nmy children. My counsel moved to strike her affidavit as one-sided and\nunsupported.\n• Summary: I have complied with all therapy orders. I did not block reunification\ntherapy; rather, I sought to follow the judge’s instructions for gradual reunification\nand to ensure the therapist was impartial. Once the Court formally appointed\nMs. Turner, I took A.K. to every session.\nAllegation 16 – Contempt, attorney’s fees and make-up visitation\nMother’s request: Mother asks the Court to hold me in contempt, award her attorney’s\nfees and order make-up visitation.\nMy response:\nThe facts above show no willful disobedience. I made the children available for the\nChristmas 2025 exchange, informed Mother well in advance of A.K.’s church trip,\nencouraged visitation, facilitated therapy and never disparaged Mother. Mother, on the\nother hand, has repeatedly missed scheduled dinners, phone calls, medical appointments\nand school events; she is currently five months behind on child support and has not paid\none dollar since our divorce towards her 50 percent share of medical expenses. She\nremarried while our divorce was on appeal (contrary to our divorce decree), relocated\n60 miles away to Clanton without notice, travels 1 hour 25 minutes each way on school\ndays with Bennett, and sold items on Facebook Marketplace that she later claimed\nprevented her from giving A.K. for Christmas. These actions demonstrate a lack of respect\nfor the Court’s orders.\nI respectfully request that the Court deny Mother’s motion for contempt, confirm my\ncompliance, and consider entering a protective order to prevent further baseless filings. I\nalso request that Mother be ordered to pay my reasonable attorney’s fees incurred in\ndefending this action.\nConclusion\nI declare under penalty of perjury that the foregoing is true and correct to the best of my\nknowledge. I have complied with every court order, informed Mother of all relevant plans,\nand encouraged the children’s relationship with her. A.K.’s distrust stems from Mother’s\nconduct—including a July 2023 incident that left bruises—and from repeated missed\nopportunities since the July 31, 2024, order. I continue to facilitate contact, but I cannot\nforce a frightened child to overcome trauma overnight. The attached exhibits (text\nmessages, deposit check and photographs) corroborate my statements. Mother’s motion\nmischaracterizes events and overlooks her own failures to engage. For these reasons I\nrespectfully request that the motion be denied and that my compliance and good-faith\nefforts be recognized.\nExhibits\n1. Exhibit A – Text message screenshots (December 15 and December 26, 2025)\nshowing that I informed Mother about A.K.’s Winterblast trip, its dates and cost, and\nrequested her input. Mother did not object.\n2. Exhibit B – Cancelled check dated 1 October 2025 payable to FBCAC in the\namount of $200.00 for A.K.’s Winterblast deposit.\n3. Exhibit C – Photographs from the Christmas Day exchange, showing me inviting\nMother inside and attempting to make the transition pleasant.\nExhibit A – Text message\nExhibit B – Cancelled check\nExhibit C – Photographs from the Christmas Day exchange\nExhibit C – Photographs from the Christmas Day exchange",
  "source_metadata": {
    "method": "pdfplumber",
    "pages": 11
  },
  "modified_time": 1767981341.0
}