{
  "doc_id": "57eb2c38374b1bebbd3ad163ee19368dcea595c8341a96e5e95146e0bf427cda",
  "file_path": "C:\\Users\\blain\\Dropbox\\Master_Court_Files\\20_Jan_Contempt_Info\\Missed and Disrupted Reunification Dinners.docx.pdf",
  "file_name": "Missed and Disrupted Reunification Dinners.docx.pdf",
  "doc_type": "pdf",
  "date": null,
  "parties": [],
  "raw_text": "Missed and Disrupted Reunification Dinners\n1. The Court ordered weekly reunification dinners to help rebuild the relationship\nbetween Brittany (“Mother”) and our daughter, A.K. The order required\nattendance unless there was an emergency and to make up any missed dinner\nthe following day.\n2. Between January and August 2025, Brittany failed to attend, canceled, or cut\nshort the majority of those dinners.\no On January 10, 2025, Brittany rescheduled the court-ordered dinner to\nSaturday morning. I arrived with both children at 9:00 a.m. as agreed; she\ndid not appear.\no On February 5, 2025, Brittany texted that she could not attend that\nWednesday’s dinner because of work. She proposed Thursday instead but\ndid not show up then either.\no On February 12, 2025, I waited with the children for thirty minutes;\nBrittany never arrived. The next morning, she accused me by text of\n“refusing make-up dinner” and threatened contempt even though she had\nnot appeared the night before.\no On April 20 (Easter) and May 11 (Mother’s Day), I offered dinners so she\ncould spend time with A.K.; she failed to participate.\no From June through August 2025, Brittany routinely ignored or canceled\nSunday dinners. On June 1, June 22, and June 29 she gave late-day\nexcuses. In July she wrote she “won’t be able to do dinners until I get back\nto work,” missing July 6 and 13 entirely. On July 20 she left a planned\ndinner early, saying she needed to return to Clanton before dark.\no On August 3, I sent multiple texts asking her what time she would meet\nus; she never answered or appeared. On August 10, she agreed to meet\nat 1:30 p.m. at Who’s Restaurant but never came. On August 17, she\nrefused to come to Alexander City, insisting I drive to Clanton. On August\n24, she again failed to appear, citing childcare for her stepchildren.\n3. Out of roughly thirty scheduled dinners from January through August, Brittany\nmissed more than half. Each absence or cancellation is documented in the\nattached logs and text-message exhibits (Exhibits A–C).\n2. Father’s Efforts to Facilitate Visitation and Holiday Compliance\n1. I have complied with every visitation and counseling order and have gone\nbeyond what was required to promote contact between Brittany and the children.\n2. Flexibility and Communication: I have kept all weekly dinner time slots open,\nwaited with the children each week, and repeatedly messaged Brittany asking if\nshe planned to attend. When she requested changes, I accommodated them. I\nonly insisted on following the written schedule after she began using my flexibility\nto accuse me of “missing” dinners.\n3. Special Occasions:\no On Mother’s Day 2025, I helped both children make gifts for their mother\nand invited Brittany to have dinner with A.K. Although she came by to pick\nup B.M., she declined to stay for the dinner and left early.\no On Easter 2025, I again offered for Brittany to join us for dinner so A.K.\ncould see her mother. Brittany did not attend.\no For summer 2025 visitation, I proactively offered Brittany an extra week\nwith B.M. during a work trip. She initially refused, then changed her mind; I\nstill allowed her to keep him that week. Counsel for both parties confirmed\nthe arrangement by email on June 2 2025 (Exhibit G).\n4. Timely Exchanges and Compliance: I have never denied Brittany her visitation\nwith either child. When she arrived for B.M., I ensured punctual exchanges.\nWhen she sought to extend time without notice, I reminded her of the court’s\nschedule but did not refuse access.\n5. Reunification Therapy Cooperation: After the Court ordered reunification\ntherapy for A.K. and Brittany, I cooperated fully. I provided A.K.’s calendar and\ntransportation and supported the sessions. I never contacted the therapist or\ncourt to block Brittany’s participation.\n6. My actions consistently reflect cooperation and the children’s best interests. The\ndocumentary record (Exhibits E–G) confirms that any disruption of visitation\nresulted from Brittany’s choices, not mine.\n3. Inconsistencies in Mother’s Claims vs. Record\n1. Claim of Missed Dinners: Brittany’s counsel alleged that I failed to attend\ndinners that she herself canceled or skipped. For example, her attorney claimed\nin February 2025 that I “missed” a rescheduled dinner when the texts show she\ncanceled and then failed to appear. The record demonstrates that I was present\nand waiting each scheduled time (Exhibit H).\n2. Claim of No Communication: Brittany has repeatedly asserted that I “did not\ncommunicate plans.” Text-message records show the opposite. On September\n14 2025 I texted Brittany that morning confirming the 1–6 p.m. Sunday dinner;\nshe did not respond and later claimed nothing had been planned. The standing\norder itself fixed the time—no additional planning was needed (Exhibit H).\n3. Claim of Alienation: Brittany accuses me of alienating A.K. from her. In reality, I\nhave encouraged every reasonable effort at contact. I never prevented\ncommunication, and I have facilitated gifts, calls, and therapy sessions. Brittany\nattended 1 of 12 soccer games, 2 of 16 football games, & 0 of 30 basketball\ngames.\n4. Holiday Visitation: Brittany objects to setting aside forced holiday visitation for\nA.K., ignoring the reality that A.K. has expressed severe distress about being\nforced into visits. When Brittany suddenly demanded summer visitation with A.K.\non July 14 2025—after no contact for months—A.K. texted me, “No!! Please I’m\nscared, why is this starting now. I don’t wanna go I’m gonna have a nervous\nbreakdown if I have to go.” (Exhibit I). Forcing holiday visitation under those\nconditions would be emotionally harmful and contrary to the Court’s gradual\nreunification plan.\n4. Response to Allegations Concerning Reunification Therapy and Kelly Turner\n1. Court Intent (July 31 2024 Hearing): Judge Perryman stated that before any\nreunification therapy began, A.K. would have individual counseling followed by\njoint sessions with her mother once appropriate. The transcript (pp. 26 ll. 20-23;\n28 ll. 8-11, 14-19; 29 ll. 11-25; 30 ll. 1-6, filed Feb 11 2025) confirms this. The\nlater November 6 2024 order omitted that sequence and directed immediate joint\ntherapy with Kelly Turner. My subsequent filings sought to correct that mistake,\nnot obstruct therapy.\n2. Full Cooperation: I complied with the November 6 order. I allowed Brittany to\nselect and schedule Kelly Turner, ensured A.K. attended both sessions, and\nnever canceled or interfered. Turner’s own February 12 2025 affidavit admits she\nmet only with Brittany and A.K., never with me, and relied solely on Brittany’s\nstatements. That record shows the process was one-sided through no fault of\nmine.\n3. Turner Withdrew Voluntarily: On February 14 2025 my counsel noticed Turner\nfor deposition so her statements could be examined. That same night at 11:46\np.m., Turner emailed:\n“I did withdraw myself from the case via that email. I have not agreed to continue RT at\nthis time … If there is a court order that specifically indicates me to continue with RT, I\nrespectfully would decline.”\nThis email, attached as Exhibit N, proves Turner withdrew of her own accord, not\nbecause of any interference by me.\n4. My Immediate Follow-Up: I then filed\n2025-02-13_MOTION_TO_STRIKE_AFFIDAVIT_OF_KELLY_TURNER.pdf and\n2025-02-14_Motion_for_Reunification_Counselor_with_Exhibits_A_B_&_C.pdf,\nrequesting that Caroline Taylor, M.S., LPC—an independent reunification\nspecialist—be appointed so therapy could continue ethically and effectively.\n5. Mischaracterization in Mother’s Objection: Agricola’s filings claim I\n“sabotaged” therapy. Those allegations are false. Turner’s own affidavit and\nwithdrawal email demonstrate she ceased participation voluntarily after realizing\nher process was compromised.\n6. Consistency with Court’s Intent: All my actions aligned with Judge Perryman’s\nstated goal—to proceed carefully and protect A.K.’s well-being. I supported\ntherapy, cooperated with scheduling, and immediately sought replacement\ncounseling when Turner withdrew.\n5. Conclusion and Verification\nI have complied in full with every order of this Court and have made continuous efforts\nto encourage a healthy relationship between the children and their mother. The attached\nrecords show that I have acted transparently, while the Petitioner has repeatedly failed\nto participate and misrepresented facts.\nFor these reasons, I respectfully ask the Court to deny the Objection to Motion to Set\nAside Order Granting Court-Ordered Holiday Visitation.",
  "source_metadata": {
    "method": "pdfplumber",
    "pages": 4
  },
  "modified_time": 1767929814.0
}