{
  "doc_id": "69d4c5df44f965e2bfe23a9c06ff1db584f5e1b6d0acf93e10a09743bce2424a",
  "file_path": "C:\\Users\\blain\\Dropbox\\Master_Court_Files\\03_Pleadings\\2024-06-24_Discovery_Requests.pdf",
  "file_name": "2024-06-24_Discovery_Requests.pdf",
  "doc_type": "pdf",
  "date": null,
  "parties": [],
  "raw_text": "IN THE CIRCUIT COURT OF TALLAPOOSA COUNTY\nCHRISTOPHER BLAINE MCGREGOR,\nRespondent,\nCASE NO.: 70-DR-23-900051.00\nv.\nBRITTANY MICHELLE GILLILAND,\nPetitioner.\nPETITIONER’S FIRST SET OF CONSOLIDATED DISCOVERY REQUESTS\nCOMES NOW, Petitioner, BRITTANY MICHELLE GILLILAND (hereinafter\n“Mother”), by and through the undersigned counsel of record, Barbara H. Agricola and Matthew\nA. Holdren, and propounds the following Interrogatories, Requests for Production of Documents,\nand Requests for Admission to the Respondent, CHRISTOPHER BLAINE MCGREGOR\n(hereinafter “Father”), pursuant to Rules 33, 34, and 36 of the Alabama Rules of Civil Procedure.\nPreliminary Statement and Definitions:\nThe following Preliminary Statement and Definitions apply to each of the Interrogatories set\nforth hereunder and they are deemed to be incorporated therein.\nA. The terms “you” and “your,” as they are used herein, refer to Respondent, and include any\nand all agents, servants, and employees to Respondent including, but not limited to,\nRespondent’s lawyer(s) and to any other person or persons acting pursuant to Respondent’s\ndirection.\nB. The singular number and the masculine gender, as used herein, shall be deemed to include\nthe plural, the feminine, or the neuter, as may be appropriate.\nC. The term “person” as used herein, shall be deemed to include, in the plural as well as\nsingular, any natural person, firm, association, partnership, joint venture, corporation or\nother legal entity unless the context is otherwise indicated.\nD. If you are asked to identify a person, please state for each such person:\n• That person’s full name;\n• If that person is other than a natural person (e.g., corporation, partnership, etc.), the\ntype of entity it is;\n• That person’s last known home address and the telephone number;\n• If the person is a natural person, his/her relationship (including business, blood or\nBrittany Michelle Gilliland v. Christopher Blaine McGregor\nCircuit Court of Tallapoosa County\nCase No.: 70-DR-23-900051.00\nPetitioner’s First Set of Consolidated Discovery Requests\nPage 1 of 9\nother relationship), if any, to you.\nE. The term “document” as used herein, shall mean originals and all copies unless identical,\nof written, recorded and graphic matter, produced or reproduced, formal or informal,\nwhether for internal or external use, including but not limited to correspondence, letters,\nmemoranda, drafts, corporate minutes, notes, minutes, lists of persons or things, books,\ncharge cards, cancelled checks, mechanical and electrical sound recording, bonuses,\nretirement benefits, savings plans, stock options, and video tapes.\nF. These interrogatories call for all information (including information contained in writing)\nknown or available to you, including all information in the possession of your attorneys,\naccountants, employees and/or their firms, corporations and other persons acting on your\nbehalf or under your control.\nG. If you cannot answer any interrogatory fully, after exercising due diligence to make\ninquiries and secure the information requested, please so state and answer each\ninterrogatory to the extent you deem possible, specifying the portion of the interrogatory\nyou claim you are unable to answer fully and completely and specifying the facts upon\nwhich you rely to support your contention that you are unable to answer the interrogatory\nfully and completely and state with knowledge, information, or belief you have concerning\nthe unanswered portion of such interrogatory.\nH. These interrogatories are continuing in character so as to require you to file supplemental\nanswers and responses of you obtain further or different information before trial as required\nby the Alabama Rules of Civil Procedure.\nThese interrogatories are to be answered under oath in writing and said written answers\nunder oath are to be served upon Petitioner ’s counsel, Barbara H. Agricola and Matthew A.\nHoldren, 127 South 8th Street, Opelika, Alabama 36801, within thirty (30) days of receipt of these\ninterrogatories, pursuant to Rule 33 of the Alabama Rules of Civil Procedure. These discovery\nrequests are continuing in nature and are due to be supplemented should any answers change and/or\nneed to be supplemented. If such supplementation and/or changes becomes necessary, it is the\nresponsibility of the answering party to take whatever action to provide said\nchanges/supplementation to Agricola Law, LLC.\nAdditionally, these discovery requests are requests to produce copies and therefore, any\ncosts for such production shall be reimbursed by Agricola Law, LLC. This means that an answer\nto any discovery request which makes the requested information/documents available for\ninspection shall be treated as a failure to respond since these are requests to produce, not make\navailable for inspection and therefore, the next appropriate steps will be taken to compel the\nproduction and/or response to said discovery requests answered in any fashion wherein it does not\ncomply with these requests to produce.\nBrittany Michelle Gilliland v. Christopher Blaine McGregor\nCircuit Court of Tallapoosa County\nCase No.: 70-DR-23-900051.00\nPetitioner’s First Set of Consolidated Discovery Requests\nPage 2 of 9\nINTERROGATORIES\n1. Describe in detail each instance since February 27, 2024, in which you did not allow the\nPetitioner-Mother, Brittany Michelle Gilliland, her scheduled visitation rights with the minor\nchildren A.K. and B.M.\nResponse:\n2. List all communications you have had with the children's school or educational institution\nconcerning Brittany Gilliland, and provide the content of such communications.\nResponse:\n3. Please detail any reasons and the factual basis for why you prevented Brittany Gilliland from\npicking up A.K. from school as stipulated in the Final Decree of Divorce.\nResponse:\n4. Please describe any instances where you have accused Brittany Gilliland of mental instability\nor suggested to any individual, including the minor children, that she is mentally unstable.\nResponse:\n5. State the name and address of all persons having substantive knowledge relating to this matter\nand identify whether or not you intend to use those persons at any proceeding in this matter as\nwitnesses or as an expert witness, including to what you expect each witness will testify and if\nas an expert witness, list the expert’s name, address, the subject matter of the testimony on\nwhich the expert is expected to testify, the substance of facts and opinions to which the expert\nis expected to testify, and a summary of the grounds for each opinion offered.\nResponse:\n6. List in detail all documents and other physical evidence which you may use in preparation or\nat any of the proceedings of this cause including any pictures of an explicit nature or otherwise,\nregardless of whether you intend to use it at the trial in this action. This includes anything\nrelated to rebuttal or impeachment.\nResponse:\n7. Please state all facts that support your accusations made against Brittany Gilliland of causing\nphysical harm to A.K. or any of the minor children.\nResponse:\nBrittany Michelle Gilliland v. Christopher Blaine McGregor\nCircuit Court of Tallapoosa County\nCase No.: 70-DR-23-900051.00\nPetitioner’s First Set of Consolidated Discovery Requests\nPage 3 of 9\n8. If you have conducted any surveillance, including but not limited to electronic surveillance\n(electronic surveillance being defined as the interception of any voice communication made\nby the Petitioner by electronically recording the same or by listening in on any voice\ncommunication made by the Petitioner), of the Petitioner, or had any person or persons conduct\nsuch surveillance on your behalf, then state what surveillance you have conducted, including\nthe date, time and place of such surveillance, the method employed for such surveillance, the\nperson conducting such surveillance, including the name and address of such person, whether\nsaid surveillance was recorded, whether a written transcript or report have been made of such\nsurveillance, and the details of what was observed and/or the details of the conversations that\nwere intercepted or recorded, regardless of whether you intend to use such documentation\nat trial. This includes anything related to rebuttal or impeachment.\nResponse:\n9. Please state all facts that support your accusations made against Brittany Gilliland for violating\nthe divorce decree.\nResponse:\n10. Please provide a detailed list of the personal property items you have failed to distribute to\nBrittany Gilliland per the Final Decree of Divorce, including but not limited to wall décor,\nbedroom lamps, memory boxes, and clothing.\nResponse:\n11. Please explain any instances in which you have signed Brittany Gilliland’s name on financial\ndocuments or checks without her express authorization. Provide dates and details of the\ndocuments.\nResponse:\n12. Please state what positive and negative qualities you feel the Petitioner has as a parent.\nResponse:\n13. Please state the last-known date that A.K., a Minor Child, engaged in visitation with Mother,\npursuant to the original Divorce Decree. Please provide explanations for specific instances\nwhere Mother was denied visitation, if there are such instances.\nResponse:\nBrittany Michelle Gilliland v. Christopher Blaine McGregor\nCircuit Court of Tallapoosa County\nCase No.: 70-DR-23-900051.00\nPetitioner’s First Set of Consolidated Discovery Requests\nPage 4 of 9\n14. Please state whether you have paid Mother her required equity payments owed on your prior\nmarital residence, the amount paid, and which dates, since the execution of your original\nDivorce Decree.\nResponse:\n15. Please state any instances where the Department of Human Resources has gotten involved in\na case regarding the Minor Children, what prompted the investigation, and the conclusion of\nthe DHR matter.\nResponse:\n16. Please list all social media accounts with names/handles/usernames (e.g. Facebook, Instagram,\nsnapchat).\nResponse:\n17. Are you aware that your answers to these interrogatories are made under oath, are continuing\nin nature, and may be used as material testimony at any and all proceedings?\nResponse:\n18. Please state each and every person who assisted you in answering these interrogatories and\nwhether you are aware that your answers to these interrogatories are given under oath.\nResponse:\nREQUESTS FOR PRODUCTION\nThe requested documents are to be produced and require the answering party to provide\ncopies and/or duplicates of the same to be served upon Barbara H. Agricola and Matthew A.\nHoldren, 127 South 8th Street, Opelika, Alabama 36801, within thirty (30) days of receipt of these\nrequests for production of documents, pursuant to Rule 34 of the Alabama Rules of Civil\nProcedure.\nThe requests for production shall be deemed continuous so as to require seasonable\nsupplemental answers if the Defendant obtains further information between the time of answering\nthese interrogatories and the time of the trial of this action. If such supplementation and/or changes\nbecome necessary, it is the responsibility of the answering party to take whatever action to provide\nsaid changes/supplementation to Agricola Law, LLC.\n1. Please provide documents or communications demonstrating the reasons for any denial of\nvisitation rights to Brittany Gilliland since February 27, 2024.\nResponse:\nBrittany Michelle Gilliland v. Christopher Blaine McGregor\nCircuit Court of Tallapoosa County\nCase No.: 70-DR-23-900051.00\nPetitioner’s First Set of Consolidated Discovery Requests\nPage 5 of 9\n2. Please provide all correspondence, emails, texts, and written notes between you and the\nchildren’s school or educational institutions regarding Brittany Gilliland.\nResponse:\n3. Please provide any recordings, videos, or other electronic evidence that demonstrates\ninteractions between you and the minor children wherein Brittany Gilliland was discussed.\nResponse:\n4. All documents evidencing payments made for child support, alimony, shared debts, and/or\nother financial obligations as ordered in the Final Decree of Divorce.\nResponse:\n5. Produce copies of all photos, videos, CDs or other evidence you have in this case, even if\nyou do not plan on using it at trial or any other proceeding of this action. This includes\nany rebuttal and/or impeachment evidence.\nResponse:\n6. Please provide photographic or video evidence of the condition and location of the disputed\npersonal property items that were to be distributed to Brittany Gilliland as per the divorce\ndecree.\nResponse:\n7. Please provide any and all bank statements, passbooks, certificates of deposit, or other\nwritten memoranda of any kind and description reflecting ownership by you in whole or in\npart, legal or equitable, of any savings account or bank account or account in any financial\ninstitution, including, but not limited to, savings and loan associations, credit unions, banks\nor accounts maintained with any brokerage firm from the last three years.\nResponse:\n8. Please provide any and all documentation to support your response to Interrogatory # 3,\nincluding any and all documents touching, concerning, or relating to your net worth,\nincluding, but not limited to, personal financial statement and loan applications filed with\nor provided to any person, corporation, business, financial institution, or government\nagency from January 1, 2019 to the date of trial.\nResponse:\nBrittany Michelle Gilliland v. Christopher Blaine McGregor\nCircuit Court of Tallapoosa County\nCase No.: 70-DR-23-900051.00\nPetitioner’s First Set of Consolidated Discovery Requests\nPage 6 of 9\nREQUESTS FOR ADMISSIONS\nThe requested responses are to be admitted or denied and shall be served upon Petitioner’s\nCounsel, Barbara H. Agricola and Matthew A. Holdren, 127 South 8th Street, Opelika, Alabama\n36801, within thirty (30) days of receipt of these requests for admissions, pursuant to Rule 36 of\nthe Alabama Rules of Civil Procedure.\nThe requests for admission shall be deemed continuous so as to require seasonable\nsupplemental answers if the Defendant obtains further information between the time of answering\nthese requests and the time of the trial of this action. If such supplementation and/or changes\nbecome necessary, it is the responsibility of the answering party to take whatever action to provide\nsaid changes/supplementation to Agricola Law, LLC.\n1. Admit that items belonging to Mother, and outlined in the original Divorce Decree,\nhave been purposefully withheld from her.\nAdmit Deny\n2. Admit that you have blocked Mother’s phone number in the past on Minor Children’s\nphones.\nAdmit Deny\n3. Admit that Mother has been excluded from relevant group communication pertaining\nto the Minor Children’s extra-curricular activities.\nAdmit Deny\n4. Admit that you have willfully interfered with Mother’s ability to attend extra-curricular\nand special events, for example, by either relaying incorrect information regarding said\nevents, or neglecting to inform Mother of said events in its entirety.\nAdmit Deny\n5. Admit that Minor Children have, on multiple occasions, shared the same bed as their\npaternal grandmother’s partner, who is not related to the Minor Children by blood or\nmarriage.\nAdmit Deny\n6. Admit that you have made derogatory comments about Mother in the presence of Minor\nChildren.\nAdmit Deny\nBrittany Michelle Gilliland v. Christopher Blaine McGregor\nCircuit Court of Tallapoosa County\nCase No.: 70-DR-23-900051.00\nPetitioner’s First Set of Consolidated Discovery Requests\nPage 7 of 9\n7. Admit that you have denied Brittany Gilliland her court-ordered visitation rights since\nFebruary 27, 2024.\nAdmit Deny\n8. Admit that you have intentionally provided misinformation to school officials\nregarding Brittany Gilliland's right to visit or pick up A.K. from school.\nAdmit Deny\n9. Admit that you have signed Brittany Gilliland’s name on any financial document or\ncheck without her authorization.\nAdmit Deny\n10. Admit that you have failed to distribute the personal property items as ordered in the\nFinal Decree of Divorce.\nAdmit Deny\n11. Admit that you have alienated the minor children against Brittany Gilliland through\nverbal comments and actions.\nAdmit Deny\n12. Admit that you have failed to consult with Brittany Gilliland on significant decisions\naffecting the children's health, education, and welfare.\nAdmit Deny\nRespectfully submitted on June 24, 2024.\n/s/ Barbara H. Agricola (AGR004)\n/s/ Matthew A. Holdren\nCounsel for Petitioner\nOF COUNSEL:\nAGRICOLA LAW\n127 South 8th Street\nOpelika, Alabama 36801\nBrittany Michelle Gilliland v. Christopher Blaine McGregor\nCircuit Court of Tallapoosa County\nCase No.: 70-DR-23-900051.00\nPetitioner’s First Set of Consolidated Discovery Requests\nPage 8 of 9\nTelephone: 334.759.7557\nFacsimile: 334.759.7558\nmatt@agricolalaw.com\nwww.agricolalaw.com\nCERTIFICATE OF SERVICE\nThis is to certify that I have this day served the following with a copy of the foregoing, by\nelectronic filing in the AlaCourt E-File System and/or by placing same in an envelope, properly\naddressed, and depositing it in the United States Mail, with adequate postage prepaid on June 24,\n2024.\nThomas Fredrick Young\nAttorney for Respondent\nP.O. Box 1160\nAlex City, Alabama 35011\ntyoung@mhhlaw.net\n/s/ Barbara H. Agricola\nOF COUNSEL\nBrittany Michelle Gilliland v. Christopher Blaine McGregor\nCircuit Court of Tallapoosa County\nCase No.: 70-DR-23-900051.00\nPetitioner’s First Set of Consolidated Discovery Requests\nPage 9 of 9",
  "source_metadata": {
    "method": "pdfplumber",
    "pages": 9
  },
  "modified_time": 1758997832.0
}