{
  "doc_id": "76be8b760a1558878cf36290e503bd07ff6011f7f167808976b6c1b7e64e6be5",
  "file_path": "C:\\Users\\blain\\Dropbox\\Master_Court_Files\\01_Orders\\Order for Holiday visitation 11.12.25.pdf",
  "file_name": "Order for Holiday visitation 11.12.25.pdf",
  "doc_type": "pdf",
  "date": null,
  "parties": [],
  "raw_text": "AlaFile E-Notice\n70-DR-2023-900051.01\nJudge: KEVIN HALL\nTo: DAVIS DIANNE JAMES\ndianne@diannedavislaw.com\nNOTICE OF COURT ACTION\nIN THE CIRCUIT COURT OF TALLAPOOSA COUNTY, ALABAMA\nCHRISTOPHER BLAINE MCGREGOR V. BRITTANY MICHELLE GILLILAND\n70-DR-2023-900051.01\nA court action was entered in the above case on 11/12/2025 10:52:48 AM\nORDER\n[Filer: ]\nDisposition: DENIED\nJudge: KMH\nNotice Date: 11/12/2025 10:52:48 AM\nPATRICK CRADDOCK\nCIRCUIT COURT CLERK\nTALLAPOOSA COUNTY, ALABAMA\n395 LEE STREET\nALEXANDER CITY, AL, 35010\n256-234-4361\npatrick.craddock@alacourt.gov\nDOCUMENT 429\nELECTRONICALLY FILED\n11/12/2025 10:52 AM\n70-DR-2023-900051.01\nCIRCUIT COURT OF\nTALLAPOOSA COUNTY, ALABAMA\nPATRICK CRADDOCK, CLERK\nIN THE CIRCUIT COURT OF TALLAPOOSA COUNTY, ALABAMA\nALEX CITY DIVISION\nMCGREGOR CHRISTOPHER BLAINE, )\nPlaintiff, )\n)\nV. ) Case No.: DR-2023-900051.01\n)\nGILLILAND BRITTANY MICHELLE, )\nDefendant. )\nORDER\nIt is well established law that both a parent and a child have a fundamental right\nto free association, care, and control with each other, provided the parent is a fitparent,\nand that right extends to reasonable rights of visitation for a non-custodial situation.\nSee, e.g., Watkins v. Lee, 227 So. 3d 84 (Ala. Civ. App. 2017); Ex parte E.R.G., 73 So. 3d 634\n(Ala. 2011). If a parent has not been previously found to be unfit, \"the law presumes\nthat it is in the best interest of a child to have complete and unrestricted association\nwith his or her parents.\" V.C. v. C.T., 976 So. 2d 465, 468 (Ala. Civ. App. 2007). A finding\nof parental unfitness must be explicit and supported by clear and convincing evidence.\nOf course, a simple determination of physical custody pursuant to a divorce does not\nequate to a finding of parental unfitness.\nIn this case, there are significant questions over where fault, if any, lies for\nvarious alleged non-conformity with the custodial order, as there are regarding therapy\nissues. The prior orders in this case did not address holiday visitation and do not\nappear to contemplate that this case would still be pending for a second holiday season.\nAllegations of personality conflicts, or even arguments, between the Mother, Father,\nand/or Child have not been proven to the point that they would effect the rights of\nDOCUMENT 429\nparenting, free association, or visitation, nor does the scant evidence provide a\nsufficient basis to deprive either parent of visitation during one of the child's last 4-5\nholidays as a minor, especially given the multiple continuances filed in this case.\nAccordingly, MOTION TO SET ASIDE ORDER GRANTING COURT-ORDERED\nHOLIDAY VISITATION filed by MCGREGOR CHRISTOPHER BLAINE is hereby\nDENIED.\nDONE this 12thday of November, 2025.\n/s/ KEVIN HALL\nCIRCUIT JUDGE",
  "source_metadata": {
    "method": "pdfplumber",
    "pages": 3
  },
  "modified_time": 1767901338.0
}