{
  "doc_id": "785908a03939977ead7d7da15c4cbd708a84df426ebf9464641c8d9121ee6a69",
  "file_path": "C:\\Users\\blain\\Dropbox\\Master_Court_Files\\19_Bankruptcy_Chapter_13\\McGregor_Bankruptcy_Stay_Violations_Memorandum_UPDATED.pdf",
  "file_name": "McGregor_Bankruptcy_Stay_Violations_Memorandum_UPDATED.pdf",
  "doc_type": "pdf",
  "date": null,
  "parties": [],
  "raw_text": "McGregor – Bankruptcy Stay Violations\nMemorandum (Updated)\nnn Between 11/21/2024 and 9/17/2025, Attorney Barbara H. Agricola filed TEN separate\npleadings and discovery actions in family court — all seeking to enforce equity/property debts,\nmodify support obligations, compel financial/property disclosures, or impose attorney’s fees on\nBlaine McGregor. Each of these actions was filed AFTER Blaine’s Chapter 13 bankruptcy\npetition on 9/20/2024 and each constitutes a willful violation of the automatic stay under 11\nU.S.C. §362(a).\n11/21/2024 – Renewed Motion for Pendente Lite Relief\n(cid:127) Key Allegation: Blaine filed bankruptcy 'to avoid his required $2,000 equity payment.'\n(cid:127) Relief Requested: Contempt finding; pause Brittany’s support obligation; attorney’s fees.\n(cid:127) Quote: 'Father filed for bankruptcy in an effort to avoid his required $2,000.00 a month equity payment\nto Mother… child support is due to be paused until Father resumes his equity payments.'\n(cid:127) Stay Violation: Direct attempt to enforce equity installments and seek fees.\n12/20/2024 – Motion to Modify Child Support (Contempt in Nonpayment)\n(cid:127) Key Allegation: Blaine filed Ch. 13 and stopped paying $2,000 equity.\n(cid:127) Relief Requested: Suspend or recalc Brittany’s support obligation; attorney’s fees.\n(cid:127) Quote: 'Respondent informed Petitioner he would no longer pay her equity payments as ordered…\nPetitioner has incurred attorney’s fees due solely to Respondent’s actions.'\n(cid:127) Stay Violation: Uses bankruptcy-protected equity to attempt support modification and fee-shifting.\n12/20/2024 – Contempt Nonpayment Petition\n(cid:127) Key Allegation: Blaine failed to pay equity installments.\n(cid:127) Relief Requested: Contempt finding and sanctions.\n(cid:127) Quote: 'Respondent is in willful contempt for failing to make the $2,000.00 monthly equity payments\nas ordered.'\n(cid:127) Stay Violation: Classic contempt action to collect a property-division debt during bankruptcy.\n12/20/2024 – Reply re Guardian ad Litem\n(cid:127) Key Allegation: Blaine filed bankruptcy and is no longer paying $2,000 equity.\n(cid:127) Relief Requested: Appointment of GAL; costs split.\n(cid:127) Quote: 'Respondent has recently filed for bankruptcy and is no longer paying Petitioner the $2,000.00\na month she is owed…'\n(cid:127) Stay Violation: Improper use of bankruptcy-protected debt in unrelated GAL litigation.\n6/18/2025 – Court Order\n(cid:127) Key Allegation: Agricola pressed support modification despite bankruptcy.\n(cid:127) Court’s Note: Modification held until final hearing.\n(cid:127) Quote: 'Modification of child support is held pending final hearing. The Father is expected and remains\nordered to comply with custody and visitation.'\n(cid:127) Stay Violation: Confirms active litigation over bankruptcy-protected equity.\n7/24/2025 – Court Order\n(cid:127) Key Allegation: Contempt/support issues still being pressed.\n(cid:127) Court’s Note: Contempt to be addressed at final hearing.\n(cid:127) Quote: 'Issues of contempt, failure/refusal in the past, etc., will be addressed at final hearing.'\n(cid:127) Stay Violation: Confirms continued enforcement proceedings during Ch. 13.\n9/3/2025 – Discovery Deficiency Letter\n(cid:127) Key Allegation: Discovery 'deficient.'\n(cid:127) Relief Requested: Supplement property list + bank records.\n(cid:127) Quote: 'Please provide a detailed list of the personal property items… including wall décor, bedroom\nlamps, memory boxes, and clothing. Your client is currently in a bankruptcy action…'\n(cid:127) Stay Violation: Compels property inventory & financial disclosures outside bankruptcy.\n9/15/2025 – Discovery Requests\n(cid:127) Key Allegation: Blaine must produce financial/property docs.\n(cid:127) Relief Requested: Tax returns, income, car loan payoff, support records.\n(cid:127) Quote: 'Provide statements for each and every car payment… and state if the debt accrued was paid\noff in full as of March 1, 2024.'\n(cid:127) Stay Violation: Misstates decree; demands bankruptcy-governed disclosures.\n9/16/2025 – Motion to Compel\n(cid:127) Key Allegation: Blaine failed to comply with discovery.\n(cid:127) Relief Requested: Compel responses; attorney’s fees.\n(cid:127) Quote: 'Petitioner avers that she has been forced to incur attorney’s fees and costs… Respondent be\nordered to reimburse Petitioner.'\n(cid:127) Stay Violation: Attempts to impose monetary sanctions during bankruptcy.\n9/17/2025 – Objection to Motion to Reduce Time to Submit Discovery\nResponses\n(cid:127) Key Allegation: Blaine sought to shorten discovery deadlines; Agricola opposed.\n(cid:127) Relief Requested: Deny Blaine’s motion; order Blaine to pay Brittany’s attorney’s fees.\n(cid:127) Quote: 'Petitioner has incurred significant attorney’s fees as a result of having to file this objection…\nPetitioner prays this Honorable Court DENY Respondent’s Motion… and ORDER Respondent to pay\nPetitioner’s attorney’s fees.'\n(cid:127) Stay Violation: Again demands attorney’s fees against a bankruptcy debtor — barred by §362(a)(1)\nand §362(a)(6).\nLegal Authority\n(cid:127) 11 U.S.C. §362(a) – Automatic stay prohibits collection, enforcement, discovery of estate property.\n(cid:127) 11 U.S.C. §362(k) – Debtor entitled to actual damages, attorney’s fees, and punitive damages for\nwillful violations.\n(cid:127) In re McLean, 794 F.3d 1313 (11th Cir. 2015) – Willful stay violations include legal actions to enforce\nprepetition debts.\n(cid:127) Taggart v. Lorenzen, 139 S. Ct. 1795 (2019) – Sanctions appropriate when there is no 'fair ground of\ndoubt.'\n(cid:127) In re Roche, 361 B.R. 615 (Bankr. N.D. Ga. 2005) – Discovery requests for financial records during\nbankruptcy = stay violation.\nProfessional Ethics Violations\nAgricola’s conduct also violates Alabama Rules of Professional Conduct:\n(cid:127) Rule 3.1 – Meritorious Claims and Contentions: Filed motions with no legal basis post-bankruptcy.\n(cid:127) Rule 3.4(c) – Fairness to Opposing Party: Knowingly disobeyed binding federal law (the automatic\nstay).\n(cid:127) Rule 8.4(d) – Misconduct: Engaged in conduct prejudicial to the administration of justice by repeatedly\npressing stay-violating claims.\nDamages\nBased on the billing statement from Dianne Davis, P.C. (9/17/25):\n(cid:127) Attorney’s Fees Paid: » $9,544.00\n(cid:127) Outstanding Balance: $2,940.88\n(cid:127) Grand Total Damages: $12,485.00\nQuote from billing: 'Court Preparation, 6 @ $300.00 = $1,800.00… Deposition Prep, 2 @ $300.00 =\n$600.00.'\nThese costs are actual damages caused by Agricola’s repeated stay violations and are recoverable\nunder §362(k).\nConclusion\nFrom 11/21/24 through 9/17/25, Agricola filed ten pleadings and discovery actions in family court that\nsought to enforce equity/property debts, modify child support, compel financial/property disclosures,\nand demand attorney’s fees. Each constitutes a willful violation of the automatic stay. The pattern is\ndeliberate, repeated, and in bad faith.\nRelief requested:\n(cid:127) Actual damages ($12,485 in attorney’s fees).\n(cid:127) Sanctions against Brittany and her counsel.\n(cid:127) Punitive damages for repeated misconduct.\n(cid:127) Referral to Alabama State Bar for professional ethics violations.",
  "source_metadata": {
    "method": "pdfplumber",
    "pages": 6
  },
  "modified_time": 1759009401.0
}