{
  "doc_id": "7bcac31483246c4f945b6a0dd78c0fffa20242f3747b76d01340fc36c1d17321",
  "file_path": "C:\\Users\\blain\\Dropbox\\Master_Court_Files\\03_Pleadings\\2025-07-30_Discovery_Responses_From_Blaine.pdf",
  "file_name": "2025-07-30_Discovery_Responses_From_Blaine.pdf",
  "doc_type": "pdf",
  "date": null,
  "parties": [],
  "raw_text": "IN THE CIRCUIT COURT OF TALLAPOOSA COUNTY, ALABAMA\nALEXANDER CITY DIVISION\nCHRISTOPHER BLAINE MCGREGOR,)\nPlaintiff, )\n)\nv. ) CASE NO.: 70-DR-2023-900051.01\n)\nBRITTANY MICHELLE GILLILAND, )\nDefendant. )\nPLAINTIFF’S RESPONSES TO DEFENDANTS’ DISCOVERY\nCOMES NOW Christopher Blaine McGregor, the Plaintiff in the above-styled cause, by\nand through his attorney of record, Tom F. Young, Jr., and responds to the Interrogatories and\nrequest for Production as follows:\nINTERROGATORIES\n1. Describe in detail each instance since February 27, 2024, in which you did not allow the\nPetitioner-Mother, Brittany Michelle Gilliland, her scheduled visitation rights with the\nminor children A.K. and B.M.\nResponse: I have never refused Brittany her scheduled visitation rights with either\nminor child.\n2. List all communications you have had with the children's school or educational institution\nconcerning Brittany Gilliland and provide the content of such communications.\nResponse: See attached email exchanges from Blaine to staff at L. Morgan and ME\nWalker.\n3. Please detail any reasons and the factual basis for why you prevented Brittany Gilliland\nfrom picking up A.K. from school as stipulated in the Final Decree of Divorce.\nResponse: I have never prevented Brittany from picking up A.K. from school.\n4. Please describe any instances where you have accused Brittany Gilliland of mental\ninstability or suggested to any individual, including the minor children, that she is\nmentally unstable.\nResponse: I cannot recall.\n5. State the name and address of all persons having substantive knowledge relating to this\nmatter and identify whether or not you intend to use those persons at any proceeding in\nthis matter as witnesses or as an expert witness, including to what you expect each\nwitness will testify and if as an expert witness, list the expert’s name, address, the subject\nmatter of the testimony on which the expert is expected to testify, the substance of facts\nand opinions to which the expert is expected to testify, and a summary of the grounds for\neach opinion offered.\nResponse: Will Davis – DARE/School Resource Office\nDeidre Leslie – Tri-County Children Advocacy Center / A.K. Counselor\nPayton East – DHR case worker\nAdeline Kate McGregor – Daughter\nLisa McGregor – Mother\nBrian McGregor – Brother\nKatie McGregor – Sister-in-law\n6. List in detail all documents and other physical evidence which you may use in\npreparation or at any of the proceedings of this cause including any pictures of an explicit\nnature or otherwise, regardless of whether you intend to use it at the trial in this action.\nThis includes anything related to rebuttal or impeachment.\nResponse: Pictures attached.\n7. Please state all facts that support your accusations made against Brittany Gilliland of\ncausing physical harm to A.K. or any of the minor children.\nResponse: Objection. Irrelevant as to issues in Petition.\n8. If you have conducted any surveillance, including but not limited to electronic\nsurveillance (electronic surveillance being defined as the interception of any voice\ncommunication made by the Petitioner by electronically recording the same or by\nlistening in on any voice communication made by the Petitioner), of the Petitioner, or had\nany person or persons conduct such surveillance on your behalf, then state what\nsurveillance you have conducted, including the date, time and place of such surveillance,\nthe method employed for such surveillance, the person conducting such surveillance,\nincluding the name and address of such person, whether said surveillance was recorded,\nwhether a written transcript or report have been made of such surveillance, and the details\nof what was observed and/or the details of the conversations that were intercepted or\nrecorded, regardless of whether you intend to use such documentation at trial. This\nincludes anything related to rebuttal or impeachment.\nResponse: I do not have surveillance.\n9. Please state all facts that support your accusations made against Brittany Gilliland for\nviolating the divorce decree.\n2\nResponse: Brittany has violated divorce decree by being late on CS payment.\nPicking and choosing when she wants to pick up AK from school and not\nfollowing Court Order.\nRefuses to reimburse 50% of all medical expenses for children.\nHarassing me and the children by calling up to 150 times a month.\nBrittany makes negative remarks regarding the divorce on Facebook.\nBrittany harasses by family. One example is calling my sister-in-law,\nKatie, a fat bitch. This was at the front entrance of Wal-Mart and Bennett\nwas in Brittany’s care. Katie pressed charges and awaiting on court date.\n10. Please provide a detailed list of the personal property items you have failed to distribute\nto Brittany Gilliland per the Final Decree of Divorce, including but not limited to wall\ndécor, bedroom lamps, memory boxes, and clothing.\nResponse: Brittany was given all property items set out in the Final Order, plus more.\nHer friend, Jeannie Hamlet, came to the house and removed everything\nthat Brittany was entitled to have plus items that were not granted to her.\n11. Please explain any instances in which you have signed Brittany Gilliland’s name on\nfinancial documents or checks without her express authorization. Provide dates and\ndetails of the documents.\nResponse: I have not signed her name to anything.\n12. Please state what positive and negative qualities you feel the Petitioner has as a parent.\nResponse: I cannot think of anything positive at this time. Brittany’s negative\nqualities are being unreliable, having no stability, and she is a constant liar.\n13. Please state the last-known date that A.K., a Minor Child, engaged in visitation with\nMother, pursuant to the original Divorce Decree. Please provide explanations for specific\ninstances where Mother was denied visitation, if there are such instances.\nResponse: The last known date that AK had court ordered visitation with her mother\nwas on May 12, 2024, for Mother’s Day. I met Brittany at the ACPD to do\ncustody exchange and Lt. Sheronda Cross forced AK out of my care into\nBrittany’s car. I have never refused to allow AK to visit with her mother.\n14. Please state whether you have paid Mother her required equity payments owed on your\nprior marital residence, the amount paid, and which dates, since the execution of your\noriginal Divorce Decree.\n3\nResponse: March 7, 2024 - $10,000\nApril 18, 2024 - $2,000\nMay 16, 2024 - $2,000\nJune 19, 2024 - $2,000\nJuly 25, 2024 - $2,000\nSee attachments.\n15. Please state any instances where the Department of Human Resources has gotten involved\nin a case regarding Minor Children, what prompted the investigation, and the conclusion\nof the DHR matter.\nResponse: December 23, 2023 – DHR called me to bring the kids into the\noffice for questions. Someone reported to DHR the events that were called\nout during our divorce trial.\nMarch 15, 2023 – DHR showed up to my house. AK started seeing a new\ncounselor, therefore counselor needed to self-report to DHR. I informed\nBrittany via text that DHR was at the house and why.\nApril 1, 2024 – DHR called to inform me that they had received a call and\nwas going to the school to talk to AK. A teacher had noticed bruising on\nAK’s arm that resembled fingers/hands. After speaking to AK, DHR\ncame to my house. While talking to AK, she described the incident between\nher and her mother that occurred on Easter morning. AK said her mother\ngrabbed her and lift bruising on her arms. A police report was filed on\nEaster regarding this incident.\n16. Please list all social media accounts with names/handles/usernames (e.g. Facebook,\nInstagram, snapchat).\nResponse: Facebook – Blaine McGregor; Instagram – Blaine0256; TikTok –\nBlainemcgregor.\nAre you aware that your answers to these interrogatories are made under oath, are\ncontinuing in nature, and may be used as material testimony at any and all proceedings?\nResponse: Yes.\n17. Please state each and every person who assisted you in answering these interrogatories\nand whether you are aware that your answers to these interrogatories are given under\noath.\nResponse: No one.\n4\nREQUEST FOR PRODUCTION\n1. Please provide documents or communications demonstrating the reasons for any\ndenial of visitation rights to Brittany Gilliland since February 27, 2024.\nResponse: None.\n2. Please provide all correspondence, emails, texts, and written notes between you and the\nchildren’s school or educational institutions regarding Brittany Gilliland.\nResponse: See attached\n3. Please provide any recordings, videos, or other electronic evidence that demonstrates\ninteractions between you and the minor children wherein Brittany Gilliland was\ndiscussed.\nResponse: None\n4. All documents evidencing payments made for child support, alimony, shared debts,\nand/or other financial obligations as ordered in the Final Decree of Divorce.\nResponse: See Attached\n5. Produce copies of all photos, videos, CDs or other evidence you have in this case, even if\nyou do not plan on using it at trial or any other proceeding of this action. This includes any\nrebuttal and/or impeachment evidence.\nResponse: Objection. Rebuttal/impeachment witnesses cannot be determined at this\ntime.\n6. Please provide photographic or video evidence of the condition and location of the\ndisputed personal property items that were to be distributed to Brittany Gilliland as per\nthe divorce decree.\nResponse: I am unaware of any disputed property.\n7. Please provide any and all bank statements, passbooks, certificates of deposit, or other\nwritten memoranda of any kind and description reflecting ownership by you in whole or\nin part, legal or equitable, of any savings account or bank account or account in any\nfinancial institution, including, but not limited to, savings and loan associations, credit\nunions, banks or accounts maintained with any brokerage firm from the last three years.\nResponse: Objection. Irrelevant as to issues in Petition.\n5\n8. Please provide any and all documentation to support your response to Interrogatory # 3,\nincluding any and all documents touching, concerning, or relating to your net worth,\nincluding, but not limited to, personal financial statement and loan applications filed with\nor provided to any person, corporation, business, financial institution, or government\nagency from January 1, 2019, to the date of trial.\nResponse: Objection. Financial records have no relevance to the issue in\nInterrogatory #3.\nRespectfully submitted this the 30th day of July 2024.\n/s/ Tom F. Young, Jr.\nTOM F. YOUNG, JR. (YOU009)\nAttorney for Plaintiff\nOF COUNSEL:\nMORRIS HAYNES LAW FIRM\n131 Main Street\nP.O. Box 1660\nAlexander City, AL 35010\n(256) 329-2000\n(256) 329-2015\ntyoung@mhhlaw.net\nCertificate of Service\nI hereby certify that I have served a copy of the foregoing upon the following via electronic\nfiling with the AlaCourt E-File System and/or by placing a copy of the same, properly addressed\nand postage paid in the U.S. Mail on this the 30th day of July 2024.\n/s/ Tom F. Young, Jr.\nOf Counsel\n6",
  "source_metadata": {
    "method": "pdfplumber",
    "pages": 6
  },
  "modified_time": 1758998331.0
}