{
  "doc_id": "7c9ee4fff3d690efb893895136f925c4dc567efee4f25f6540eb5ef753528ef7",
  "file_path": "C:\\Users\\blain\\Dropbox\\Master_Court_Files\\14_Discovery\\2025-09-03_Discovery_Deficiency_Letter_FROM_BRITTANY.pdf",
  "file_name": "2025-09-03_Discovery_Deficiency_Letter_FROM_BRITTANY.pdf",
  "doc_type": "pdf",
  "date": null,
  "parties": [],
  "raw_text": "Barbara H. Agricola* Algert S. Agricola, Jr.\nbarbara@agricolalaw.com al@agricolalaw.com\n*Also admitted in Georgia\nSeptember 4, 2025\nVia Electronic Mail\nDianne Davis\ndianne@diannedavislaw.com\nRE: McGregor v. Gilliland\nCase No: 70-DR-2023-900051.01\nOur File No.: 300.036\nDear Dianne:\nI have reviewed your client’s discovery responses submitted July 30, 2024. After reviewing\nthe discovery responses, there are still several responses that were either deficient, nonresponsive,\nand/or incomplete. I have attached our client’s initial discovery requests for your convenience. The\nfollowing discovery responses are deficient and/or incomplete for the following reasons:\nInterrogatories:\n1. Describe in detail each instance since February 27, 2024, in which you did not allow the Petitioner-\nMother, Brittany Michelle Gilliland, her scheduled visitation rights with the minor children A.K.\nand B.M.\nResponse: I have never refused Brittany her scheduled visitation rights with either\nminor child.\nThis response was submitted July 30, 2024. There is sufficient reason to believe that this response\nis not up to date. Due to the outdated nature of this response, please supplement this interrogatory\nwith an accurate and current response as discovery is ongoing and continuing in nature.\n2. List all communications you have had with the children's school or educational institution\nconcerning Brittany Gilliland and provide the content of such communications.\nResponse: See attached email exchanges from Blaine to staff at L. Morgan and ME\nWalker.\nThis response was submitted July 30, 2024. There is sufficient reason to believe that this response\nis not up to date. Due to the outdated nature of this response, please supplement this interrogatory\nwith an accurate and current response as discovery is ongoing and continuing in nature. Please\nsupplement this interrogatory with any further communications you have held since the original\ndate of your response, including any and all schools the children have attended.\n127 South 8th Street Opelika, Alabama 36801 Phone: 334.759.7557 Facsimile: 334.759.7558\nwww.agricolalaw.com\n3. Please detail any reasons and the factual basis for why you prevented Brittany Gilliland from\npicking up A.K. from school as stipulated in the Final Decree of Divorce.\nResponse: I have never prevented Brittany from picking up A.K. from school.\nThis response was submitted July 30, 2024. There is sufficient reason to believe that this response\nis not up to date. Due to the outdated nature of this response, please supplement this interrogatory\nwith an accurate and current response as discovery is ongoing and continuing in nature.\n7. Please state all facts that support your accusations made against Brittany Gilliland of causing\nphysical harm to A.K. or any of the minor children.\nResponse: Objection. Irrelevant as to issues in Petition.\nYour client must state all facts that support his accusations made against Brittany Gilliland of\ncausing physical harm to A.K. or any of the minor children. This response is not acceptable as it\nis presented and is therefore, deficient. Please supplement this interrogatory.\n8. If you have conducted any surveillance, including but not limited to electronic surveillance\n(electronic surveillance being defined as the interception of any voice communication made by the\nPetitioner by electronically recording the same or by listening in on any voice communication\nmade by the Petitioner), of the Petitioner, or had any person or persons conduct such surveillance\non your behalf, then state what surveillance you have conducted, including the date, time and place\nof such surveillance, the method employed for such surveillance, the person conducting such\nsurveillance, including the name and address of such person, whether said surveillance was\nrecorded, whether a written transcript or report have been made of such surveillance, and the\ndetails of what was observed and/or the details of the conversations that were intercepted or\nrecorded, regardless of whether you intend to use such documentation at trial. This includes\nanything related to rebuttal or impeachment.\nResponse: I do not have surveillance.\nThis response was submitted July 30, 2024. There is sufficient reason to believe that this response\nis not up to date. Due to the outdated nature of this response, please supplement this interrogatory\nwith an accurate and current response as discovery is ongoing and continuing in nature.\n10. Please provide a detailed list of the personal property items you have failed to distribute to\nBrittany Gilliland per the Final Decree of Divorce, including but not limited to wall décor,\nbedroom lamps, memory boxes, and clothing.\nResponse: Brittany was given all property items set out in the Final Order, plus more.\nHer friend, Jeannie Hamlet, came to the house and removed everything\nthat Brittany was entitled to have plus items that were not granted to her.\nYour client must list each and every item of personal property in detail that has or has not been\ngiven to our client. This response is not acceptable as it is presented and is therefore, deficient.\nPlease supplement this interrogatory.\n13. Please state the last-known date that A.K., a Minor Child, engaged in visitation with Mother,\npursuant to the original Divorce Decree. Please provide explanations for specific instances where\nMother was denied visitation, if there are such instances.\nResponse: The last known date that AK had court ordered visitation with her mother\nwas on May 12, 2024, for Mother’s Day. I met Brittany at the ACPD to do\ncustody exchange and Lt. Sheronda Cross forced AK out of my care into\nBrittany’s car. I have never refused to allow AK to visit with her mother.\nThis response was submitted July 30, 2024. There is sufficient reason to believe that this response\nis not up to date. Due to the outdated nature of this response, please supplement this interrogatory\nwith an accurate and current response as discovery is ongoing and continuing in nature.\nRequests for Production:\n1. Please provide documents or communications demonstrating the reasons for any denial of\nvisitation rights to Brittany Gilliland since February 27, 2024.\nResponse: None.\nYour client has communicated extensively regarding our client’s visitation and the denial of such.\nDue to the outdated nature of this response, please supplement this interrogatory with an accurate\nand current response as discovery is ongoing and continuing in nature. This includes any\ncorrespondence between the parties, or between your client and another party.\n2. Please provide all correspondence, emails, texts, and written notes between you and the children’s\nschool or educational institutions regarding Brittany Gilliland.\nResponse: See attached\nThis response was submitted July 30, 2024. There is sufficient reason to believe that this response\nis not up to date. Due to the outdated nature of this response, please supplement this interrogatory\nwith an accurate and current response as discovery is ongoing and continuing in nature.\n3. Please provide any recordings, videos, or other electronic evidence that demonstrates interactions\nbetween you and the minor children wherein Brittany Gilliland was discussed.\nResponse: None\nYour client has recorded and documented several interactions between himself and the Minor\nChildren in relation to our client. Due to the outdated nature of this response, please supplement\nthis interrogatory with an accurate and current response as discovery is ongoing and continuing in\nnature. This includes any correspondence between the parties, the minor children, or other parties\nwhom your client has discussed these interactions with.\n5. Produce copies of all photos, videos, CDs or other evidence you have in this case, even if you do\nnot plan on using it at trial or any other proceeding of this action. This includes any rebuttal and/or\nimpeachment evidence.\nResponse: Objection. Rebuttal/impeachment witnesses cannot be determined at this\ntime.\nYour client must produce copies of all photos, videos, CDs or other evidence you have in this case,\neven if you do not plan on using it at trial or any other proceeding of this action. This includes any\nrebuttal and/or impeachment evidence. This response is not acceptable as it is presented and is\ntherefore, deficient. Please supplement this interrogatory.\n7. Please provide any and all bank statements, passbooks, certificates of deposit, or other written\nmemoranda of any kind and description reflecting ownership by you in whole or in part, legal or\nequitable, of any savings account or bank account or account in any financial institution, including,\nbut not limited to, savings and loan associations, credit unions, banks or accounts maintained with\nany brokerage firm from the last three years.\nResponse: Objection. Irrelevant as to issues in Petition.\nYour client objects to this request for production due to a lack of relevance to our client’s Petition.\nBoth Parties have stated on multiple occasion that finances are a paramount issue in this contempt\naction. Your client is currently in a bankruptcy action that directly impacts Petitioner. Furthermore,\ndue to a change in circumstances, child support is due to be recalculated. This response is deficient.\nPlease provide a sufficient answer to this request.\nPlease supplement all deficient requests no later than September 11, 2025. Should you\nhave any questions, please do not hesitate to contact me at 334.759.7557, or by email at\nbarbara@agricolalaw.com. Thank you.\nVery truly yours,\nBarbara H. Agricola\nBAP/ab",
  "source_metadata": {
    "method": "pdfplumber",
    "pages": 4
  },
  "modified_time": 1759000417.0
}