{
  "doc_id": "7ce9add536a2be7f6fbcce930729caacd31af1696712e8f5ea8b6e06ea3fc5a1",
  "file_path": "C:\\Users\\blain\\Dropbox\\Master_Court_Files\\20_Jan_Contempt_Info\\Response 1.docx",
  "file_name": "Response 1.docx",
  "doc_type": "docx",
  "date": null,
  "parties": [],
  "raw_text": "Affidavit of Christopher Blaine McGregor\nI, Christopher Blaine McGregor, being duly sworn, depose and state the following facts in response to Brittany Gilliland’s Objection to Motion to Set Aside Court-Ordered Holiday Visitation filed November 6, 2025. All statements are based on my personal knowledge, and each is supported by documented evidence as noted.\nMother’s Missed and Disrupted Reunification Dinners\nJanuary 10, 2025 – Mother Fails to Attend Rescheduled Dinner: On January 8, 2025, Brittany asked to move our court-ordered Wednesday family dinner to that weekend due to her work travel. I agreed to a Saturday breakfast on January 10. Brittany did not confirm the plan until late Friday evening and then insisted on an earlier time (7:00–7:30 AM) despite my having already agreed to 9:00 AM. I still brought our children to the restaurant at 9:00 AM on January 10 as arranged, but Brittany never showed up (Exhibit A)[1][2].\nFebruary 5, 2025 – Mother Cancels and Rejects Scheduled Dinner: Brittany informed me on February 5 that she “can’t do dinner tonight” (the Wednesday dinner) due to working late, and asked to reschedule to Thursday. I reminded her that the weekly dinner was court-ordered for Wednesdays (unless our daughter had a conflict) and that in the past, when I accommodated her schedule changes, she later accused me of “missing” the dinner. In fact, after I previously rescheduled a dinner for her convenience, Brittany’s attorney emailed my attorney claiming I failed to attend the dinner. To avoid further false allegations, I told Brittany we needed to stick to the court order schedule. Brittany did not attend the February 5 dinner at all (Exhibit B).\nFebruary 12, 2025 – Mother No-Shows and Demands Make-Up: On February 12, 2025, Brittany again did not appear for the scheduled weekly dinner. I waited with the children for 30 minutes with no word from her. The next day, rather than apologizing, Brittany sent messages accusing me of “refusing” to do a make-up dinner. She cited the order’s make-up provision and demanded we meet Thursday or Sunday, even though it was her failure to attend Wednesday that caused the issue[3][4]. I had received no notice from her on February 12; a simple text from Brittany that she couldn’t make it would have allowed me to rearrange plans. Instead, she threatened to hold me in contempt for not immediately agreeing to her last-minute demands (Exhibit C).\nApril 20, 2025 (Easter) – Mother Misses Holiday Dinner: Easter Sunday 2025 was scheduled as a family dinner per the reunification plan. Brittany did not attend the Easter dinner or otherwise spend the holiday with our daughter, A.K. Instead, she briefly stopped by only to drop off an Easter basket for A.K. while returning our son, B.M., that day. Brittany made no further effort to see A.K. on Easter (Exhibit D).\nMay 11, 2025 (Mother’s Day) – Father Facilitates, Mother Fails to Engage: Although May 11 was Mother’s Day, Brittany did not plan the usual weekly dinner with A.K. I proactively offered to have a dinner that day so Brittany could spend time with A.K., and I helped both children make Mother’s Day gifts for her. Brittany came only to pick up our son B.M. from my house; I even had A.K. go to Brittany’s car to hand her the gifts and say “Happy Mother’s Day.” Brittany did not stay to have the dinner with A.K. that evening and instead left with B.M. (returning him an hour late that night). She again missed the opportunity to have any extended visit with our daughter (Exhibit E).\nMultiple Summer 2025 Dinners – Ongoing No-Shows: Throughout June–August 2025, Brittany consistently failed to attend the weekly Sunday evening dinners that the Court ordered as part of reunification. For example, on June 1, 2025, Brittany never attempted to plan that Sunday’s dinner until 4:52 PM that day, when she sent a last-minute text asking “about Sunday Dinner.” I immediately called her and even offered to meet her with A.K. that evening, but Brittany would not answer or follow up, so no dinner occurred. On June 22, 2025, she skipped dinner, later saying she had a work event (an MLM conference) that day. She did not contact me to reschedule. On June 29, 2025, Brittany again made no attempt to arrange the dinner.\nJuly 2025 Dinners – Mother’s Cancellations: In early July, Brittany effectively canceled multiple dinners by telling me in advance that she “won’t be able to do dinners until I get back to work next week”. For both the July 6 and July 13, 2025 dinner dates, Brittany sent messages indicating she would not attend at all due to her work situation. On July 20, 2025, she initially asked to meet the children at a movie theater for that week’s visit. However, shortly after the outing began, Brittany ended the visit, claiming their infant (from her new marriage) was fussy and that she “couldn’t drive after dark.” The planned family dinner that day was cut short because Brittany left early and would not stay into the evening.\nAugust 2025 Dinners – Continued No-Shows: Brittany’s pattern continued into August. On August 3, 2025, I repeatedly asked Brittany (starting Friday, and again Saturday and Sunday morning) about her plans for the Sunday dinner. She ignored all messages until mid-afternoon Sunday, then gave a one-word reply (“What time”) but ultimately never showed up to meet us that day (Exhibit F). The following week, August 10, 2025, we agreed to meet at our usual restaurant (“Who’s”) at 1:30 PM. I arrived with the children and waited, but Brittany never arrived for that meal. On August 17, 2025, Brittany flatly refused to come to our city (Alexander City) for the dinner as required – instead she told me that if we wanted to see her, we would have to meet her at a restaurant off exit 208 in Clanton (near her residence). I declined to uproot the children for an unplanned road trip, and Brittany consequently did not see A.K. that day. On August 24, 2025, Brittany again did not come for the scheduled dinner, later citing that she had to care for her stepdaughters that day. In sum, Brittany missed or disrupted well over half of the weekly reunification dinners in 2025. This consistent pattern is documented in text messages and my notes (Exhibit F). Despite Brittany’s claims of wanting more contact, she frequently failed to appear for the very visits designed to rebuild her relationship with our daughter.\nFather’s Efforts to Facilitate Visitation and Holiday Compliance\nAlways Offering and Encouraging Contact: I have made consistent good-faith efforts to facilitate Brittany’s visitation with the children, including holiday times. Even as Brittany missed many dinners, I remained ready and available each week. Every Sunday from 1:00–6:00 PM (once the dinners were moved to Sundays), I kept the time open and the children prepared, not knowing if Brittany would show up. I often found myself waiting on Brittany “all day on Sundays” with no ability to make other plans, because she might or might not arrive[5]. I communicated to her that it was unfair for me and the children to be left in limbo, yet I still dutifully waited each scheduled visit in case she came. When Brittany did ask for adjustments, I tried to accommodate when reasonable – for instance, I agreed to her requests to reschedule dinners (like the January 10, 2025 breakfast) and only insisted on sticking to the court schedule after she began to misuse those accommodations against me in court.\nFacilitating Mother’s Day and Special Occasions: On Mother’s Day 2025, I went out of my way to include Brittany despite A.K.’s hesitance. I invited Brittany to have the Mother’s Day dinner with our daughter (even though it was not a regular visitation day) and prepared gifts from the children for her. When Brittany only came to pick up our son, I personally brought A.K. to Brittany so they could have at least a brief interaction (Exhibit E). I did this to support Brittany’s role as their mother and encourage our daughter’s relationship with her. Likewise, for Easter 2025 I had A.K. available and willing to see Brittany, but Brittany chose not to come to the Easter gathering.\nAccommodating Summer Visitation Schedules: I also cooperated with adjustments to Brittany’s summer holiday visitation with our son, B.M. At the beginning of Summer 2025, I proactively offered Brittany an extra week with B.M. since I had a work trip, even though that week was not hers per the original schedule. Initially, Brittany declined my offer and said she would “follow the order,” so I rearranged my work obligations to honor the set schedule. However, Brittany then changed her mind and decided she wanted B.M. during that week after all. Despite the inconvenience and lack of notice, I allowed B.M. to stay with his mother for those days. Our attorneys documented this agreement on June 2, 2025: “Even though there was no agreement for Brittany to keep Bennett this week… Bennett can stay and return home at 5:00 pm on Friday June 5th” (Exhibit G). \nInconsistencies in Mother’s Claims vs. Documented Facts\nClaim of “Missed” Dinners vs. Brittany’s No-Shows: Brittany’s Objection suggests that I have been the obstacle to her visiting A.K., but the record shows the contrary. She has claimed that I “refused” or failed to facilitate the weekly dinners, when in truth it was Brittany who often did not attend or who canceled at the last minute. For instance, Brittany once alleged through her attorney that I had missed a dinner that she had asked to reschedule. In a February 5, 2025 email, Brittany’s counsel accused me of not showing up, even though that dinner had been moved (at Brittany’s request) and Brittany then failed to come on the new date. This is why I insisted thereafter on sticking strictly to the schedule – to prevent such misrepresentations. Likewise, after Brittany missed the February 12, 2025 dinner, she immediately asserted that I was not permitting a makeup dinner and threatened me with contempt[4]. In reality, I had been waiting for her at the scheduled time and she never arrived[3]. These documents demonstrate that Brittany has misstated the situation in an attempt to blame me for visits that she herself chose to forego.\nClaim of “No Communication” vs. Evidence of My Attempts: Brittany has suggested that dinners did not happen because I failed to communicate or plan them. This is flatly contradicted by our text message exchanges. As one example, on September 14, 2025, I texted Brittany that morning asking if she would be coming to the scheduled dinner and to let me know what time to expect her. I received no response. When she later claimed “nothing was planned for dinner” and that I “never communicated plans,” I pointed out to her (via text) that the dinner time was already set by court order (1:00–6:00 PM on Sundays) and that I had in fact asked her earlier that day about her plans, with no reply from her. Faced with this, Brittany had no answer except to change the subject. This pattern has repeated itself: I frequently reached out or waited for her input, and Brittany would ignore me until it was too late or simply not show up. Her claims of lack of communication on my part are disproven by the written record (Exhibit H).\nClaims Regarding Holiday Visitation and A.K.’s Refusal: In her Objection, Brittany opposes my request to set aside certain holiday visitation requirements, implying there is no justification for A.K. not to be forced to attend. This ignores the undisputed reality that A.K. has been resistant to visitation with her mother – a situation the Court has acknowledged and addressed through therapy and joint dinners rather than immediate forced visits. Brittany’s narrative suggests that I am simply withholding A.K. without cause, but in truth I have honored both the spirit and letter of the reunification plan. Notably, Brittany never attempted to exercise her summer 2025 visitation with A.K. until the very last week of summer – at which point she (through counsel) sent an urgent email on July 14, 2025 demanding to pick A.K. up that same day, knowing I was out of town for work. Her email accused me of “not allowing” visitation with A.K. and insisted that the court order “is not optional” for me. In fact, prior to that last-minute demand, Brittany had made no request for A.K. all summer. As soon as she did raise it, I immediately contacted A.K. via text as I was out of town to ask if she was willing to go. My daughter’s response speaks volumes: “No!! Please I’m scared, why is this starting now? I don’t wanna go I’m gonna have a nervous breakdown if I have to go.” (Exhibit I). This text from A.K. was not coached by me – it was her genuine reaction to the prospect of being forced to her mother’s home with no progress in their strained relationship. All of this contravenes Brittany’s suggestion that holiday visitation has only been impeded by me. The truth is, I have tried to protect A.K.’s emotional well-being while also encouraging reunification. The court’s approach since late 2024 has been to gradually rebuild trust (through counseling and dinners) before any overnight or holiday visits alone with her mother. Despite this long gap, Brittany did not consistently utilize the interim opportunities (she missed many of the weekly dinners), making it unreasonable and potentially traumatic to force A.K. into an extended holiday visitation at this time. My motion to set aside the holiday visitation was made out of concern for A.K.’s best interest under these circumstances – a concern supported by A.K.’s expressed fears and by Brittany’s lack of participation in rebuilding a trusting relationship with her daughter.\nAllegation of Alienation vs. Father’s Support of Mother-Child Relationship: Brittany has insinuated that my actions are intended to “alienate” her from the children or to prolong the litigation. The record strongly refutes this. I have consistently encouraged contact between the children and their mother. When Brittany does make the effort, I comply and facilitate as described above. In fact, I have gone out of my way to foster their respect for her (for example, helping them prepare gifts and phone calls for her on special occasions). The obstacles in this situation stem from Brittany’s own behavior – her inconsistency, her failure to follow through with therapy and dinners, and the resultant effect on A.K.’s comfort level. I have not prevented Brittany from exercising visitation – rather, she has been unable or unwilling to do so in a manner that is in AKs best interest. I respectfully emphasize these facts to correct the record: my goal has always been to support our children’s well-being and follow the court’s orders, not to undermine Brittany’s role as their mother.\n\nConclusion: In light of the above, the factual record shows a clear pattern of Brittany Gilliland’s failure to utilize the visitation opportunities given to her and my consistent efforts to facilitate reunification in line with court orders. Brittany’s objection to setting aside holiday visitation ignores the trauma A.K. would likely experience if forced into an abrupt holiday stay, especially given Brittany’s many missed visits and lack of progress in repairing their relationship. I have presented this affidavit to provide a truthful, documented account of events. I swear that the foregoing is true and correct to the best of my knowledge.\nSworn to and subscribed before me this __ day of ____, 2025. (signature and notary information to be provided)\n\nExhibits to be submitted:\nExhibit A: January 10, 2025 Text Messages – Conversation showing Brittany requesting a rescheduled dinner (to Saturday breakfast) and then failing to show up at the agreed time[1][2]. Proves Mother’s no-show after Father accommodated her request.\nExhibit B: February 5, 2025 Text Messages – Brittany cancels the court-ordered Wednesday dinner due to work and proposes a next-day meal; Father insists on sticking to the order after prior false accusations. Supports that missed dinner was due to Mother’s cancellation and Father’s caution after Mother’s attorney wrongly claimed he “missed” rescheduled dinners.\nExhibit C: February 12–13, 2025 Texts – Records of Father waiting for Mother (no response) on Feb 12, and Mother on Feb 13 accusing Father of refusing a make-up dinner and threatening contempt[3][4]. Demonstrates Mother’s attempt to shift blame and create a false narrative after her own no-show.\nExhibit D: “Missed Dinners 11.7.25” Log – A contemporaneous log of reunification dinners (Jan–Aug 2025) noting each date Brittany missed or cut short and the reason (if given). Corroborates the pattern of Mother’s frequent non-compliance with weekly visitation.\nExhibit E: Mother’s Day 2025 Incident – Excerpt from log and notes describing May 11, 2025: Father arranging a Mother’s Day dinner for Brittany and A.K., Father facilitating gift exchange, and Mother not spending the dinner with A.K. and returning B.M. late. Shows Father encouraging Mother-child contact on Mother’s Day and Mother’s failure to capitalize on it.\nExhibit F: Select August 2025 Texts – Examples from August 3 and 10, 2025 texts where Father repeatedly asks Mother about plans, Mother gives little to no response, and then Mother fails to appear. Underscores Mother’s lack of communication and unreliability (50% attendance rate as noted by Father).\nExhibit G: June 2, 2025 Email Chain (Attorneys) – Emails between counsel (Darlene Meadows for Father and Aria Barjis for Mother) documenting an agreed adjustment of the summer schedule. Confirms Father offered Mother an extra week with B.M., Mother initially refused and then accepted, and Father allowed B.M. to stay that week, adjusting the return date. Proves Father’s willingness to accommodate Mother’s visitation requests beyond the court schedule.\nExhibit H: September 14, 2025 Text Messages – Conversation on a Sunday where Mother claims Father “never communicated plans” for dinner, and Father responds that he had asked her that morning and reminds her of the standing 1–6 PM order. Illustrates Mother’s false claim of no communication versus the documented reality.\nExhibit I: Child’s Text Message (July 14, 2025) – Text from minor child A.K. to Father, stating: “No!! Please I’m scared, why is this starting now. I don’t wanna go I’m gonna have a nervous breakdown if I have to go.”. This was A.K.’s reaction to Mother’s sudden demand for summer visitation. It evidences the child’s fear and emotional state, supporting Father’s concern about forcing holiday visitation at that time.\nExhibit J: Brittany’s Admission in Court Filing (Sept. 2025) – Excerpt from Brittany’s Objection to Respondent’s Motion to Continue, filed 9/16/2025, wherein she (through counsel) states that she “has not exercised her visitation since February 2024”. This admission highlights that Mother has gone well over a year without regular visitation, undercutting any claim that Father unjustly prevented her from seeing the children. It corroborates the need for a careful, child-centered approach to any holiday visitation.\n\n[1] [2] [3] [4] [5] [6] All Text Messages 9.26.25 (1).pdf\nfile://file-3kcVa6DydGtJaPRGiSmPAk\n[7] 2025-01-31_Motion_to_Suspend_Weekly_Dinners_and_for_Contempt.pdf\nfile://file-CkA5D4SWF5Kd2g5YRzjBf1",
  "source_metadata": {
    "method": "python-docx",
    "size": 25491,
    "modified_time": 1767929814.0
  },
  "modified_time": 1767929814.0
}