{
  "doc_id": "94a953478000b5a8b3e8b884ebcffda810d5484778f1a61437afa64f01cd0ef7",
  "file_path": "C:\\Users\\blain\\Dropbox\\Master_Court_Files\\03_Pleadings\\2025-09-17_OBJECTION_TO_MOTION_TO_REDUCE_TIME_TO_DISCOVERY_FILED_BY_BRITTANY.pdf",
  "file_name": "2025-09-17_OBJECTION_TO_MOTION_TO_REDUCE_TIME_TO_DISCOVERY_FILED_BY_BRITTANY.pdf",
  "doc_type": "pdf",
  "date": null,
  "parties": [],
  "raw_text": "AlaFile E-Notice\n70-DR-2023-900051.01\nJudge: KEVIN HALL\nTo: DAVIS DIANNE JAMES\ndianne@diannedavislaw.com\nNOTICE OF ELECTRONIC FILING\nIN THE CIRCUIT COURT OF TALLAPOOSA COUNTY, ALABAMA\nCHRISTOPHER BLAINE MCGREGOR V. BRITTANY MICHELLE GILLILAND\n70-DR-2023-900051.01\nThe following matter was FILED on 9/17/2025 6:01:54 PM\nD001 GILLILAND BRITTANY MICHELLE\nMOTION TO REDUCE TIME TO SUBMIT DISCOVERY RESPONSES\n[Filer: AGRICOLA BARBARA HAMLIN]\nNotice Date: 9/17/2025 6:01:54 PM\nPATRICK CRADDOCK\nCIRCUIT COURT CLERK\nTALLAPOOSA COUNTY, ALABAMA\n395 LEE STREET\nALEXANDER CITY, AL, 35010\n256-234-4361\npatrick.craddock@alacourt.gov\nDOCUMENT 288\nELECTRONICALLY FILED\n9/17/2025 6:01 PM\n70-DR-2023-900051.01\nCIRCUIT COURT OF\nTALLAPOOSA COUNTY, ALABAMA\nPATRICK CRADDOCK, CLERK\nIN THE CIRCUIT COURT OF TALLAPOOSA COUNTY, ALABAMA\nCHRISTOPHER BLAINE MCGREGOR,\nRespondent,\nv. CASE NO.: 70-DR-2023-900051.01\nBRITTANY MICHELLE GILLILAND,\nPetitioner.\nOBJECTION TO MOTION TO REDUCE\nTIME TO SUBMIT DISCOVERY RESPONSES\nCOMES NOW, Petitioner BRITTANY GILLILAND, by and through the undersigned\ncounsel of record, Barbara H. Agricola, with the law firm of Agricola Law, LLC, and files this\nObjection to Reduce Time to Submit Discovery Responses. In support thereof, Petitioner states as\nfollows:\n1. Petitioner initially filed her Notice of Discovery on June 24, 2024 [Doc. 16];\n2. Respondent submitted his discovery responses, albeit incomplete, on July 26, 2024 and\nJuly 30, 2024;\n3. Since Petitioner initially issued her discovery requests, Respondent has not, in the past\ntwelve (12) months since the issuance, issued his own discovery requests in this matter;\n4. On July 31, 2025, Respondent unilaterally scheduled a deposition to take place on\nAugust 6, 2025 without the Undersigned’s prior knowledge or approval, being notified\nonly through Respondent’s Notice of Deposition [Doc. 225].\n5. Petitioner filed a Motion to Quash [Doc. 231] on the basis of Respondent’s last-minute\nand untimely notice. Respondent filed their response on August 4, 2025 [Doc. 234]\nwhich states, in part:\nThat Plaintiff does not wish the final hearing in this matter to be continued\nas the .01 case has been pending since May 2, 2024, and if the deposition\nChristopher Blaine McGregor v. Brittany Michelle Gilliland\nCircuit Court of Tallapoosa County, Alabama\nCase No.: 70-DR-2023-900051.01\nObjection To Motion To Shorten Discovery Time\nPage 1 of 5\nDOCUMENT 288\ncannot be held on August 6, 2025, Plaintiff would have to file a motion to\ncontinue.\nSee August 6, 2025 Plaintiff’s Response to Defendant’s Motion to Quash Notice of\nDeposition ¶6;\n6. On August 6, 2025, this Honorable Court granted Petitioner’s Motion to Quash, and\nthat the deposition must be on a date agreed upon by both Parties [Doc. 236]. The Court\nalso stated that if need be, the matter could be continued to the week of September 15-\n23, which was done solely to accommodate Respondent;\n7. On August 13, 2025, Respondent filed a new Notice of Deposition for September 10,\n2025, one day before trial [Doc. 244]. Again, Respondent failed to contact the deponent\nuntil about one (1) month before the initial final trial date to schedule the deposition,\nwhich again, was done unilaterally without conferring with Undersigned;\n8. Notwithstanding these scheduling snafus, and against Respondent’s own wishes to\nNOT continue the September 11, 2025 trial date, as referenced in Paragraph 5,\nRespondent filed a Motion to Continue [Doc. 247]. Per the motion, Respondent wished\nto have more time to prepare for the final trial as it would be impossible to present any\ntranscripts of the deposition by the next day. See Respondent’s Motion to Continue\n[Doc. 247];\n9. Additionally, Respondent’s counsel did not have the availability for the alternate week\nthe Court offered as an alternative option. This led to the final trial date being pushed\nover a month out from the initial trial date to the current setting on October 17, 2025\n[Doc. 249];\n10. Respondent filed their Motion to Continue the currently set final trial date on\nSeptember 16, 2025 [Doc. 268]. Respondent boldly requested this continuance and\nChristopher Blaine McGregor v. Brittany Michelle Gilliland\nCircuit Court of Tallapoosa County, Alabama\nCase No.: 70-DR-2023-900051.01\nObjection To Motion To Shorten Discovery Time\nPage 2 of 5\nDOCUMENT 288\ncited being on the Homecoming Committee for one of the Minor Children, which\nRespondent himself admits he has been aware of for over six (6) months. The repeating\npattern here is clear: Respondent is wholly irresponsible and treats the matter before\nthis Honorable Court as so trivial that a middle school pep rally is more important than\nthe final trial. Respondent had significant time to schedule around any commitments\nhe may have had;\n11. Notably, the homecoming event itself is not until later in the evening, allowing\nRespondent and Petitioner to both be present for any send-offs or other pre-\nhomecoming gatherings/dress-up. This is simply not a sufficient reason to, once again,\nprevent the final trial from going forward on October 17, 2025;\n12. The secondary reason cited for this continuance is Respondent’s claim that discovery\nhas not been issued in this case, despite Respondent failing to issue discovery for\nsixteen (16) months;\n13. Granting this motion would be prejudicial to Mother and only serves as yet another\ntactic by Respondent to continue to alienate Petitioner from her daughter and prolong\nthis case. Importantly, Petitioner has still not exercised her court-ordered visitation as\nset out in the .00 case, ordered in February, 2024. Forcing Petitioner to hastily respond\nto thirty-two (32) combined interrogatories, requests for production, and requests for\nadmissions, most, if not all consisting of multiple-part questions, in two weeks time is\ninappropriate and improper. This motion is due to be denied as there is no legal\njustification for shortening the amount of time for Respondent to complete discovery\nunder any circumstance presented in this case;\nChristopher Blaine McGregor v. Brittany Michelle Gilliland\nCircuit Court of Tallapoosa County, Alabama\nCase No.: 70-DR-2023-900051.01\nObjection To Motion To Shorten Discovery Time\nPage 3 of 5\nDOCUMENT 288\n14. Petitioner has incurred significant attorney’s fees as a result of having to file this\nobjection to Respondent’s numerous untimely motions and accordingly, Petitioner is\ndue to be reimbursed for said fees.\nWHEREFORE, PREMISES CONSIDERED, Petitioner prays this Honorable Court\nDENY Respondent’s Motion to Reduce Time to Submit Discovery Responses and ORDER\nRespondent to pay Petitioner’s attorney’s fees incurred as a result of having to respond to this\nuntimely Motion.\nRespectfully submitted on September 17, 2025.\n/s/ Barbara H. Agricola (AGR004))\nAttorney for Petitioner\nOF COUNSEL:\nAGRICOLA LAW\n127 South 8th Street\nOpelika, Alabama 36801\nTelephone: 334.759.7557\nFacsimile: 334.759.7558\nbarbara@agricolalaw.com\nwww.agricolalaw.com\nCERTIFICATE OF SERVICE\nThis is to certify that I have this day served the following with a copy of the foregoing, by\nelectronic filing in the AlaCourt E-File System and/or by placing same in an envelope, properly\naddressed, and depositing it in the United States Mail, with adequate postage prepaid on September\n17, 2025.\nDianne James Davis\nAttorney for Father\n107 Main Street\nAlexander City, Alabama 35010\n/s/ Barbara H. Agricola\nOF COUNSEL\nChristopher Blaine McGregor v. Brittany Michelle Gilliland\nCircuit Court of Tallapoosa County, Alabama\nCase No.: 70-DR-2023-900051.01\nObjection To Motion To Shorten Discovery Time\nPage 4 of 5\nDOCUMENT 288\nChristopher Blaine McGregor v. Brittany Michelle Gilliland\nCircuit Court of Tallapoosa County, Alabama\nCase No.: 70-DR-2023-900051.01\nObjection To Motion To Shorten Discovery Time\nPage 5 of 5\nDOCUMENT 289\nELECTRONICALLY FILED\n9/17/2025 6:01 PM\n70-DR-2023-900051.01\nCIRCUIT COURT OF\nTALLAPOOSA COUNTY, ALABAMA\nPATRICK CRADDOCK, CLERK\nINTHECIRCUITCOURTOF TALLAPOOSACOUNTY,ALABAMA\nALEXCITYDIVISION\nMCGREGORCHRISTOPHERBLAINE, )\nPlaintiff, )\n)\nV. ) CaseNo.: DR-2023-900051.01\n)\nGILLILANDBRITTANYMICHELLE, )\nDefendant. )\nR\nE\nOrderD\nR\nO\nFor goodcause shown,Respondent'sMotion To ExtendDiscovery[Doc.275] andRespondent's\nMotion To Shorten Time For DiscoveryResp onses[Doc.284] isherebyDENIED.Petitioner's\nD\nrequest for attorney'sfeesiswell-taken.Petitioner isorderedto submit her request for a\nreasonable amount of attorney'sfeeswiEthin seven(7) daysof thisOrder.\nS\nO\nDONEthis[To be filled by thePJudge].\nO\n/s/[To be filled by the Judge]\nR\nCIRCUITJUDGE\nP",
  "source_metadata": {
    "method": "pdfplumber",
    "pages": 7
  },
  "modified_time": 1758997143.0
}