{
  "doc_id": "9996bb42509f37d0c3e2dfb4240889b7afbd43fdddb09e040358a5974f3dff8f",
  "file_path": "C:\\Users\\blain\\Dropbox\\Master_Court_Files\\19_Bankruptcy_Chapter_13\\My bankruptcy reply .pdf",
  "file_name": "My bankruptcy reply .pdf",
  "doc_type": "pdf",
  "date": null,
  "parties": [],
  "raw_text": "Case 3:25-cv-00721-BL Document 10 Filed 12/21/25 Page 1 of 27\nCASE NO. 3:25-CV-0721-BL\nIN THE UNITED STATES DISTRICT COURT\nMIDDLE DISTRICT OF ALABAMA\nEASTERN DIVISION\n__________________________________________________________________\nIN Re: CHRISTOPHER BLAINE McGREGOR,\nDEBTOR.\n_________________________________________________________________\nBRITTANY MICHELLE GILLILAND,\nAPPELLANT\nV.\nCHRISTOPHER BLAINE McGREGOR\nAPPELLEE.\n__________________________________________________________________\nOn Appeal from the United States Bankruptcy Court, Middle District of Alabama,\nEastern Division, Case No. 24-81152-BPC\n__________________________________________________________________\nBRIEF OF APPELLEE\n__________________________________________________________________\nCharles M. Ingrum, Jr. (ING-028)\nIngrum & Layson, LLC\n830 Avenue A, Ste. B\nOpelika, AL 36801\nTelephone: (334) 745-3333\nFAX: (334) 460-2287\ncharles@cijllaw.com\nDecember 21, 2025\nCase 3:25-cv-00721-BL Document 10 Filed 12/21/25 Page 2 of 27\nRULE 8012 DISCLOSURE STATEMENT\nPursuant to Fed.R.Bk.P. 8012, the Appellee certifies that:\n1.) Debtor/Appellee, Christopher Blaine McGregor, is an individual, the only\nDebtor in this matter, and hereby certifies that there are no reportable\nrelationships that could pose a financial or professional conflict for this\nCourt.\n2.) Other than the sole Debtor, Christopher Blaine McGregor, there is no\ncreditor’s committee, and no entity whose stock or equity value may be\nsubstantially affected by the outcome of this proceeding. The only other\nindividual involved is the Creditor/Appellant, Brittany Michelle Gilliland.\nRespectfully submitted,, this the 21st day of December, 2025.\n/s/ Charles M. Ingrum, Jr.\nCharles M. Ingrum, Jr.\nAttorney for Appellee\ni\nCase 3:25-cv-00721-BL Document 10 Filed 12/21/25 Page 3 of 27\nTABLE OF CONTENTS\nPage\nRULE 8012 DISCLOSURE STATEMENT………………………………………i\nTABLE OF CONTENTS………………………………………………………….ii\nTABLE OF AUTHORITIES………………………………………………………iii\nSTATEMENT OF THE ISSUES PRESENTED FOR REVIEW………………….1\nI. The bankruptcy court did not err by classifying\nCreditor’s Claim Number 19 as a general unsecured\nclaim because the debt to the Wife is not a domestic\nsupport obligation………………………………………………….1\nII. Changes made by BAPCPA do not support a finding\nthe divorce court’s equitable distribution of assets a\nnon-dischargeable, domestic support obligation…………………1\nAPPLICABLE STANDARD OF REVIEW……………………………………….1\nSTATEMENT OF THE FACTS……………………………………………………2\nSUMMARY OF ARGUMENT…………………………………………………….4\nARGUMENT……………………………………………………………………….5\nI. The bankruptcy court did not err by classifying\nCreditor’s Claim Number 19 as a general unsecured\nclaim because the debt to the Wife is not a domestic\nsupport obligation………………………………………………….5\nII. Changes made by BAPCPA do not support a finding\nthe divorce court’s equitable distribution of assets a\nnon-dischargeable, domestic support obligation…………………20\nii\nCase 3:25-cv-00721-BL Document 10 Filed 12/21/25 Page 4 of 27\nCONCLUSION………………………………………………………………….20\nCERTIFICATE OF COMPLIANCE…….…………………………………….…21\nCERTIFICATE OF SERVICE……………………………………………………22\niii\nCase 3:25-cv-00721-BL Document 10 Filed 12/21/25 Page 5 of 27\nTABLE OF AUTHORITIES\nCASES PAGE\nIn re: Benson,\n441 Fed.Appx. 650 (11th Cir. 2011)………………………10, 11, 12, 13, 14, 15, 16\nCummings v. Cummings,\n244 F.3d 1263 (11th Cir. 2001)………………………………………...………16, 17\nEdwards v. Colin,\n2017 WL 1822570 (M.D.Ala. 2017)…...………………………………1, 17, 18, 19\nLaFontaine v. LaFontaine,\n294 So.3d 774 (2019)………………………………………………………….….15\nMiller v. Equitable Bank,\n39 F.3d 301 (11th Cir. 1994)………………………………………………………...6\nStatutes\n11 U.S.C.§523(a)…………………………………...……………………………4, 5\n11 U.S.C. §101(14A)……………………………………………………………….7\n11 U.S.C. §523(a)(5)………………………………………………………….5, 7, 8\n11 U.S.C. §523(a)(15)………………………………………………….…7, 8, 9, 20\n11 U.S.C. §1328(a)(2)…………………………………………...……………..8, 20\nCode of Alabama §30-2-55……………………………………………………12, 13\nCode of Alabama §30-2-57…………………………………………………….…15\niv\nCase 3:25-cv-00721-BL Document 10 Filed 12/21/25 Page 6 of 27\nSTATEMENT OF THE ISSUES PRESENTED FOR REVIEW\nIII. The bankruptcy court did not err by classifying\nCreditor’s Claim Number 19 as a general unsecured\nclaim because the debt to the Wife is not a domestic\nsupport obligation.\nIV. Changes made by BAPCPA do not support a finding\nthe divorce court’s equitable distribution of assets a\nnon-dischargeable, domestic support obligation.\nAPPLICABLE STANDARD OF REVIEW\nThe Court reviews the Bankruptcy Court’s conclusions of law de novo,\nwhile it reviews findings of fact for clear error. Jove Eng’g. Inc. v. Internal\nRevenue Serv., 92 F.3d 1539, 1545 (11th Cir. 1996). A finding of fact “is clearly\nerroneous when, although there is evidence to support it, the reviewing court on the\nentire evidence is left with the definite and firm conviction that a mistake has been\ncommitted.” Id. (quoting Elston v. Talladega Cnty. Bd. Of Ed., 997 F.2d 1394,\n1405 (11th Cir. 1993)). Edwards V. Colin, 2017 WL 1822570 (M.D.Ala. 2017).\n1\nCase 3:25-cv-00721-BL Document 10 Filed 12/21/25 Page 7 of 27\nSTATEMENT OF FACTS\n1. Christopher Blaine McGregor (hereinafter “Debtor”) and Brittany\nMichelle Gilliland (hereinafter “Wife”) were married with two children.\n(See Rec. 2).\n2. Debtor has no college degree, and worked to put Wife through school,\nwho received her undergraduate degree as well as her master’s degree in\nhigher ed. (Rec. 25, Page 28).\n3. Wife was earning $60,000.00 to $70,000.00 per year, and was the primary\nbread winner in the family. (Rec. 25, Page 28).\n4. Debtor believed that Wife quit her job, but later learned that she had been\nfired. (Rec. 25, Page 28).\n5. Debtor became the primary income for the household. (Rec. 25, Page 28).\n6. The Debtor and Wife were divorced on February 27, 2024. (Rec. 2, Page\n11).\n7. The divorce court awarded the Debtor primary physical custody of the\nParties’ children. (Rec. 2, Page 7).\n8. Wife has to pay the Debtor child support. (Rec. 2, Page 9).\n9. The divorce court did not award alimony. (Rec. 2, Page 10).\n2\nCase 3:25-cv-00721-BL Document 10 Filed 12/21/25 Page 8 of 27\n10. The divorce court awarded the Debtor the marital residence. (Rec. 2,\nPage 4).\n11. The paragraph establishing the Debtor’s monetary obligation to Wife\nstates:\n“The Husband shall pay to the Wife one-half (1/2) of the\nequity in the residence which is fifty-one thousand four\nhundred eleven dollars and 21/100 ($51,411.21). This\namount shall be paid as follows: $10,000.00 within 10 days\nof this order, followed by monthly payments of $2,000.00 per\nmonth for 21 consecutive months beginning April 1st. The\ncourt is aware that the total of the payments above total\n$52,000.00. The additional $588.79 awarded may be\navoided by the Husband by paying the full $51,411.21 within\n90 days of this order. Otherwise, the additional $588.79 shall\nbe consideration for the delay in the Wife receiving full\npayment. If the Husband fails to timely make these\npayments, then the house shall be placed on the market for\nsale with a licensed real estate agent. Upon sale, the net\nproceeds shall be equally divided between the parties.” (Rec.\n2, Page 5).\n12. In the present case, Wife has remarried, and is living with her new\nHusband and child from her new Husband. (Rec. 25, Page 20).\n13. Wife remarried in less than 60 days after the divorce was final. (Rec. 25,\nPage 20).\n3\nCase 3:25-cv-00721-BL Document 10 Filed 12/21/25 Page 9 of 27\n14. When the Debtor filed for bankruptcy relief, he listed his obligation to\nWife as a non-priority, general unsecured debt. (Rec. 3, Page 21).\n15. The Wife filed her claim as a priority debt based on 11 U.S.C. § 523(a)(5),\nthat it is “for a domestic support obligation”. (Rec. 2, Page 3).\n16. The bankruptcy court ruled that Wife’s Debt is not a domestic support\nobligation, and shall be paid as a general, unsecured claim. (Rec. 21).\n17. Note, the Debtor has always proposed to pay Wife in full at 100% in his\nChapter 13 bankruptcy. (Rec. 6, Rec. 8). Regardless of how this comes\nout, Wife is getting all of her money, less anything she has to pay out for\nthe litigation and appeal. (Rec. 6, Rec. 8).\nSUMMARY OF THE ARGUMENT\nThere are certain debts that a bankruptcy debtor cannot discharge,\nthey are enumerated in 11 U.S.C. §523(a). Not all of these exceptions\napply in Chapter 13. Child support, alimony, or debts in the nature of\nchild support or alimony are not dischargeable to a debtor in Chapter 7 or\nChapter 13; however, property division resulting from a settlement\n4\nCase 3:25-cv-00721-BL Document 10 Filed 12/21/25 Page 10 of 27\nagreement or divorce decree are excepted from discharge in a Chapter 7,\nbut free to discharge in a Chapter 13.\nThe Debtor has primary physical custody of his children; wife pays\nhim child support. The Debtor nor his ex-Wife were ordered to pay\nalimony. The Debtor was awarded the Parties’ primary residence; the\nDebtor was ordered to pay Wife ½ of the equity in the primary residence.\nThe Debtor contends that his obligation to Wife is not in the nature of\nsupport, and therefore dischargeable in Chapter 13. Naturally, Wife\ncontends that it is in the nature of support. The bankruptcy court agreed\nwith Debtor and ruled accordingly. Wife has appealed.\nARGUMENT\nV. The bankruptcy court did not err by classifying Creditor’s Claim\nNumber 19 as a general unsecured claim because the debt to the\nCreditor is not a domestic support obligation.\nWhen the Debtor filed for bankruptcy relief, he listed the Wife’s claim\nas a non-priority, general unsecured debt. (Rec. 3, Page 21). The Wife filed\nher claim as a priority debt based on 11 U.S.C. § 523(a)(5), that it is “for a\ndomestic support obligation”. (Rec. 2, Page 3). As a preliminary matter, as\n5\nCase 3:25-cv-00721-BL Document 10 Filed 12/21/25 Page 11 of 27\nthat the Creditor’s claim is based on 11 U.S.C. §523, “Exceptions to\nDischarge”. As such:\n“The objecting creditor has the burden of proving\neach of these elements by a preponderance of the\nevidence. Grogan v. Garner, 498 U.S. 279, 111 S.Ct.\n654, 112 L.Ed.2d 755 (1991). If any one of these\nelements is not met, the debt is dischargeable. Moreover,\ncourts generally construe the statutory exceptions to\ndischarge in bankruptcy “liberally in favor of the\ndebtor,” and recognize that “’[t]he reasons for denying\na discharge…must be real and substantial, not merely\ntechnical and conjectural.’” In re Tully, 818 F.2d 106,\n110 (1st Cir. 1987) (quoting Dilworth v. Boothe, 69 F.2d\n621, 624 (5th Cir. 1934); see also Boyle v. Abilene\nLumber, Inc. (Matter of Boyle), 819 F.2d 583, 588 (5th\nCir. 1987). This narrow construction ensures that the\n“honest but unfortunate debtor” is afforded a fresh start.\nBirmingham Trust Nat’l Bank v. Case, 755 F.2d 1474,\n1477 (11th Cir. 1985); see also Caspers v. Van Horne, 823\nF.2d 1285, 1287 (8th Cir. 1987) (“[E]vidence presented\nmust be viewed consistent with congressional intent that\nexceptions to discharge be narrowly construed against\nthe creditor and liberally against the debtor, thus\neffectuating the fresh start policy of the Code.”). Miller\nv. Equitable Bank, 39 F.3d 301, 304 (11th Cir. 1994)\n(emphasis added).\nCited by In re Mitchell, 633 F.3d 1319, 1327 (11th\nCir. 2011) and SuVicMon Dev., Inc. v. Morrison, 991\nF.3d 1213, 1225 (11th Cir. 2021).\nTo apply to the present case, in a light liberally construed in favor of\nthe Debtor, and strictly construed against the Wife, did the Wife prove by a\n6\nCase 3:25-cv-00721-BL Document 10 Filed 12/21/25 Page 12 of 27\npreponderance of the evidence that the Debtor’s obligation to her was a non-\ndischargeable debt in the nature of support? The answer is clearly “no”.\nIn order for the Wife to prevail, she relies on 11 U.S.C. §523(a)(5),\nwhich states that a “domestic support obligation” is non-dischargeable.\nA “domestic support obligation” is:\n“a debt that accrues before, on, or after the date of\nthe order for relief in a case under this title, including\ninterest that accrues on that debt as provided under\napplicable nonbankruptcy law notwithstanding any other\nprovision of this title, that is-\n(A) owed to or recoverable by-\n(i)A spouse, former spouse, or child of the debtor or such\nchild’s parent, legal guardian, or responsible relative; or\n(ii)A governmental unit;\n(B) In the nature of alimony, maintenance, or support\n(including assistance provided by a governmental unit) of\nsuch spouse, former spouse, or child of the debtor or such\nchild’s parent, without regard to whether such debt is\nexpressly so designated…” 11 U.SC. §101(14A).\nThis is distinguished from 11 U.S.C. §523(a)(15) which states that a debt is\nnondischargeable:\n“to a spouse, former spouse, or child of the debtor\nand not of the kind described in paragraph (5) that is\nincurred by the debtor in the course of a divorce or\nseparation of in connection with a separation agreement,\n7\nCase 3:25-cv-00721-BL Document 10 Filed 12/21/25 Page 13 of 27\ndivorce decree or other order of a court of record, or a\ndetermination made in accordance with State or territorial\nlaw by a governmental unit.” 11 U.S.C. §523(a)(15).\nIn other words, 11 U.S.C. §523(a)(5) states that child support or alimony, or\nanything in the nature of child support or alimony is nondischargeable; and\n11 U.S.C. §523(a)(15) states that anything else awarded to a former spouse\nin a divorce decree or separation agreement (property distribution or\nsettlement) is nondischargeable. So why the distinction? Why didn’t\nCongress just state that anything awarded in a divorce decree or separation\nagreement is nondischargeable? Simple, Congress excepted alimony, child\nsupport and anything else in a divorce decree from being dischargeable in a\nChapter 7 bankruptcy; however, Congress only excepted alimony and child\nsupport (not property division) from discharge in Chapter 13. A property\ndivision resulting from a divorce decree or settlement agreement is\ndischargeable in Chapter 13. See 11 U.S.C. §1328(a)(2).\nNot every exception to discharge listed in 11 U.S.C. §523 applies in\nChapter 13. The only exceptions to discharge under 11 U.S.C. §523 (out of\n19 total) that are applicable to Chapter 13 are: “(1)(B), (1)(C), (2), (3), (4),\n(5), (8), or (9)” 11 U.S.C. §1328(a)(2). Clearly missing from the list is 11\n8\nCase 3:25-cv-00721-BL Document 10 Filed 12/21/25 Page 14 of 27\nU.S.C. §523(a)(15). Therefore, the only type of debt that would be excepted\nfrom discharge, and have to be given priority status in the present Chapter\n13 case would be a debt under 11 U.S.C. §523(a)(15) that is a domestic\nsupport obligation, which is a debt that is alimony or child support, or in the\nnature of alimony or child support.\nIn the present case, the Debtor was awarded primary physical custody.\n(Rec. 2, Page 7). Wife has to pay him child support. (Rec. 2, Page 9).\nFurthermore, the Court did not award alimony. (Rec. 2, Page 10). The\nparagraph establishing the Debtor’s monetary obligation to Wife states:\n“The Husband shall pay to the Wife one-half (1/2)\nof the equity in the residence which is fifty-one thousand\nfour hundred eleven dollars and 21/100 ($51,411.21).\nThis amount shall be paid as follows: $10,000.00 within\n10 days of this order, followed by monthly payments of\n$2,000.00 per month for 21 consecutive months\nbeginning April 1st. The court is aware that the total of\nthe payments above total $52,000.00. The additional\n$588.79 awarded may be avoided by the Husband by\npaying the full $51,411.21 within 90 days of this order.\nOtherwise, the additional $588.79 shall be consideration\nfor the delay in the Wife receiving full payment. If the\nHusband fails to timely make these payments, then the\nhouse shall be placed on the market for sale with a\nlicensed real estate agent. Upon sale, the net proceeds\nshall be equally divided between the parties.” (Rec. 2,\nPage 5).\n9\nCase 3:25-cv-00721-BL Document 10 Filed 12/21/25 Page 15 of 27\nAlthough this Honorable Court should look beyond express designations as\nto the award given, there is nothing in the above paragraph that indicates that Wife\nwas granted anything other than the equitable distribution of the equity from the\nmarital residence awarded to the Husband. (See Rec. 2, Page 5). There is nothing\nin the language of the paragraph concerning Wife’s financial condition. (See Rec.\n2, Page 5).\nSecondly, the Wife did not present any evidence in the trial of this matter\nthat the Debtor’s obligation is in the nature of support other than the convenient\nand self-serving statement that she needs the money. Wife did not present any loan\ndocument, tax return, or any document confirming her “belief” in this statement.\nThis alone should fail the preponderance of the evidence in any court, much less\nwhen it should be construed liberally in favor of the Debtor, and strictly against the\nWife.\nDespite the above facts, the Wife uses primarily three cases to support her\ncontention. They are easily distinguishable from the present case.\nIn re Benson, 441 Fed.Appx. 650 (11th Cir. 2011). In Benson, the Husband\nand Wife agreed that Husband would keep making the mortgage payments on their\n10\nCase 3:25-cv-00721-BL Document 10 Filed 12/21/25 Page 16 of 27\nhome, in which Wife was still living. Id. at 650. Husband tried to discharge the\nmortgage payment as a property settlement. Id. at 651. The Court stated:\n“Here the agreement supports Sally’s contention\nthat the parties intended the mortgage payments to be a\ndomestic support obligation. Although in the agreement\nSally waived any right to claim alimony, she did so in\nconsideration for the benefits she received in the\nagreement. The agreement also required Todd to\nmaintain life insurance that would be sufficient to cover\nhis mortgage obligation. Furthermore, Sally agreed to let\nTodd claim a tax exemption for their minor children as\nlong as he continued paying the mortgage, which made\nthe payments appear to be child support. And when Todd\nfailed to pay the mortgage, he was found in contempt in\nstate court. Last, we note that Todd testified that at the\ntime the agreement was made Sally had not been working\noutside the home for at least a decade.”. Benson at 651-\n652.\nIn the present case, the Wife did not “waive alimony” in consideration for\nanything; the Judge made a ruling after hearing the evidence, and awarded\naccordingly. The present case was not an agreement of the parties. The Court\nawarded the Debtor the marital residence, not the Wife. (Rec. 2, Page 4). The\nDebtor has primary physical custody of the minor children (Rec. 2, Page 7), and\nunlike the debtor in Benson, could not be held in contempt for not paying Wife the\nmoney the Court awarded her; it is not support. Although there is disparity in the\n11\nCase 3:25-cv-00721-BL Document 10 Filed 12/21/25 Page 17 of 27\nDebtor and Wife’s income, “Sally had not been working outside the home for at\nleast a decade” (Benson at 651-652), perfect facts for an award of alimony. In the\npresent case, the divorce court reasonably took into consideration that shortly\nbefore the divorce, the Wife made “Between 60,000 and 70,000 (dollars per year).\nShe was the breadwinner for a long time because I don’t have a college education,\nand I was working to help put her through college to earn her master’s degree in\nhigher ed. And I thought she’d quit her job, but she was (actually) fired. That’s\nwhat we learned during the divorce trial. And she was the breadwinner for a while\nfor our family” (Rec. 25, Page 28). The Debtor does not have a college degree,\nand Wife has a master’s degree. (Rec. 25, Page 28). Wife has the burden, and yet\nno evidence was introduced by Wife as to why she does not go back to work or\nwhy she cannot go back to work earning $60,000.00 - $70,000.00 per year. In In re\nBenson, there is no statement that Sally has remarried or has cohabitated with\nanyone else. In the present case, Wife has remarried, and is living with her new\nHusband and child from her new Husband. (Rec. 25, Page 20). If Debtor’s\nobligation were in the nature of support, it would be terminated due to her\ncohabitation. Code of Alabama §30-2-55. Wife has yet to make this position\nknown in Alabama divorce court. If Wife’s contention is that Debtor’s obligation\n12\nCase 3:25-cv-00721-BL Document 10 Filed 12/21/25 Page 18 of 27\nto her is in the nature of support, then why has she not requested the obligation\nstop due to her cohabitation. This leads inevitably to a doom loop that she wants\nthe bankruptcy court to designate something as support, that under Alabama law\nshould terminate due to her remarriage and cohabitation. Code of Alabama §30-2-\n55. So is Wife’s entire appeal a request for Debtor’s obligation to stop and her get\nnothing from her claim because she is no longer entitled to support due to\nremarriage and cohabitation?\nFurthermore, In re Benson states that there are factors that a court should\nconsider in a determination as to whether an obligation is in the nature of support:\n1.) The agreement’s language: In the present case, this falls squarely in favor of\nthe Debtor. (Rec. 2, Page 5).\n2.) The parties’ financial positions when the agreement was made: First there\nwas no agreement made, this was a ruling from a trial, and a clear distinction\nfrom the present case. As to the actual financial positions, as stated above,\nclearly the divorce court judge and the bankruptcy judge took into\nconsideration the evidence presented that Wife made $60,000 to $70,000 per\nyear with a master’s degree, and husband has no undergraduate degree.\n13\nCase 3:25-cv-00721-BL Document 10 Filed 12/21/25 Page 19 of 27\n(Rec. 25, Page 28). Although the income is different, the financial position\nof a party with a master’s degree is clearly superior to one without any\ndegree, the income is a result of whether one wishes to utilize it. This factor\nis in the Debtor’s favor.\n3.) The amount of the division. Here it is clearly detailed that the division of\nassets and subsequent payment by the Debtor is based on the equity of the\nhome, not on some alleged need of the Wife for support. (Rec. 2, Page 5).\nDebtor’s favor.\n4.) Whether the obligation ends upon death or remarriage of the beneficiary;\nClearly not. (See Rec. 2, Page 5). Debtor’s favor.\n5.) The frequency and number of payments. This appears to be aligned with a\nrepayment designed to match the Debtor’s ability to pay. The Debtor could\nhave paid it off and saved a little by paying within 90 days of the divorce\ndecree. Again, there is nothing presented by Wife, or in the language of the\ndivorce decree that remotely implies that the frequency and number of\npayments was designed as support for Wife. (See Rec. 2, Page 5). Wife has\nburden, so Debtor’s favor.\n6.) Whether the agreement waives other support rights. The divorce decree\n14\nCase 3:25-cv-00721-BL Document 10 Filed 12/21/25 Page 20 of 27\norders no periodic alimony. (Rec. 2, Page 10). However, there was no\n“agreement” of the parties. Wife did not “give up” alimony in consideration\nfor the award of one half of the equity in the marital home. Therefore,\nDebtor’s favor.\n7.) Whether the obligation can be modified or enforced in state court. Support\ncan be modified, property distributions or settlements cannot be. (See Code\nof Alabama §30-2-57; also See LaFontaine v. LaFontaine, 294 So.3d 774\n(2019)). For purposes of this appeal, Wife will probably argue that it is\nmodifiable because it is ”support”; however, as noted above, this argument\ncompletely fails because if it were actually support, then it would be\nmodifiable, and her claim should be reduced to $0.00 because she has\nremarried and is cohabitating with her new Husband and child. So here,\nprobably goes to Wife, and should result in reducing the claim to $0.00.\n8.) How the obligation is treated for tax purposes. This one is no\nlonger relevant. Prior to 2018, alimony was considered income for the\nrecipient, and a deduction for the payor. Payment of alimony is no longer a\ntaxable event.\n15\nCase 3:25-cv-00721-BL Document 10 Filed 12/21/25 Page 21 of 27\nEven based on the factors cited in Benson, the Debtor’s obligation to\nWife to pay her one half of the equity in the marital home cannot be\ndetermined to be in the nature of support. The Wife’s claim is a general\nunsecured claim.\nCummings v. Cummings, 244 F.3d 1263 (11th Cir. 2001). In this case\nrelied on by Wife, the court correctly states that “a court cannot rely solely\non the label used by the parties”. Cummings at 1265. Clearly the\nbankruptcy court, nor this Honorable Court can find that the Debtor’s\nobligation is in the nature of support solely because Wife says it is; which is\nthe only evidence she introduced. Furthermore, as to labels, both parties as\nwell as the divorce court called the Debtor’s obligation to Wife a division in\nequity of the marital residence. (Rec. 2, Page 5).\nIn Cummings, the Court of Appeals determined that a portion of the\nDebtor’s $6.3 million equitable distribution was in the nature of support\nbecause “the divorce court indicated several times that Susan Cummings\nwould depend on a portion of the equitable distribution to support herself\nand the children.” Id. at 1266. In quoting the divorce court, the Eleventh\nCircuit stated ““[t]he Wife will be able to support herself and the children\n16\nCase 3:25-cv-00721-BL Document 10 Filed 12/21/25 Page 22 of 27\nupon receipt of the income-generating assets awarded to her in the equitable\ndistribution.” Thus, the divorce court declined to award permanent alimony\nprecisely because it believed that Susan Cummings would be able to support\nherself and the children with the proceeds of the equitable distribution.” Id.\nThis is not the case here. In the present case there is no language by the\ndivorce court alluding to the fact that any of the equitable division of the\nmarital property was intended to be in lieu of support. Additionally, the\nEleventh Circuit did not reverse the bankruptcy court; they simply remanded\nthe matter to the bankruptcy court “to await clarification by the divorce court\nregarding what portion – if any – of the equitable distribution is in the nature\nof support”. Id. In the present case, how could the divorce court have made\nit any plainer? What logically would be the result of the divorce court\nrevisiting this matter to determine which portion of the equitable division of\nthe marital residence is in the nature of support? The logical answer would\nbe “none”.\nIn Edwards v. Colin, 2017 WL 1822570 (M.D.Ala. 2017), the District\nCourt reversed the bankruptcy court because “there is no question that the\nintent of the parties was for the Settlement to serve as support to Appellant\n17\nCase 3:25-cv-00721-BL Document 10 Filed 12/21/25 Page 23 of 27\nin lieu of alimony”. Edwards at 3 (emphasis added). In Edwards, the parties\nhad been married for thirty two years, and the wife never held a full time job\nduring the marriage, and was not working at the time of the divorce. See Id.\nat 1. Prior to the final divorce, the parties in Edwards went to mediation,\nand the district court considered testimony from the mediation that “”the\nalimony be reclassified as property settlement and reduced to $750.00 per\nmonth.” Which appealed to Appellant because it could not be modified and\nbecause it would not be taxable to her, and appealed to Appellee because it\nwas a lesser amount per month”. Id. Additionally, “in reviewing the record,\nit s obvious that the Settlement was intended as support for Appellant”. Id.\nat 2.\nIn the present case, there was no settlement agreement from mediation\nthat the divorce judge entered. There was no evidence that the Wife “gave\nup” anything. The Debtor’s obligation arises from a full trial ore tenus, in\nwhich the judge reached a determination. There is nothing clear or even\nambiguous that any portion of the order from the divorce court determined\nthat the equitable division of the parties’ marital residence had anything to\ndo with support.\n18\nCase 3:25-cv-00721-BL Document 10 Filed 12/21/25 Page 24 of 27\nAdditionally, the court in Edwards stated that “the Settlement was not\nin actuality a settlement of the marital property as “there is really nothing\nbeing divvied””. Id. at 3. In the present case it is clear that the equity in the\nhouse was being “divvied”, and each got one half. (Rec. 2, Page 5).\nWife keeps claiming the disparagement in income as an argument,\nwhich the court in Edwards took into consideration; however, there was\nnothing in Edwards that demonstrated that Sara Edwards had a master’s\ndegree, and was the primary bread winner for years until she was fired, and\nthat Allen Colin did not even have an undergraduate degree, as are the facts\nin the present case. The court in Edwards stated that “it is abundantly clear\nthat the parties mutually intended the Settlement to achieve the same goal as\nalimony”. Id. at 3 (emphasis added). There is nothing “abundantly clear” in\nthe present case that the parties mutually intended the property division to\nachieve the same goal as alimony. As that the Wife’s attorney wanted to\nmake it abundantly clear in bankruptcy court that Wife remarried in less than\n60 days after the divorce was final, she probably had no desire for any of her\naward to be classified as alimony; as that, but for this bankruptcy, would\nhave been terminated in less than 60 days after it was awarded. (Rec. 25,\nPage 21-22).\n19\nCase 3:25-cv-00721-BL Document 10 Filed 12/21/25 Page 25 of 27\nVI. Changes made by BAPCPA do not support a finding the divorce\ncourt’s equitable distribution of assets a non-dischargeable,\ndomestic support obligation.\nThe Wife’s argument here is nonsensical. Basically, the Wife argues\nthat because the changes to the bankruptcy code in 2005 (BAPCPA)\nremoved the “balancing test” from 11 U.S.C. §523(a)(15) that a distribution\nof marital property is non-dischargeable. As noted above, 11 U.S.C.\n§523(a)(15) does not apply in Chapter 13 cases. See 11 U.S.C. §1328(a)(2).\nThe rest of Wife’s argument is just recycled argument of Issue I, with the\nself-serving claim that she believes the division of equity of the marital\nhome is in the nature of support, without anything else to substantiate it.\nCONCLUSION\nThe Debtor’s obligation to Wife is not in the nature of support,\ntherefore not a domestic support obligation, and therefore dischargeable in\nChapter 13.\nRespectfully submitted, this the 21st day of December, 2025.\n/s/ Charles M. Ingrum, Jr.\nCharles M. Ingrum, Jr. (ING-028)\n830 Avenue A, Ste. B\nOpelika, AL 36801\nPhone: (334) 745-3333\nFAX: (334) 460-2287\ncharles@cijllaw.com\n20\nCase 3:25-cv-00721-BL Document 10 Filed 12/21/25 Page 26 of 27\nCERTIFICATE OF COMPLIANCE\nI certify that this brief complies with the type-volume limitation set forth in\nFed.Bk.R.P. 8015(a)(7)(B). This brief contains 4,288 words as computed by\nMicrosoft Word. It is prepared in Times New Roman 14 point font.\n21\nCase 3:25-cv-00721-BL Document 10 Filed 12/21/25 Page 27 of 27\nCERTIFICATE OF SERVICE\nI hereby certify, that I have on this day served a true and correct copy of the\nabove BRIEF OF APPELLANT, by electronic means, or by placing the same in the\nUnited States Mail, postage prepaid, and addressed to the following on this the 21st\nday of December, 2025.\n/s/ Charles M. Ingrum, Jr.\nCharles M. Ingrum, Jr.\nOf Counsel\nAlgert S. Agricola, Jr.\nAgricola Law, LLC\n127 South 8th St.\nOpelika, AL 36801\nbarbara@agricolalaw.com\nSabrina L. McKinney\nChapter 13 Trustee\nP.O. Box 173\nMontgomery, AL 36101-0173\nmckinney@ch13mdal.org\n22",
  "source_metadata": {
    "method": "pdfplumber",
    "pages": 27
  },
  "modified_time": 1767806398.0
}