{
  "doc_id": "a4b1cb511877a579a91ab42d6f0a7b5af4dc0de5f69b39dc53d14eb0f65a0155",
  "file_path": "C:\\Users\\blain\\Dropbox\\Master_Court_Files\\20_Jan_Contempt_Info\\Contempt Response information.docx",
  "file_name": "Contempt Response information.docx",
  "doc_type": "docx",
  "date": null,
  "parties": [],
  "raw_text": "Response to Allegation No. 4 – Holiday Visitation\nIn response to Mother’s claim that Father willfully denied her Christmas 2025 visitation in violation of the Court’s directive, Father respectfully states the following:\nThe Court’s November 12, 2025 order [Doc. 429], cited by Mother, indeed states that “the scant evidence [does not] provide a sufficient basis to deprive either parent of visitation during one of the child's last 4-5 holidays as a minor.” However, Mother’s characterization of that ruling omits the broader context in which Judge Hall issued it. The Court clarified that “[t]he prior orders in this case did not address holiday visitation and do not appear to contemplate that this case would still be pending for a second holiday season.” The holiday visitation ruling was issued not because prior orders required it, but because the case had lingered and no formal suspension of visitation had been entered. The Court therefore applied general principles of parental fitness in granting the motion.\nImportantly, until that point, the only visitation ever authorized by the Court following the July 31, 2024 hearing was weekly family dinners. At that hearing, when Mother’s counsel inquired about starting reunification therapy, Judge Perryman responded: “No, not now.” He approved only weekly meals involving both parents and the children and deferred all broader visitation pending therapeutic progress. The written order subsequently entered — drafted by Mother’s counsel — deviated from that oral directive, but it still did not authorize overnight or holiday visitation with A.K. Nor did it suspend such visitation, which formed the procedural basis for the Court’s November 2025 ruling, not a substantive endorsement of readiness or therapeutic progress.\nFather did not deny visitation in willful disregard of the Court’s order. Rather, as detailed in prior filings and incorporated herein, he informed Mother of a long-planned church retreat for A.K. during the holiday window, which was communicated on December 15, 2025, with the deposit having been paid months earlier. At the December 25, 2025 exchange, A.K. refused to leave with her mother despite Father’s efforts to facilitate the visitation. Father encouraged A.K. to go, suggested she give her mother a hug, and told Brittany directly that if she wanted to take A.K., she could. Brittany did not do so. Father complied with the holiday order to the extent possible under the circumstances, and his actions do not constitute contempt.\nResponse to Allegation No. 5 – History of Blocking Visitation and Holiday Interference\nMother asserts that Father has a “history in blocking any and all visitation” with A.K. and suggests this is why she was unable to exercise Christmas 2025 visitation. This assertion is both unsupported by the record and mischaracterizes the procedural history of this case.\nFrom July 2024 forward, all visitation between Mother and A.K. was governed not by the Final Divorce Decree but by the reunification plan ordered by the Court following Judge Perryman’s in camera interview with A.K. At that hearing, Judge Perryman determined that traditional visitation should not resume immediately, stating clearly that only weekly joint meals with both parents and the children were to occur. When Mother’s counsel asked about reunification therapy, Judge Perryman replied: “No, not now.”\nThe written order entered in November 2024, drafted by Mother’s own counsel, reinforced the structure of weekly dinners and stated that expanded visitation would occur only after therapeutic progress and a report from the appointed counselor. Judge Hall later acknowledged that these earlier orders “did not address holiday visitation” and “do not appear to contemplate that this case would still be pending for a second holiday season.” The Court granted holiday visitation to Mother in November 2025 on procedural grounds—due to the absence of a formal suspension—not based on a finding that Father had ever blocked visitation or that A.K. was therapeutically ready.\nFather complied with the reunification orders. He facilitated every weekly dinner, brought A.K. to counseling, and followed the framework as outlined by the Court. When Mother relocated to Clanton, Father continued to bring the children to her town, including before Christmas 2025 for a church service and dinner with Brittany’s father, further demonstrating cooperation.\nThe allegation that Father has a “history of blocking any and all visitation” is contrary to the record. In fact, the Court has previously declined to find Father in contempt. At the July 2024 hearing, Judge Perryman stated explicitly that Father’s conduct did not amount to contempt, recognizing the child’s unwillingness and the complexity of the situation. As A.K. expressed in July 2025 in her own words: “No!! Please I’m scared… I’m gonna have a nervous breakdown if I have to go.”\nIt is inaccurate to claim that Father “blocked” holiday visitation when, as detailed in the prior response, A.K. herself declined to leave with her mother on December 25, 2025. Father informed Mother in advance of A.K.’s church retreat, attempted to facilitate the exchange, and encouraged A.K. to go. At no point did he interfere with the order.\nThis pattern does not reflect obstruction. It reflects ongoing adherence to the Court’s directives under difficult circumstances involving a minor child with unresolved emotional resistance to visitation—resistance that the Court has acknowledged and structured its orders around.\nResponse to Allegation No. 6 – Father's Conduct and Court's Prior Warnings\nMother implies that Father has repeatedly acted in defiance of court orders and should have anticipated consequences based on prior court warnings. However, the record does not support a finding that Father has acted in willful disregard of the Court’s authority or prior orders.\nAt the July 31, 2024 hearing, Judge Perryman expressly stated that Father’s conduct did not constitute contempt at that time. The Court acknowledged the unusual and sensitive circumstances surrounding A.K.’s emotional resistance to visitation. Following the in camera interview with A.K., Judge Perryman set aside the pending contempt hearing and outlined a clear plan: only weekly family meals were to proceed, and all further visitation or reunification steps would occur based on therapeutic progress. This plan was reiterated in the written order entered in November 2024, drafted by Mother’s counsel, which did not provide for overnight or unsupervised visits with A.K., let alone extended holiday time.\nBetween July 2024 and November 2025, Father complied with the weekly dinner schedule, took A.K. to counseling, and never impeded Mother’s ability to participate in the reunification process. The reunification counselor, Kelly Turner, conducted only two sessions before withdrawing from the case. No further structured therapy occurred after her withdrawal, and the Court never issued modified orders expanding Mother’s access to A.K. beyond the existing weekly meal requirement.\nWhen the Court granted holiday visitation for Christmas 2025—based on the absence of an order formally suspending visitation—Father attempted to comply. He informed Mother in advance that A.K. had committed to a church retreat from December 27–30 and had paid the deposit for that trip months earlier. On December 25, 2025, Father encouraged A.K. to go with her mother, urged her to give Brittany a hug, and left the decision in the child’s hands. A.K. refused, telling her mother directly that she was not ready and needed acknowledgment of past conduct in order to rebuild trust. At no time did Father interfere with the holiday exchange.\nThe Court has never found Father in contempt regarding visitation. Assertions that he has ignored court warnings or acted willfully to prevent Mother’s parenting time are not supported by rulings or the procedural history. The record instead shows a consistent and cautious judicial approach focused on gradual reunification and therapeutic readiness—not forced visitation against a resistant child’s will.\nFurther undermining Mother’s argument, she failed to exercise her regular custodial weekend immediately following the holiday. On January 1, 2026, she returned Bennett to Father at approximately 6:00 p.m. but did not return to pick him up for her scheduled visitation from January 2 through January 4. This occurred despite her claim that she coordinated exchange plans through counsel to avoid any confusion. No contact or attempt was made by Mother to retrieve Bennett for that visitation period. This omission reflects a lack of follow-through on Mother’s part and contradicts the narrative that miscommunications or Father’s actions have obstructed her access to the children.\nResponse to Allegation No. 7 – Alleged Withholding of Information and Mischaracterization of Trip\nMother claims that Father interfered with visitation and failed to provide information related to A.K.’s holiday plans, referring specifically to an “extracurricular trip.” This allegation is inaccurate and omits essential facts.\nThe trip at issue was not a generic extracurricular activity—it was a church youth retreat organized by First Baptist Church in Alexander City, Alabama, scheduled for December 27 through December 30, 2025, in Gatlinburg, Tennessee. Father informed Mother of the trip well in advance and sought her input and permission. On December 15, 2025, Father texted Mother stating:\n“AK wants to do this… it’s $200. It’s 12/27 – 12/30. Do you have a problem with her going out of state to TN for it?”\nHe also attached the official link to the church’s Winterblast 2025 page, providing full details of the event and payment information. At no point did Mother respond with any objection or concern. Then, on December 26, 2025, Father sent another message to remind Brittany of the trip and offer her a chance to speak with A.K. before departure:\n“AK leaves for TN in the morning for winterblast. I have to have her at the church at 7am – they return Tuesday. Call her tonight before she leaves.”\nThese texts, backed by screenshots, show clear communication, transparency, and an opportunity for Mother to participate. The claim that the trip was concealed is contradicted by this documented effort to inform and involve her.\nIn addition, Father made multiple efforts during the holiday period to support A.K. and Bennett’s contact with Mother. Before Christmas, he drove both children to Clanton, Alabama, so they could attend Brittany’s church’s candlelight service. Bennett participated in the service, and Father encouraged A.K. to stay as well. Afterward, Father drove the children to Prattville, Alabama, where Brittany, her husband Bradley, and the children joined Brittany’s extended family for Christmas dinner. The children even purchased and exchanged gifts with Brittany and Bradley’s daughter—gifts Father helped them shop for at Walmart.\nOn December 25, 2025, at 12:00 p.m., both children were present and prepared for the holiday exchange. Brittany asked A.K. to attend a family gathering at her husband’s family’s home. Father placed Bennett in Brittany’s car and encouraged A.K. to go. He told A.K. and Brittany, “This is between you and your mother,” and then went inside the house, deliberately removing himself from the situation. Approximately ten minutes later, A.K. came inside on her own. Father did not instruct her to stay or prevent her from going—he gave A.K. space to make her own decision and respected the Court’s order.\nIn light of the documented communication, prior in-person efforts to promote visitation, and lack of any objection from Mother prior to the trip, there is no factual basis for the claim that Father withheld information or impeded holiday visitation. The trip was not concealed, it was not unauthorized, and Father took every reasonable step to facilitate both the holiday exchange and A.K.’s church commitment.\nResponse to Allegation No. 8 – Clarification of Communication Regarding Pickup\nMother asserts that Father’s use of only one child’s name during a phone call was intended to exclude or imply that A.K. would not be made available for visitation. This assumption is incorrect and unsupported.\nIf Father referenced only one child (such as Bennett) during a call, it was not intended to imply that A.K. would be withheld. The name mentioned likely reflected the specific logistical detail being discussed at that moment—not an exclusion of the other child. At no time did Father state or suggest that A.K. would not be made available. In fact, A.K. was present and available for the December 25, 2025 exchange, and Brittany personally interacted with both children during that time.\nThe last contact between the parties prior to the holiday exchange occurred before Father left the December 21, 2025 family dinner in Prattville, Alabama. That gathering—attended by Brittany, her husband, their children, and Brittany’s extended family—did not conclude until approximately 10:30 p.m. Father then made the 1.5-hour drive back to Alexander City and did not have further communication with Brittany before the scheduled exchange. The fact that Brittany saw both children on December 25, spoke with A.K., and invited her to join a family event confirms that A.K. was not being hidden or withheld.\nFather complied with the Court’s holiday order, and any mention of only one child during a phone call cannot be reasonably interpreted as an attempt to interfere with or mislead regarding visitation.\nResponse to Allegation No. 10 – Denial of Manipulation and Efforts to Support Mother–Child Relationship\nMother alleges that Father made disparaging remarks to the parties’ minor son, B.M., on Christmas Day, specifically claiming that Father told B.M. that “his Mother refused to allow him to play with his toys,” causing B.M. to be upset with her upon her arrival. This allegation is entirely false and misrepresents the events of that day.\nOn December 25, 2025, Father called Mother at 11:00 a.m., one hour before the scheduled 12:00 p.m. pickup time, to ask when she would arrive. Brittany confirmed that she was already on her way. Father did not inform Bennett that his mother was coming to pick him up until she had already arrived, specifically to avoid upsetting him in advance. When Father told Bennett that his mother was outside, Bennett became visibly upset about the transition.\nTo help ease the exchange and make the moment more positive, Father asked Brittany’s husband, Bradley, to take a picture of him with the children on the front steps. He also invited Brittany to take a picture with them, and she agreed. Because Bennett was still emotional, Father suggested that everyone do “pouting faces” in the photos to help lighten the mood and make it feel more playful. A copy of that photo is attached as evidence.\nIn further effort to support the transition, Father asked Bennett if he wanted to show his mom what Santa had brought. When Bennett said yes, Father invited Brittany and her husband into the home, and Bennett proudly showed them his new gaming PC in the playroom. During this brief visit, Father also introduced Bradley to his father. Afterward, everyone went back outside, and Father placed Bennett in Brittany’s vehicle.\nThe suggestion that Father told Bennett something negative about his mother is unsupported and contradicted by these actions. Father clearly made every effort to create a warm, peaceful, and emotionally supportive exchange—not one based in tension or manipulation.\nFather has consistently gone above and beyond to support the children's relationship with their mother, including:\nMoving Christmas (Santa) to December 23 to prevent B.M. from experiencing the emotional conflict of receiving gifts and then having to leave a few hours later on Christmas Day;\nFacilitating calls between the children and Brittany the night before and the morning of Santa’s visit at his home;\nBringing both children to attend Brittany’s church’s candlelight service and to have Christmas dinner with Brittany’s extended family in Prattville on December 21;\nParticipating in a family dinner and Walmart outing just days before this filing, during which Brittany took pictures of Father with her infant daughter.\nThese events show a consistent pattern of cooperation and care—not alienation or manipulation. Father categorically denies making any statement to B.M. that would cast Mother in a negative light, and he strongly objects to the repeated use of language suggesting that he employs “manipulation tactics.” The documented facts show otherwise: that Father supports co-parenting and has acted in the best interests of both children.\nResponse to Allegations No. 11–14 – Clarifying the Christmas Exchange, History of Encouragement, Court Rulings, and Judicial Statements\n\nAllegation No. 11 – Addie Kate Withheld During Exchange\nMother alleges that Addie Kate was “packing for her church youth trip” during the scheduled Christmas Day pickup, implying she was unavailable. This is false. At the time of the exchange on December 25, 2025, at 12:00 p.m., A.K. was not packing. Both children came outside for the exchange. Photos were taken of the family on the front steps. Afterward, everyone returned inside briefly so Bennett could show Brittany and Bradley his Christmas gifts. Father then placed Bennett in Brittany’s vehicle.\nWhile outside, Brittany asked A.K. if she would like to go with her to a family gathering at Bradley’s family’s home. She told A.K. she would bring her back later that evening. Father encouraged A.K. to go, but did not pressure her. As the discussion continued between A.K. and her mother, Father stated:\n“This is between you and your mother,”\nand then went inside the home. About ten minutes later, A.K. came inside. Father did not interfere in their discussion and did not obstruct the visitation.\nMother’s additional claim that “Katie” was present in the home during this exchange is also false. Katie is not Father’s sister, but his sister-in-law, and she was not present at the home during the pickup. Dated and timestamped video surveillance footage from Katie’s residence confirms that she remained at her own home until approximately 3:00 p.m. on Christmas Day—three hours after the exchange occurred. The only other person present at Father’s home during the pickup was his father.\nThis is another unsupported accusation and a clear attempt to misrepresent the facts before the Court.\n\nAllegation No. 12 – Leaving the Decision to A.K. and Alleged Alienation\nFather did not unilaterally “leave the decision up to the child.” If Mother had wished to enforce the visitation or believed Father was obstructing it, she could have involved law enforcement, as she has on prior occasions. She did not do so. The Court has never found Father in contempt for these exchanges, and in fact, both counsel and the Court agreed after the in camera interview with A.K. that the previously scheduled show cause hearing would not proceed. That decision followed the Court’s acknowledgment that A.K.’s statements carried weight in determining visitation progress.\nAccusations that Father has made “zero attempts” to support visitation or that he engages in “parental alienation” are direct attacks on his character and are not supported by the record. Father has encouraged visitation, attended therapy, facilitated communication, and followed the court’s orders. The in camera interview and court’s subsequent actions contradict Mother’s narrative.\n\nAllegation No. 13 – History of Prior Orders and Motion to Clarify\nMother previously attempted to enforce visitation under an outdated version of the custody order, despite the fact that a newer Temporary Order was in effect. Her filing to enforce a superseded schedule prompted Father to file a Motion to Clarify, which was granted by the Court on August 7, 2025. That order confirmed the most recent order controlled and clarified that the schedule Mother was attempting to enforce was no longer valid. Both the April 14, 2025 Temporary Order and the August 7, 2025 Clarification Order are attached.\nThese events show that any confusion in the record stemmed from Mother’s attempt to act under a repealed order—not from Father’s conduct.\n\nAllegation No. 14 – Court's Early Remarks About Custody and A.K.'s Role\nMother cites early remarks made by Judge Perryman, such as:\n“I don't mind talking to her again and letting her know if she don't do what I tell her she's got to do, then I may have to change custody, and a ten-year-old can't tell us what we're going to do.”\nThese comments were made before the judge heard any evidence and before conducting the in camera interview with A.K. After speaking with A.K. directly, Judge Perryman shifted tone significantly. He ordered only weekly family dinners as visitation and denied reunification therapy, responding to Mother’s counsel’s question with:\n“No, not now.”\nHe made clear that the Court would not force visitation without therapeutic support and emotional readiness. The in camera interview was central to this shift in the Court’s approach, demonstrating the judge’s responsiveness to the facts and to A.K.’s lived experience.\n\n\n\n\n16. I have never disregard the courts authority and to state that I have without proof is unfounded and wrong. The Mother should be held in contempt for the continued use of the court system as a weapon against the Father and AK. Brittany has stated on many occans that she's going to continue this with the court for 18 years, meaning until the kids are grown. I have video evidence of this. The mother cost the father extenvice legal fees assocaited with the filiggs related to the parties holiday visitation. For Thanksgiving the mother arrived at the home to get the kids. I was inside the home. A family friend walked outside with the kids including AK. Brittany's Father was with her for the pickup. Brittany never got out of the car or spoke to AK. They were in the driveway for about 15 min and She never said one work to AK. Never asked her to come, never asked her to get in the car, nothing. Also, it's important to note that Brittany did not get AK a single item for Christmas. Not a card, a gift, nothing. I had professional pictures of the kids made and the kids help build Brittany a large framed portrate of the kids that they gave to her during the Christams pickup. I purchased gifts for AK and Bennett to give their step sisters and sister. This is the 3rd Christmas that Brittany hasn't given AK anything for Christmas, not a card or anything. Brittany has refused to pay child support as ordered by this court. She is currently $3000 dollars or 4.5 months behind in childsupport. In 3 years she has refused to pay for any shared medical cost and is currently more that 3000 behind on medical cost. She has refused to help with school expenses or anything. 2 years of weekly meals, she has paid twice. She never pays for the kids food. She will have bennett and a dinner will fall on her visitation time and she will order her step kids food and wait till I get there to get Bennetts. I want to ask the court for a proctection order that protects me from Brittany filing motion after motion full of lies and request the court to have Brittany pay all my legal cost. \n\nResponse to Allegation 15: Parental Alienation & Reunification Therapy Issues\nFather’s Compliance with Court Orders and Promotion of Mother–Child Contact\nNo Disregard of Orders or Parental Alienation: Christopher Blaine McGregor (“Father”) has scrupulously followed the court’s custody and visitation orders and, in many instances, exceeded their requirements to facilitate the children’s relationship with Brittany Gilliland (“Mother”). As Father affirms, “I have fully complied with all court-ordered visitation arrangements and often exceeded them to support the children’s relationship with their Mother.” Far from instilling distaste for Mother or alienating the children, Father has consistently encouraged contact and goodwill. For example, during holidays in 2024 – when the Final Decree did not entitle Mother to Thanksgiving custody – Father voluntarily arranged extra time for Mother to be with the children. He allowed Mother to have dinner with A.K. on Thanksgiving Eve and spend special time with the younger child, even though this was beyond what the court order required. On Mother’s Day 2025, Father helped both children prepare gifts for Mother and invited Mother to join A.K. for dinner – an offer Mother declined. Father still brought A.K. out to Mother’s car that day to ensure A.K. could hand over the gifts and personally wish Mother a happy Mother’s Day. These actions demonstrate Father’s good-faith efforts to nurture, not undermine, the mother–child bond.\nEncouraging Communication: At no point has Father engaged in a campaign of disparagement or blocked the children’s communication with Mother. In fact, the record shows Father facilitated phone calls, gift exchanges, and counseling sessions aimed at reunifying Mother and A.K.. He has never spoken negatively about Mother to the children. The court’s Final Order explicitly forbids either parent from making derogatory remarks or alienating the children (¶¶13, 14, 22 of the Decree). Father has obeyed both the letter and spirit of those provisions. The only impediments to Mother’s relationship with A.K. have been those arising from A.K.’s own well-founded emotional reservations and Mother’s repeated failure to take advantage of visitation opportunities – not any interference or poisoning of the well by Father.\nFather Did Not “Let the Child Control” Visitation: Allegation 15 claims Father allows the minor child to dictate visitation. This is incorrect. Father has encouraged A.K. to attend scheduled visits and therapy, but he also must respond to the reality of A.K.’s trauma and fear. Notably, on July 24, 2025 the Court (Judge Kevin Hall) explicitly ordered both parties “to parent and not permit the/a child to control the operations of this Court’s orders”. Father has abided by this directive. He continues to present A.K. for visits and urges her to spend time with Mother – he has not told A.K. she can refuse visitation. For instance, when Mother wanted A.K. to attend a family event in Clanton, Father was willing: he told Mother that although he personally was unavailable at that moment, “if Addie Kate felt comfortable going with Mother, then Mother was welcome to pick her up and take her”. In other words, Father opened the door for Mother to speak with A.K. and make her feel safe, making it clear “I would not stand in the way if our daughter was willing”. Mother never even attempted to talk to A.K. or follow up on that offer. This example shows that Father is not granting the child veto power over visitation – to the contrary, he invited Mother to reassure A.K. and proceed with the visit.\nWhat Father refuses to do is forcibly drag a terrified child into a car against her will without addressing the underlying issues. As he explained, “I cannot in good conscience force our child into a situation that she finds scary or traumatic.” This approach is entirely consistent with the Court’s guidance. At the July 31, 2024 hearing (before A.K.’s in-camera interview), Judge Perryman emphasized that the goal was to avoid “screwing up” the child and to rebuild trust gradually: “we’re going to send everybody to counseling, and then we’ll be back here and see if we can’t get things better.” The Judge made clear that reunification therapy should start slowly – first with A.K. and her individual counselor, then joint sessions with Mother “after y’all have some indication … that things are progressing”. In line with that intent, Father has prioritized A.K.’s emotional well-being while encouraging her to heal and eventually resume normal visitation. He is not “controlled” by the child; he is following professional and court guidance to ensure that contact is meaningful and not harmful. Father remains ready to facilitate full reunification as soon as A.K.’s counselor or a reunification specialist advises that A.K. is stable enough to handle it.\nMother’s Pattern of Missed Visitations and Non-Participation\nMother Missed ~50% of Court-Ordered Reunification Dinners: The contempt allegation faults Father for allegedly withholding visitation, but the factual record shows it has been Mother who failed to show up to visitation opportunities. After the divorce, the Court ordered weekly “reunification dinners” to help reintroduce Mother into A.K.’s life (originally Wednesday evenings, later moved to Sundays). From January through August 2025, roughly 30 weekly reunification dinners were scheduled – and Mother missed more than half of them. Some she canceled in advance with flimsy excuses; others she simply no-showed, leaving A.K. waiting. Each absence is documented in text messages and logs (Exhibits A–C) – for example, on January 10, 2025, Mother asked to reschedule a dinner to Saturday morning, which Father agreed to, but then Mother never appeared at the rescheduled time. On February 12, 2025, Mother neither showed up nor gave notice, then later tried to blame Father by claiming she wasn’t informed of the plan (despite a standing court order and shared Google calendar). The pattern continued through the spring and summer: Easter Sunday (April 20, 2025) – Mother failed to participate; Mother’s Day (May 11, 2025) – Mother again skipped the chance to see A.K., aside from picking up the younger child; multiple Sundays in June–August 2025 – Mother would cancel last-minute or simply never respond to Father’s messages about meeting times. By August, Mother was outright refusing to come to the designated location (Alexander City) at all, insisting Father drive A.K. to meet her halfway – contrary to the court’s order that Mother exercise visitation in Alex City. In sum, Mother’s own choices “resulted in any disruption of visitation,” not Father’s actions. Father, for his part, kept every weekly dinner slot open, had the children ready and waiting, and frequently reached out to confirm Mother’s plans – only to be met with silence or cancellations. He even adjusted schedules repeatedly at Mother’s request (e.g. moving visits from Wednesdays to Sundays to accommodate Mother’s work and relocation). The undisputed record is that Father was present for every scheduled exchange; it was Mother who more often failed to appear or cut visits short.\nMother Missed ~75% of A.K.’s Medical Appointments: The allegation that Father blocks Mother from the child’s life is further disproven by Mother’s own absence at critical events like doctor’s appointments. Father has kept Mother informed of all major medical visits for the children. Yet Mother has attended only a small fraction of A.K.’s medical and therapy appointments since the divorce. The attendance log of health visits (Exhibit __) shows that Mother was a no-show for roughly three out of every four appointments. By way of illustration, at A.K.’s pediatric sick visit on August 28, 2023, the clinic records note “Brittany – No Show”, with Father having to accompany A.K. alone. This was not an isolated incident – it is representative of a trend. Mother consistently failed to appear despite having joint notice and rights, thereby forgoing opportunities to engage in A.K.’s health and daily life. It is ironic for Mother to accuse Father of blocking communication with the school or medical providers, when the reality is Mother seldom shows up even when she is expected. Father cannot be blamed for Mother’s own lack of involvement. To the contrary, Father has never barred Mother from any school or medical information – he has provided updates and even added Mother to shared calendars for events. If Mother missed a vaccine appointment or a school function, it was due to her absence or inattention, not because Father hid it from her. In fact, the Final Decree’s joint legal custody terms require both parents to confer on major decisions, and Father has abided by that – for instance, consulting Mother about A.K.’s counseling and inviting her input on activities. It is Mother who chose not to attend or sometimes not even to respond.\nMother Missed ~94% of A.K.’s Extracurricular Activities: Father also documents that Mother has rarely supported A.K. at her extracurricular activities. A.K. is an active pre-teen with sports and school events. Father ensured Mother was informed of all games, recitals, and activities, and the schedule was readily available. Yet Mother’s attendance has been abysmal. Out of A.K.’s entire 2024–2025 sports season, Mother attended only 1 of 12 of A.K.’s soccer games, 2 of 16 of her cheer/football games, and 0 of 30 basketball games. In total, Mother was present for just 3 out of 58 games – a 5% attendance rate, meaning she missed approximately 94% of A.K.’s events. Again, this underscores that if anyone has been absent from the child’s life, it is Mother. Father, by contrast, was at every game or practice, and even took on all the driving and expenses for these activities (often with no contribution from Mother). Father also made sure Mother knew she was welcome at all events; he never discouraged her from coming. Her near-total non-attendance speaks for itself. It is simply not credible for Mother to claim Father “alienated” the child, when Mother has voluntarily alienated herself by failing to show basic support and presence. As Father notes, he has “gone out of my way to facilitate Mother’s visitation, and it is Mother who has often been unable or unwilling to utilize the time allotted to her.” Any suggestion that Father prevented Mother from being involved is flatly false.\nIn summary, the evidence of the past two years shows Father has bent over backwards to include Mother – flexible scheduling, extra holiday time, constant communication – while Mother has spurned half or more of the opportunities given to her. This directly refutes Allegation 15’s premise that Father is the one flouting court orders or poisoning the children’s minds. On the contrary, Father’s compliance and facilitation are well-documented, and it is Mother’s pattern of non-compliance that has hindered her relationship with A.K.\nFather’s Efforts to Encourage and Continue Reunification Therapy\nAllegation 15 also accuses Father of “blocking reunification therapy.” The record proves the opposite. Father has been the driving force behind initiating, maintaining, and when necessary, re-starting reunification therapy between Mother and A.K. Far from impeding therapy, Father has diligently followed every court directive and even sought corrections when the process derailed due to no fault of his own.\nCourt’s Intent vs. Written Order: It is important to recall the court’s intended plan for reunification therapy. During the July 31, 2024 hearing (where the Court interviewed A.K. in camera), Judge Perryman made the gradual approach clear on the record: A.K. would first continue individual counseling (with Mother participating in some of those sessions), and only after progress was observed would a separate reunification therapist commence joint Mother–daughter therapy. The Judge specifically said Mother should attend counseling sessions with A.K.’s regular counselor “at least eight/ten times” and “that needs to start immediately”, and “then a separate reunification [counselor] after we get down the road with this a little bit and see if we can’t get things better.”*. Father understood this phased plan and agreed with it – it aligned with ensuring A.K. was emotionally ready. However, when the written order came out on November 6, 2024, it omitted the phase-in sequence and instead directed that reunification therapy with a specific counselor (Kelly Turner) begin right away. Despite concerns that this contradicted the court’s stated intent, Father complied fully with the November 6 order. He did not challenge or ignore it; rather, he promptly facilitated the ordered therapy: he allowed Mother’s attorney to choose the reunification therapist (Ms. Turner), let Mother set the initial appointments, and made A.K. available for every scheduled session.\nFull Compliance and Participation: Father never impeded the reunification counseling. To the contrary, he went to great lengths to make it successful. He provided a shared Google calendar to both Mother and Ms. Turner to coordinate sessions and communicated his openness and availability for any appointment. Father made sure to attend with A.K. every session that was scheduled and communicated to him. He even rearranged other family plans – for example, cutting short a family Christmas gathering on December 23, 2024 – because Mother and Ms. Turner set a therapy session that day. (Notably, Mother herself missed that December 23 session after insisting on it; she and the therapist canceled last-minute after Father and A.K. had already altered their holiday plans to attend.) Father’s dedication is summed up in his affidavit: “I attended with A.K. whenever sessions were set, and I went so far as to leave holiday family time and rearrange schedules to make therapy a priority.” He never once refused a session, never showed up late (aside from instances where Mother failed to confirm times), and never caused a cancellation. In fact, Father confirms, “I never missed or canceled a session that I was made aware of, and I accommodated every appointment that was communicated to me.” The same cannot be said for Mother – it was her inconsistent scheduling and attendance that undermined the continuity of therapy.\nTherapist Kelly Turner’s Withdrawal: The reunification therapy with Ms. Turner ultimately fell apart not because of any act of Father, but because Ms. Turner herself unilaterally withdrew from the case after only two joint sessions. Critically, Ms. Turner’s own communications and affidavit make clear why she quit – and it was not due to Father “blocking” anything. On February 12, 2025, Ms. Turner submitted an affidavit (since she could not attend a hearing) in which she made certain “prejudicial statements regarding the Father” despite never having met or spoken with him in person. She admitted her conclusions were based solely on limited email interactions. Father’s counsel rightfully sought to cross-examine these conclusions by noticing Ms. Turner for a deposition on February 14, 2025. That same night (Feb. 14), at 11:46 PM, Ms. Turner emailed both parties stating: “I am removing myself from this case. I wish you both the best… I am not going to be able to continue to assist moving forward. If you need any suggestions for other therapists I can provide options.” Ms. Turner specifically referenced an email from Father (in which Mother was allegedly not copied) as the reason for her abrupt withdrawal. Father was baffled by this, as he had included Mother on all communications and immediately responded asking what email she was referring to. It later emerged that Mother had been emailing Ms. Turner separately behind the scenes – for example, Mother confirmed an appointment time with Ms. Turner via a private email that excluded Father. Thus, any confusion about who was attending or confirming sessions was caused by Mother’s unilateral communications, not by Father. Ms. Turner apparently “felt” manipulated by the situation (perhaps due to these crossed communications) and chose to quit. But the key point is this: Father did not fire or pressure the therapist to withdraw. Ms. Turner’s own affidavit states, “this situation felt highly manipulative and… I realized that this process was not going to be conducive nor effective, and a decision was made to withdraw.” Those were her words and decision. Father was blindsided by Ms. Turner’s exit; he had been preparing to attend every session and was “ready and willing to continue the reunification therapy” with her. There is no evidence whatsoever that Father caused or encouraged Ms. Turner’s withdrawal. In fact, the evidence shows the opposite – Father was dismayed by her quitting and took immediate steps to get the therapy back on track with a new counselor.\nFather’s Prompt Action to Continue Therapy: The moment Ms. Turner withdrew, Father sprang into action to avoid any lengthy delay in reunification efforts. Within one day of Ms. Turner’s exit, Father (through counsel) filed a motion on Feb. 13, 2025 to strike Ms. Turner’s unexamined affidavit from the record (given her sudden unwillingness to testify). The very next day, Feb. 14, 2025, Father filed a comprehensive Motion for Reunification Counselor asking the Court to appoint a new, qualified reunification therapist so that Mother and A.K. could continue the therapeutic process with professional guidance. In that motion, Father expressly stated that a “fresh start with a new counselor would be in the best interest” of A.K. and Mother. He attached Ms. Turner’s withdrawal email (Exhibit A to the motion) to document that the prior therapist had voluntarily recused herself. Father also affirmed in his motion that he had **“NEVER allowed his daughter to miss any of these [therapy] appointments and has re-arranged other doctor’s appointments to make the appointment with Ms. Turner.”*. In other words, Father underscored to the Court that he had made reunification therapy a top priority, even over other obligations. As a solution, Father’s motion recommended a highly respected reunification specialist, Caroline Taylor, M.S., LPC, and provided Ms. Taylor’s credentials and reunification philosophy (Exhibit C to the motion). Father asked the Court to appoint Ms. Taylor so that therapy could resume promptly and effectively. These filings demonstrate Father’s unwavering commitment to reunification therapy. He did not view Ms. Turner’s withdrawal as an opportunity to stop therapy – to the contrary, he treated it as a problem to be fixed immediately. Father was literally petitioning the Court to continue therapy with a new counselor at the earliest possible time.\nMother’s Opposition and Delay: Unfortunately, it was Mother (through her counsel) who objected to Father’s motion for a new reunification counselor, which in turn caused further delay. Mother’s attorney, Ms. Agricola, opposed the appointment of Ms. Taylor and accused Father of “sabotaging” the therapy process. Those accusations were baseless – as shown above, it was the therapist’s decision and Mother’s own communications that stalled the therapy, not any obstruction by Father. Father’s filings refuted Agricola’s claims point by point, using Ms. Turner’s own words to prove that “Turner withdrew of her own accord, not because of any interference by me (Father).” In his response, Father noted that Ms. Turner’s affidavit and email “demonstrate she ceased participation voluntarily after realizing her process was compromised,” and that all of Father’s actions “aligned with Judge Perryman’s stated goal – to proceed carefully and protect A.K.’s well-being.” Despite Father’s urgent motion, the dispute over the reunification counselor lingered in litigation for months. This was not due to any lack of effort on Father’s part; he was pushing for therapy while Mother was litigating to keep Ms. Turner (who had already quit) or to prevent Father’s choice of a new expert. The sad result was that reunification therapy did not immediately resume in early 2025 as Father had hoped.\nInterim Counseling for A.K.: Nevertheless, Father did not let A.K.’s healing process languish. In the absence of joint sessions with Mother, Father ensured that A.K. continued in individual counseling to address her trauma. Father arranged for A.K. to see a counselor through the local Child Advocacy Center once a week. Those sessions have been instrumental in helping A.K. work through her feelings in a safe environment. Father kept the Court informed of A.K.’s counseling progress, with the intention that once A.K. was ready, joint reunification therapy with Mother could resume (either with Ms. Taylor or another professional). In other words, Father never gave up on reunification therapy; he only sought to ensure it was done in a manner that would actually help, not harm, A.K. He has never opposed the concept of reunification therapy – he has opposed only a rushed or one-sided process that ignored A.K.’s well-being.\nCurrent Status: As of now, Father remains fully open to resuming joint therapy with a qualified counselor. “I remain open and willing to resume joint therapy with Brittany and A.K. if the opportunity arises with a new counselor, because I earnestly want to repair their relationship,” Father attests. He asks only that the therapy be conducted properly – i.e., with a competent reunification specialist and with attention to A.K.’s emotional safety – so that it has a genuine chance of success. These are hardly the words or actions of a parent “blocking” therapy. On the contrary, they exemplify a parent who is fighting for reunification under the right conditions.\nIn sum, every scrap of evidence regarding reunification therapy shows Father’s good faith and persistence. He followed the Court’s orders to the letter, actively facilitated the sessions (never once causing a cancellation), and when the initial therapist withdrew, Father immediately sought the Court’s help to get the therapy back on track. Allegation 15’s narrative that Father sabotaged or blocked the therapy is completely rebutted by the documented facts. As Father summarized in his affidavit, “It was Brittany’s actions – scheduling sessions she couldn’t attend, canceling last-minute, and not prioritizing A.K.’s needs – that thwarted the reunification counseling… Ultimately Ms. Turner ended her involvement, which was beyond my control.” Father did everything within his power to make reunification therapy succeed, and he continues to be committed to that goal.\nClarifying Responsibility for Delays in Reunification\nIt is important to correct the record as to who bears responsibility for the delays or setbacks in the reunification process:\nFather was proactive; Mother was inconsistent. The timeline of motions and orders makes clear that Father took initiative to resolve problems. He filed the Motion for Reunification Counselor on 2/14/2025 (and a Supplement on 2/26/2025) specifically to avoid delay and get a new therapist in place. By contrast, Mother did not file any motion to expedite reunification therapy or propose any alternative after Ms. Turner quit. Instead, Mother filed objections – effectively delaying the appointment of a new therapist. Mother cannot now complain about the lack of therapy when she actively resisted the very motion that would have reignited the process in early 2025.\nCourt transcripts show the judge’s perspective evolving once A.K.’s voice was heard. Before speaking with A.K., the court had ordered standard visitation and joint therapy, as if this were a typical case. After the in-camera interview and observing A.K.’s extreme distress, the Court adjusted its approach. Rather than punish Father for A.K.’s unwillingness, Judge Hall issued an order on July 24, 2025 emphasizing that past issues would be dealt with later and directing both parents to ensure the child complies going forward. Notably, Judge Hall did not order any immediate enforcement or sanctions against Father at that time, strongly suggesting the Court recognized that Father was not willfully disobeying orders – the situation was more nuanced due to A.K.’s emotional state. The Court’s focus shifted to getting the process “better” for A.K.’s sake, rather than forcing overnight visits or holding Father in contempt. Indeed, Judge Perryman had earlier noted that “if the child is afraid, forcing sudden visitation could be harmful,” which is why he wanted counseling first. Father’s actions have been in line with exactly that philosophy: encourage reunification, but don’t traumatize the child in the process. There is no evidence the Court ever wanted Father to physically coerce A.K. into visits; rather, the Court wanted both parents to work together to make A.K. feel safe with Mother again. Father has been doing just that – he continuously encourages A.K. to engage, and he has repeatedly invited Mother to spend time with A.K. in non-threatening settings (dinners, therapy, daytime visits) to rebuild trust.\nFather has never been the one to “delay or disrupt” reunification therapy – Mother and Ms. Turner have. Father’s filings and Ms. Turner’s email prove that Father was ready and present, and that it was Ms. Turner who “made a decision to withdraw” due to perceived issues not caused by Father. If anything, it was Mother’s surreptitious email to Ms. Turner (excluding Father) that led the therapist to mistakenly believe Father wasn’t including Mother, thus triggering the withdrawal. In short, any halt in the therapy was not due to Father; it occurred despite Father’s efforts, not because of them. As soon as those issues came to light, Father sought to remedy them by involving a new professional and eliminating any misunderstandings.\nFather consistently encouraged visitation – Mother often declined or created obstacles. The allegation that Father “blocked” visitation is unfounded. When Mother actually showed up or requested time with the children, Father almost invariably said yes. The record is replete with examples: Father agreed to every schedule change Mother wanted (until her cancellations became too rampant); Father offered extra holiday visits; Father facilitated phone calls outside of scheduled times; Father allowed make-up visits when feasible. The only times visits didn’t occur were when Mother failed to act or when A.K. herself was expressing severe panic. Even in the latter scenario, Father did not flatly refuse Mother’s requests – instead, he pleaded for a graduated approach (such as short daytime meetings, or meetings in therapeutic settings) rather than immediately handing over an anxious child for overnight trips. That is not blocking visitation; that is exercising prudent parental judgment under difficult circumstances. It is telling that A.K. has consistently returned from any brief interactions with Mother in visible distress, according to counselor reports and A.K.’s own statements. For example, after one such meeting, A.K. texted Father in terror about being forced into an unsupervised visit, saying “No!! Please I’m scared… I’m gonna have a nervous breakdown if I have to go.”. Father reasonably responded by seeking guidance from the Court and therapists, rather than blindly forcing the issue. This context is crucial – Father’s priority is protecting A.K. while trying to repair the mother–child relationship, not isolating A.K. from Mother. All the evidence shows Father wants A.K. to have a healthy relationship with Mother, but not at the cost of the child’s mental health.\nFinally, Father wishes to highlight that until Mother’s own behavior changes – until she makes consistent efforts to show up, to participate in counseling, and to obey the court-ordered schedules – progress will remain slow. The reunification process is not a one-sided obligation on Father; it requires Mother’s active participation and reliability, which have been sorely lacking.\nNecessity of Holding Mother Accountable Going Forward\nFather respectfully submits that Allegation 15 is meritless and should be denied in its entirety. The accusation of parental alienation and blocking therapy is thoroughly disproven by the documented facts and history above. Instead, the evidence shows Mother has repeatedly failed to fulfill her court-ordered responsibilities (attendance at weekly reunification dinners, involvement in the children’s appointments and activities, timely engagement in therapy, etc.), and those failures – not any misconduct by Father – have stalled the reunification progress.\nIf anyone is in contempt of court orders regarding visitation and reunification, the evidence points to Mother, not Father. By missing over half of the ordered visitations and neglecting the vast majority of A.K.’s important events, Mother has deprived herself of chances to rebuild trust with A.K.. By failing to stay for entire sessions or communicate transparently with the reunification therapist, Mother contributed to the therapist’s frustration and withdrawal. By objecting to Father’s motion to appoint a new counselor, Mother delayed the re-start of joint therapy that might have helped mend their relationship in 2025. In short, Mother has not demonstrated the commitment necessary to reassure A.K. or to cooperate in reunification.\nFather maintains that he stands ready to facilitate and encourage any and all contact between Mother and A.K. that is in A.K.’s best interest. He has proven this through his actions over the last two years. Father is not the obstacle here. However, Father is also cognizant that forcing A.K. into visits with a reluctant Mother, without Mother doing the foundational work to repair their bond, could be counterproductive. As Judge Perryman wisely noted, “Y’all get a chance to start over every single day… don’t screw your child up because she’s awesome.”. Father has taken that message to heart – he is striving to do this the right way, by prioritizing A.K.’s emotional safety while steadily encouraging more interaction.\nUntil Mother is held accountable and begins to demonstrate a consistent commitment to A.K.’s life and the court’s directives, this pattern is likely to continue. Father urges the Court to require Mother to actually exercise her visitation (attend the dinners, show up for the appointments, come to the games) and to actively participate in reunification therapy when it resumes. If Mother fails to do so, such failures should carry consequences, because A.K. cannot be coerced back into a relationship by one parent alone – it requires Mother’s genuine effort and presence.\nIn conclusion, Father refutes Allegation 15 and asks that the Court recognize the substantial evidence of his compliance and Mother’s non-compliance. The solution here is not to punish Father for imaginary “alienation,” but rather to hold Mother to her obligations so that A.K. can gradually feel secure and rebuild trust in her. Father remains, as ever, willing to support reunification in any reasonable manner. He prays that the Court will likewise encourage Mother to take responsibility for her part. Only when Mother consistently shows up – in person and in good faith – can the reunification truly move forward.\nSupported by: Motion for Reunification Counselor (Feb. 14, 2025); Second Amendment to Counter-Petition for Contempt (detailing Mother’s missed visits); Transcript of July 31, 2024 hearing (Judge Perryman); Order of July 24, 2025 (Judge Hall); Affidavit of C. McGregor (Nov. 2025); Reunification Dinner Logs and Texts (Exhibits A–D); Medical Appointment Attendance Log (Exhibit E); Kelly Turner email of Feb. 14, 2025 (Exhibit N); and other record evidence cited herein. The facts overwhelmingly show Father’s compliance and Mother’s default, not the other way around. Father respectfully requests that Allegation 15 be dismissed on the merits, and that the Court instead take under advisement the need for enforcement of Mother’s compliance with the existing orders going forward.\nResponse to Allegation No. 16 – Denial of Disregard for Court Authority; Abuse of Process; Request for Protective Relief and Fees\nMother alleges that Father has disregarded this Court’s authority. That allegation is false, unsupported, and unfounded. At no time has this Court found Father in contempt for disobedience of any order, nor has Mother produced competent evidence establishing willful noncompliance by Father. Repeating accusations without proof does not convert them into facts.\nA. Father Has Not Disregarded This Court’s Authority\nFather has consistently complied with the Court’s orders, appeared for hearings, followed visitation directives, participated in counseling when ordered, and sought clarification from the Court when conflicting or ambiguous orders existed. Where disputes arose, Father addressed them through proper motions, not unilateral action. The Court’s repeated refusal to find Father in contempt speaks for itself.\nBy contrast, Mother’s filings repeatedly rely on inflammatory conclusions rather than evidence, and often recycle allegations previously rejected or rendered moot by later orders.\nB. Mother’s Pattern of Using Litigation as a Weapon\nMother has openly stated on multiple occasions that she intends to continue filing actions against Father “for 18 years,” meaning until the children reach adulthood. Video evidence exists documenting these statements. This is not lawful advocacy; it is an admission of intent to use the court system as a weapon rather than a forum for good-faith dispute resolution.\nThis pattern has resulted in extensive and unnecessary legal fees incurred by Father, particularly related to holiday visitation filings that were avoidable and not supported by the underlying facts.\nC. Thanksgiving Pickup – Evidence of Mother’s Own Failure to Engage\nDuring the Thanksgiving pickup referenced by Mother:\nFather was inside the home.\nA family friend walked the children, including A.K., outside.\nMother’s father was present with her.\nMother never exited the vehicle, never spoke to A.K., never asked her to come with her, and never attempted to engage her.\nMother remained in the driveway for approximately 15 minutes without making any effort to exercise visitation with A.K.\nThis incident directly contradicts Mother’s narrative that Father obstructs visitation. Father cannot be blamed for Mother’s decision to remain in her vehicle and not speak to her child.\nD. Christmas Conduct – Demonstrated Good Faith by Father\nMother did not provide A.K. a single Christmas gift, card, or acknowledgment. This was the third consecutive Christmas in which Mother gave A.K. nothing.\nBy contrast:\nFather arranged for professional photographs of the children.\nThe children helped build and present Mother with a large framed portrait of themselves during the Christmas exchange.\nFather purchased gifts for A.K. and Bennett to give to their step-siblings and sibling.\nFather facilitated and encouraged all holiday interactions.\nThese facts are verifiable and directly undermine claims of alienation or hostility by Father.\nE. Mother’s Ongoing Financial Noncompliance\nMother is currently approximately $3,000 (about 4.5 months) behind in child support, in direct violation of this Court’s orders.\nAdditionally:\nOver the past three years, Mother has refused to pay her share of court-ordered medical expenses, now exceeding $3,000.\nMother has refused to contribute to school expenses.\nOver two years of weekly court-ordered meals, Mother has paid only twice.\nMother routinely fails to pay for the children’s food during her visitation, including situations where she orders food for her stepchildren but waits for Father to arrive before ordering food for Bennett.\nThis is a documented pattern of noncompliance, not isolated oversight.\nF. Reunification Therapy Was Not Blocked by Father\nMother’s claim that Father “successfully blocked reunification therapy” is demonstrably false. The record reflects that:\nFather complied with the reunification therapy order.\nFather made the child available.\nThe reunification counselor conducted only two sessions and then unilaterally withdrew.\nFather promptly filed motions seeking clarification and appointment of a new counselor.\nTherapy stalled due to factors outside Father’s control, not obstruction by Father.\nG. Requested Relief\nGiven the above, Father respectfully requests that the Court:\nReject Allegation No. 16 as unsupported and unfounded.\nFind that Mother has engaged in a pattern of abusive litigation conduct and misuse of the court process.\nEnter a protective order limiting repetitive, duplicative, or bad-faith filings absent leave of court or a certification of new, material facts.\nOrder Mother to pay Father’s reasonable attorney’s fees and costs, particularly those associated with holiday visitation litigation necessitated by her conduct.\nAddress Mother’s child support arrearage and unpaid medical expenses.\nAdmonish Mother that continued use of the court system as a weapon against Father and A.K. will not be tolerated.\nFather has respected this Court’s authority at every stage. What threatens the integrity of these proceedings is not Father’s conduct, but Mother’s continued pattern of unsupported allegations, repeated filings, and refusal to comply with existing orders.\nFather’s Motion for Protective Order and for Award of Attorney’s Fees\nFather, Christopher Blaine McGregor (“Father”), by and through undersigned counsel, respectfully moves this Honorable Court for entry of a Protective Order governing future filings and for an award of attorney’s fees and costs, and states as follows:\n\nI. Introduction\nThis motion is not filed lightly. It is necessitated by Mother’s repeated misuse of the court system through serial, unsupported filings, many of which recycle allegations previously addressed, clarified, or rejected by this Court. These filings have caused unnecessary financial harm to Father and emotional harm to the minor child, A.K., while diverting judicial resources from legitimate matters.\nFather has consistently complied with this Court’s orders and sought relief only through proper channels. By contrast, Mother has demonstrated a pattern of litigation conduct that is punitive in nature and untethered from the evidentiary record.\n\nII. Pattern of Abusive Litigation Conduct\nMother has filed multiple contempt and enforcement actions predicated on:\nMischaracterizations of oral rulings;\nReliance on superseded or clarified orders;\nAllegations directly contradicted by transcripts, orders, and objective evidence;\nRepackaged accusations previously resolved or rendered moot.\nOn multiple occasions, Mother has openly stated that she intends to continue filing actions against Father “for 18 years,” meaning until the children reach adulthood. Video evidence exists documenting these statements. This is not advocacy in good faith; it is an admission of intent to use litigation as a weapon rather than as a means of resolving legitimate disputes.\nThis pattern has forced Father to repeatedly incur legal fees to defend against allegations that lack factual or legal support.\n\nIII. Harm to the Minor Child\nMother’s conduct has not only harmed Father financially, but has also adversely affected A.K. The repeated litigation, accusations, and forced exchanges have occurred despite the Court’s acknowledgment—after the in camera interview—that A.K. experiences significant emotional distress related to visitation issues.\nRather than working within the reunification framework ordered by the Court, Mother has repeatedly attempted to litigate around it, increasing conflict and instability for the child.\n\nIV. Financial Harm and Unnecessary Attorney’s Fees\nAs a direct result of Mother’s filings—particularly those related to holiday visitation—Father has incurred substantial and avoidable attorney’s fees. These filings were unnecessary, often contradicted by the record, and in some instances required solely because Mother attempted to enforce orders that had already been clarified or superseded.\nEquity and fairness require that Mother bear responsibility for the costs generated by her conduct.\n\nV. Mother’s Ongoing Noncompliance with Court Orders\nWhile repeatedly accusing Father of contempt, Mother herself remains in violation of multiple court orders, including:\nChild Support: Mother is approximately $3,000 (4.5 months) in arrears.\nMedical Expenses: Mother has refused for more than three years to pay her share of court-ordered medical expenses, now exceeding $3,000.\nCourt-Ordered Meals: Over two years of weekly court-ordered meals, Mother has paid only twice.\nGeneral Support: Mother has refused to contribute to school expenses or routine costs.\nThis imbalance—where one party repeatedly accuses while refusing to comply—underscores the need for judicial intervention to prevent further abuse of process.\n\nVI. Legal Basis for Protective Relief\nAlabama courts possess inherent authority to:\nPrevent abuse of the judicial process;\nLimit repetitive or bad-faith filings;\nAward attorney’s fees where equity demands.\nA narrowly tailored protective order is appropriate where a party demonstrates a pattern of vexatious or harassing litigation conduct, particularly in domestic relations cases involving minor children.\nFather is not seeking to bar Mother from legitimate access to the Court. He seeks only reasonable safeguards to ensure future filings are made in good faith and based on material, verifiable facts.\n\nVII. Requested Relief\nFather respectfully requests that the Court enter an order:\nIssuing a Protective Litigation Order, such that any future contempt or enforcement filings by Mother must:\nBe based on new, material facts not previously litigated; and\nInclude a certification of good-faith factual basis; or\nAlternatively, require leave of Court before filing_plugin\nAwarding Father reasonable attorney’s fees and costs, including but not limited to those incurred in responding to Mother’s holiday visitation filings and repeated contempt motions.\nAddressing Mother’s child support and medical expense arrearages and ordering compliance forthwith.\nAdmonishing Mother that continued misuse of the court system as a means of harassment or leverage will not be tolerated.\nGranting such other and further relief as the Court deems just and proper.\n\nVIII. Conclusion\nFather has respected this Court’s authority at every stage. What threatens the integrity of these proceedings is not Father’s conduct, but Mother’s continued pattern of unsupported allegations, repetitive filings, and refusal to comply with existing orders while invoking the Court as a punitive tool.\nA protective order and fee award are necessary to restore balance, protect the minor child, and ensure that future litigation—if any—is undertaken responsibly and in good faith.",
  "source_metadata": {
    "method": "python-docx",
    "size": 46387,
    "modified_time": 1767929814.0
  },
  "modified_time": 1767929814.0
}