{
  "doc_id": "accdd4abbbfc479ca2542bb061ce5b858921cbc6b0ac831618116d376a9f1d14",
  "file_path": "C:\\Users\\blain\\Dropbox\\Master_Court_Files\\19_Bankruptcy_Chapter_13\\Gilliland v. McGregor Bankruptcy Appeal – Timeliness and Claim Classification.pdf",
  "file_name": "Gilliland v. McGregor Bankruptcy Appeal – Timeliness and Claim Classification.pdf",
  "doc_type": "pdf",
  "date": null,
  "parties": [],
  "raw_text": "Gilliland v. McGregor Bankruptcy Appeal –\nTimeliness and Claim Classification\nBackground: This appeal arises from the Chapter 13 bankruptcy of Christopher Blaine McGregor. Creditor\nBrittany Gilliland filed a $32,000 proof of claim based on a divorce decree, which the bankruptcy court\nultimately allowed as a general unsecured claim (denying her asserted priority as a domestic support\nobligation). In the order on appeal, the court overruled the debtor’s objection to the claim’s timeliness but\nsustained the objection as to priority, reclassifying Claim No. 19 as a general unsecured claim 1 .\nGilliland (the ex-wife creditor) contends on appeal that (1) her claim was timely filed under the Bankruptcy\nRules (despite the bar date falling on November 29, 2024), and (2) the $32,000 debt should be treated as a\ndomestic support obligation (DSO) with priority status (and nondischargeable under §523(a)(5)), rather than\na dischargeable general unsecured debt. Below we analyze each issue, the parties’ arguments, the\nbankruptcy court’s reasoning, and the applicable law. We then assess which side is likely to prevail on\nappeal and why.\nIssue 1: Timeliness of the Proof of Claim Filing\nThe Bar Date and Rule 9006: In McGregor’s Chapter 13 case, the court set a claims bar date of Friday,\nNovember 29, 2024 2 . Gilliland filed her proof of claim on Monday, December 2, 2024 3 . Normally, a\nproof of claim filed after the bar date is untimely and subject to disallowance under 11 U.S.C. §502(b)(9) and\nBankruptcy Rule 3002(c) 4 5 . However, Bankruptcy Rule 9006(a) governs how to compute deadlines and\nprovides an important exception: if the last day of a filing period falls on a Saturday, Sunday, or “legal\nholiday,” then the deadline extends to the next business day 6 7 . A “legal holiday” for these purposes\nexpressly includes “any other day declared a holiday by the state where the district court is located”\n(for time periods measured after an event) 8 7 . Here, the 70-day claims period began with the\nbankruptcy filing on September 20, 2024, so day 70 fell on November 29, 2024 9 .\nGilliland’s Argument (Creditor): Gilliland maintained that her December 2 filing was timely because the\nbar date (Nov. 29) fell on the Friday after Thanksgiving – a day declared an official state holiday in\nAlabama. She introduced a May 20, 2024 memorandum from Alabama’s Governor expressly designating\nFriday, Nov. 29, 2024 as a state holiday for state employees 10 11 . Under Rule 9006(a)(6)(C), that state-\ndeclared holiday should extend the deadline to Monday, Dec. 2, the next business day 12 13 . In short, she\nargued that November 29 counted as a “legal holiday” in Alabama, so her claim filing on Dec. 2 was within\nthe extended time 14 15 . The purpose of including state-declared holidays in Rule 9006 is to protect filers\nwho might assume courts are closed on those days 16 – exactly the scenario here, since Alabama state\noffices were closed the day after Thanksgiving.\nMcGregor’s Argument (Debtor): The debtor countered that November 29, 2024 should not be treated as a\nlegal holiday for filing purposes. He pointed to Alabama law (Ala. Code § 1-3-8) which enumerates legal\npublic holidays and delegates to the Governor the designation of “the day for public thanksgiving”\n(singular) as a holiday 17 . In other words, the statute contemplates Thanksgiving Day (Thursday) as the\nofficial holiday, and does not automatically recognize the Friday after Thanksgiving as a state holiday.\n1\nThe debtor noted that Governor Ivey did issue a memo giving state employees Friday off, but argued this\nwas merely an administrative closure of offices, not an addition to the legal holidays list 18 19 . He even\nproduced the Governor’s formal Thanksgiving Day proclamation (for Thursday, Nov. 28) to emphasize that\nonly the Thursday was proclaimed as the “day of thanksgiving” under state law. In sum, McGregor’s position\nwas that a one-time executive memo closing state offices on Nov. 29 did not rise to the level of a “declared\nstate holiday” under Rule 9006 – thus the bar date should not be extended, and the claim should be\ndeemed late 20 21 .\nBankruptcy Court’s Ruling: The bankruptcy judge sided with the creditor on this issue. After reviewing the\nAlabama statute, the court found that the Governor did have authority to declare an additional legal\nholiday. Alabama Code §1-3-8(d) permits the Governor to declare state holidays for special events 22 , and\nGovernor Ivey’s memorandum “extending the holiday to include both Thursday, November 28, 2024,\nand Friday, November 29, 2024” was a valid exercise of that power 23 . Therefore, November 29, 2024\nwas a legal holiday in Alabama, and under Rule 9006(a)(6)(C) the claims deadline was extended to\nMonday, December 2 24 25 . The court noted that the Federal Rules take into account state-declared\nholidays to avoid unfairly penalizing filers on days they would reasonably believe the courts (or clerk’s\noffice) to be closed 16 . Given that conclusion, Gilliland’s proof of claim – filed on Monday, Dec. 2, 2024 –\nwas deemed timely 26 .\nLikely Outcome on Appeal (Timeliness): The district court is likely to affirm the bankruptcy court’s\ndetermination that the claim was timely. Rule 9006(a)’s plain language supports the result: it includes any\nholiday “declared by the state” 8 , and the evidence showed Alabama’s Governor expressly declared Nov.\n29, 2024 a holiday. The debtor’s technical argument about the Alabama statute’s wording (Thanksgiving\n“Day” in the singular) was considered but ultimately rejected by the bankruptcy judge, who found that state\nlaw did permit an extra holiday in this circumstance 22 23 . The district court will review this legal issue\nde novo, but the analysis in the record is persuasive. Indeed, the Bankruptcy Rules’ 2009 Advisory\nCommittee Note confirms that Rule 9006 was amended to treat state holidays as legal holidays to avoid\n“unintended late filings” when a filer might assume courts are closed 16 . Here it was objectively reasonable\nfor Gilliland to assume a filing deadline falling on the Friday after Thanksgiving extended to Monday. Thus,\non the timeliness question, Gilliland’s position is likely to prevail again – the proof of claim was timely\nfiled 25 .\nIssue 2: Classification of the $32,000 Claim – Domestic Support\nObligation or General Unsecured Debt?\nLegal Framework: The central dispute is whether the $32,000 that McGregor owes Gilliland (arising from\ntheir divorce decree) is a “domestic support obligation” (DSO) or not. A DSO is a term of art in bankruptcy,\ndefined in 11 U.S.C. §101(14A) as a debt owed to a former spouse or child that is “in the nature of alimony,\nmaintenance, or support” (including such obligations established by a divorce decree or agreement) 27 .\nIf a debt qualifies as a DSO, it is given first priority in payment under 11 U.S.C. §507(a)(1) and is non-\ndischargeable in bankruptcy (under §523(a)(5)) – meaning the debtor must pay it in full in a Chapter 13\nplan and cannot wipe it out 28 29 . By contrast, a divorce-related debt that is not a support obligation (for\nexample, a property settlement or equitable distribution payment) is treated as a general unsecured claim.\nSuch a claim receives no special priority and, in Chapter 13, will often be paid only pro-rata with other\nunsecured debts – and can potentially be discharged upon completion of the plan 30 31 . (Notably, Congress\nin BAPCPA made domestic support debts non-dischargeable in all bankruptcies, but debts arising from\n2\nproperty division remain dischargeable in Chapter 13 unless they qualify as DSOs 32 33 .) The bankruptcy\ncourt below ruled that Gilliland’s $32,000 claim was not a DSO but rather a property settlement debt, and\ntherefore reclassified it as a general unsecured claim with no priority 34 . Gilliland appeals that ruling,\narguing the court erred and that the debt should be treated as a support obligation in substance.\nGilliland’s Argument (Creditor/Appellant): Gilliland contends that the bankruptcy judge mischaracterized\nthe nature of the debt. She argues that although the divorce decree labeled the $51,411 payment as part of\nthe property/equity division, it was fundamentally intended to provide financial support to her. Key points\nof her position include:\n• Absence of Alimony = Support by Other Means: The divorce decree explicitly states that\n“neither party is ordered to pay alimony.” Gilliland argues that this fact, in context, supports her\nclaim: since no periodic alimony was awarded, the state court’s equitable distribution of assets\n(specifically, awarding her half the home equity via payments from McGregor) was meant to serve\nas a form of support in lieu of alimony 35 36 . Courts have recognized that property division can be\nintended as support where, for example, one spouse forgoes alimony in exchange for a larger share\nof marital property 37 38 . Gilliland says that is essentially what happened here.\n• Payment Structure Resembles Support: The decree required McGregor to pay the $51,411 in a\nparticular way: an initial $10,000 lump sum, then $2,000 per month for 21 months 39 40 . Gilliland\nemphasizes that this monthly installment structure looks like a stream of support payments.\nInstead of a one-time property buyout, the obligation was spread over nearly two years, which is\natypical for a simple property settlement. In her view, the 21-month payment schedule “begins to\nlook more like alimony,” a point she raised at trial 41 . The regular monthly influx suggests the court\nwanted to ensure she had ongoing income for that period.\n• Her Financial Need and Reliance: At the bankruptcy hearing, Gilliland testified that she depended\non the $2,000 monthly payments to meet her financial obligations 42 43 . She was, at that time,\nstruggling to pay bills, and the money from McGregor was used for her living expenses. This, she\nargues, shows the payments functioned as support. She also introduced evidence of the parties’\nfinancial disparity at the time of divorce – for example, a child support form (CS-42) indicating\nMcGregor had a significantly higher income, or that she had fewer assets – to demonstrate she was\nthe economically disadvantaged spouse 44 45 . In Edwards v. Colin, a case from the same\njurisdiction, the district court stressed the importance of the financial positions of the parties and\nfound a property settlement was actually support where the wife clearly needed the payments to\nmaintain herself 46 47 . Gilliland claims a similar dynamic here.\n• Case Law – Substance Over Form: Gilliland relies on precedent holding that bankruptcy courts\nmust look beyond labels and ask whether an obligation is “in the nature of support.” The Eleventh\nCircuit’s decision in Cummings v. Cummings is central 48 49 . In Cummings, a divorce judgment\nhad awarded the ex-wife a large $6.3 million equitable distribution, and no alimony. The Eleventh\nCircuit recognized that property awards can serve the function of support, noting that divorce courts\noften do not rigidly distinguish the two 37 50 . The Cummings court remanded for clarification, but\nemphasized that if the divorce judge intended the asset distribution to enable the wife to support\nherself, then it is effectively support 51 52 . Gilliland argues that here, as in Cummings, the\nbankruptcy court should have found that the divorce court’s intent was to provide her financial\nsupport through the equity award. She also cites In re Benson (11th Cir. 2011) – an unpublished\n3\ndecision that enumerated eight factors courts consider to differentiate support from property.\nApplying those Benson factors (discussed further below), she contends the balance tilts in favor of\nfinding a support obligation.\n• Effect of BAPCPA: Gilliland’s brief points out that the 2005 BAPCPA amendments to the Bankruptcy\nCode reinforced protections for ex-spouses. Congress made all divorce-related debts\nnondischargeable in Chapter 7 (eliminating the prior distinction between alimony and property\nsettlements under §523(a)(15)) 53 . While in Chapter 13 a property settlement debt can theoretically\nbe discharged, BAPCPA did subject Chapter 13 debtors to stricter obligations to pay domestic\nsupport and stay current on them. Gilliland argues that this overall policy shows Congress intended\nto prioritize the support of ex-spouses and dependents, and that courts should therefore be\ninclined to recognize bona fide support obligations even if they are couched as equitable distribution\n54 55 . In her view, treating the equity payment as a DSO would be consistent with the spirit of\nBAPCPA – ensuring that a spouse who needs support isn’t harmed by the debtor’s bankruptcy.\n(Indeed, if the debt is not a DSO, it could be discharged, leaving her with nothing despite the divorce\naward.)\nIn sum, Gilliland’s position is that the substance and intent of the divorce decree make the $32,000 debt\n“in the nature of support.” She urges the appellate court to reverse the classification, arguing that the\nbankruptcy judge focused too narrowly on the labels in the decree and ignored the reality of her financial\nneed and the purpose the payments served 56 57 .\nMcGregor’s Argument (Debtor/Appellee): McGregor maintains that the bankruptcy court was correct –\nthe debt is a straightforward property settlement, not alimony or support. He argues that virtually all\nobjective indicators show a property division rather than a support obligation:\n• Clear Language of the Decree: The divorce decree’s text is McGregor’s strongest evidence. In\nParagraph 7 of the decree, the state court ordered McGregor to pay his ex-wife “the sum of\n$51,411.21, representing one-half (1/2) of the equity in the residence” 58 39 . The obligation is\nexplicitly tied to the equity value of a marital asset (the home), not to any assessment of the ex-\nwife’s living expenses or financial needs 59 . Just as importantly, the decree unequivocally states\nthat “[n]either party is ordered to pay alimony.” 60 This was a contested divorce that went to\ntrial, and the judge clearly decided property division was appropriate but spousal support was not.\nMcGregor argues that the federal court must give weight to the state court’s explicit decision not to\naward alimony 61 62 . The labeling isn’t dispositive, but here the label (“equity in the residence”)\naccurately reflects the nature of the debt. In bankruptcy, a court cannot simply re-characterize a\nproperty debt as support based on one party’s after-the-fact claim of need, especially when\nthe decree itself and both parties at the time treated it as a property division 30 63 .\n• Reciprocal Exchange – Property Settlement Hallmarks: The structure of the obligation in the\ndecree is that of a property buy-out, not support. McGregor notes that upon his payment of the\n$51,411 in full, Gilliland is required to execute a quitclaim deed transferring her interest in the\nhouse to him 64 . In other words, she was awarded a monetary sum in exchange for her 50%\ninterest in a major marital asset (the home) 64 65 . This kind of quid pro quo – money for property\ntitle – is characteristic of property settlements. By contrast, support obligations typically have no\nsuch exchange; they are simply payments for the maintenance of the recipient. Additionally, the\ndecree provided a specific remedy if McGregor failed to pay the obligation: the house would be sold\n4\nand the proceeds split equally 66 . Allowing or requiring the sale of the property to satisfy the debt is\na classic enforcement mechanism for dividing property; it is not how support (like alimony or child\nsupport) is enforced, which would usually be through contempt or income withholding, not\nliquidating marital assets. The absence of any provision permitting enforcement by contempt or\nlater modification in the decree is telling: under Alabama law, alimony is subject to modification\nand enforceable by contempt, whereas a property division is a fixed debt not subject to\nmodification 67 60 . The decree’s terms (a fixed sum, no contingencies, no modification) align\nsquarely with a property settlement 60 .\n• No Support Indicators in Decree: McGregor points out that the decree did address support in\nanother way – it ordered child support to be paid, but by Gilliland to McGregor (since he had\ncustody of the children) 43 68 . This is the only support obligation in the decree, and it runs\nopposite to Gilliland’s claim. The presence of a child support provision for McGregor’s benefit,\ncoupled with an express “no alimony” clause, underscores that the divorce court did not intend for\nMcGregor to pay any ongoing support to Gilliland. In fact, the overall judgment suggests Gilliland\nwas in a relatively stronger financial position: she was the one paying child support (implying she\nearned more), and the court may have equalized assets but saw no need for alimony. McGregor\ntestified in the bankruptcy hearing that Gilliland has a Master’s degree and was earning $60,000–\n$80,000 per year, whereas he has no college degree and had assumed significant debts (credit\ncards, tax debt) during the marriage 69 70 . By the time of bankruptcy, Gilliland was not working,\nbut McGregor argued this was by choice, not incapacity, given her qualifications 69 70 . The\nbankruptcy judge found that any post hoc reliance by Gilliland on the payments for her expenses did\nnot transform the nature of the debt – especially since nothing in the divorce record suggested\nthe money was calculated based on her needs or meant for her support 71 42 .\n• Application of the Benson Factors: The debtor urges that when you apply the eight-factor test\noften used to distinguish support from property (as outlined in In re Benson 72 ), all or most factors\nhere point to a property settlement. For example:\n• Language of the Agreement/Decree: The decree’s language strongly indicates a property division.\nIt specifies the payment is for “equity in the residence” and even calls it an “Obligation” related to the\nhouse, not any kind of support or maintenance 58 59 . This factor is firmly in the debtor’s favor 73 .\n• Financial Positions of the Parties at the Time: Unlike many support scenarios, the wife (Gilliland)\nwas not at a clear financial disadvantage at divorce. Evidence showed she had higher earning\npotential (a graduate degree and prior solid income) versus McGregor’s lesser education and\nearnings 74 75 . The divorce court likely considered these facts when it declined alimony. Thus, the\nparties’ financial circumstances do not suggest the $51k was needed to prop up an economically\nweaker spouse – if anything, McGregor was the less-advantaged party. This factor favors the\ndebtor’s view that the payment was part of equitable distribution, not a need-based support award\n74 76 .\n• Function/Amount of the Obligation: The amount was determined by a 50/50 division of a specific\nasset, not by assessing a reasonable support amount for the wife. The $51,411 figure was precisely\nhalf the home equity to the penny 58 , indicating a calculation of property value rather than an\nestimation of living expenses. The function was to equalize the division of marital property, not to\nprovide for the ex-wife’s sustenance 77 78 . This again supports classification as a property debt.\n5\n• Contingencies (Termination on Death or Remarriage): True support obligations (like periodic\nalimony) often cease upon the recipient’s remarriage or either party’s death, by law. Here, the\nobligation had no such contingency – McGregor had to pay the full amount regardless of Gilliland’s\nmarital status or future income 79 . In fact, Gilliland did remarry (briefly, within months of the\ndivorce) or at least cohabit with a new partner, yet the obligation remained unchanged 80 81 . The\nlack of a termination condition is consistent with a fixed property debt. (McGregor pointed out,\nsomewhat pointedly, that if this were truly “support,” Gilliland’s remarriage and cohabitation under\nAlabama law would have terminated any alimony obligation 80 82 – but since it’s property-based,\nher remarriage had no effect on the debt.)\n• Payment Terms (Frequency and Number of Payments): Gilliland emphasizes the 21 monthly\ninstallments as resembling alimony. McGregor responds that the installment schedule was not to\ncreate a stream of maintenance, but rather to accommodate his ability to pay a large sum. The\ndecree gave him an option to avoid installments altogether by paying the entire amount within 90\ndays 40 . If he had, Gilliland would have received a lump sum like a typical property buyout. The only\nreason monthly payments occurred was because McGregor elected to pay over time. This suggests\nthe frequency was dictated by the debtor’s finances (common in property settlements) rather than\nthe creditor’s ongoing support needs 83 . Also, unlike periodic support, the monthly payments were\nfor a limited, set period (21 months) with a defined end, not an indefinite obligation.\n• Waiver of Other Support Rights: In cases where a property settlement is exchanged for waiving\nalimony, courts find support intent. Here, there was no divorce settlement agreement at all – the\ncase was decided by the judge. Gilliland did not contractually waive alimony rights in return for the\nequity payment; rather, the judge independently decided neither party should pay alimony 84 . So\nthis factor (whether the award was intended to substitute for alimony) leans toward McGregor. There\nwas no negotiated trade-off of support for property; the property division stood on its own.\n• Modifiability and Enforcement: As noted, the obligation was not modifiable and not enforceable\nby contempt – features of a property award, not support 67 . Alimony in Alabama can be modified or\nended based on changed circumstances or remarriage (see Ala. Code §30-2-55, §30-2-57), but once a\nproperty division is final, it’s not subject to adjustment 67 . McGregor argues that if Gilliland truly\nbelieved this was support, theoretically she (or the state court) could have sought to modify or\nterminate it when she remarried – which didn’t happen. Instead, she treated it as a debt owed to her.\nThis factor thus favors the debtor’s view as well. (Gilliland would likely counter that because it wasn’t\nlabeled alimony, she had no ability to seek modification – which is precisely why she wants it\nrecognized as support now. The debtor’s rejoinder is that you can’t have it both ways: she cannot\nclaim the benefits of support now without having had them then, and her remarriage highlights the\ninconsistency of her position 85 .)\n• Tax Treatment of the Payments: Although recent tax law changes render this factor less\ninformative, historically alimony payments are taxable to the recipient and deductible by the payor,\nwhereas property settlements have no tax impact. There’s no indication the parties treated these\npayments as alimony for tax purposes. Given that after 2018 alimony is no longer tax-deductible,\nthis factor is essentially neutral or inapplicable here 86 .\nConsidering all these factors, McGregor argues the debt looks nothing like a support obligation. It looks\nexactly like what the decree says it is – a property equalization payment. He also underscores that the\n6\nbankruptcy court’s finding of fact on this issue (that the divorce court did not intend the payment as\nsupport) is entitled to deference. The standard of review for this kind of determination – the true nature of a\ndivorce-created debt – is clear error 87 . The bankruptcy judge heard the testimony, weighed the evidence,\nand concluded the obligation was a property debt, a decision supported by multiple factual indicia 34 .\nMcGregor contends that the judge made no mistake, let alone a “definite and firm conviction of error”\nneeded to overturn a factual finding 87 . In his view, Gilliland is attempting to relitigate the divorce by\ninjecting a support purpose that simply isn’t reflected in the divorce decree or the parties’ circumstances.\nBankruptcy Court’s Ruling: After a full evidentiary hearing, the bankruptcy court agreed with McGregor.\nJudge Creswell found “no indication in the Divorce Decree that the Circuit Court intended the\nObligation to function as support for [Gilliland].” 34 The order emphasized several of the points above:\nthe debt was explicitly tied to half the equity in the marital residence, the decree even stated no alimony\nwas awarded, and the overall structure was a property settlement, not support 60 59 . The court noted\nthat the divorce decree lacked any language or features typically associated with support (such as\nbeing contingent on remarriage or subject to modification), and in fact included a provision for Gilliland to\nrelinquish her property interest upon payment – confirming it was an exchange of property rights 88 89 .\nWhile Gilliland testified about her need for the money, the court found this post hoc reliance insufficient to\ntransform the character of the debt 42 . It also found it persuasive that Gilliland was actually paying child\nsupport to McGregor, indicating that if anything, she was not viewed as the dependent spouse financially\n68 . In light of all this, the judge concluded the $32,000 (the remaining amount due at bankruptcy) was\npart of a property settlement and not a “domestic support obligation” under §101(14A) 34 . She\ntherefore reclassified the claim as a general unsecured claim with no priority 90 . (Notably, the court\nexplicitly declined to address dischargeability of the debt under §523(a)(5) or (a)(15), as that issue was not\nbefore it 91 . The focus was purely on claim classification for bankruptcy administration.)\nRelevant Precedents and Their Application: The bankruptcy court’s approach closely followed Eleventh\nCircuit guidance. The court cited Cummings v. Cummings for the principle that neither the labels used by the\nparties nor the divorce court’s characterization is conclusive – what matters is the intent and substance of\nthe obligation 92 93 . In Cummings, the Eleventh Circuit indeed instructed courts to look beyond the label\n(“alimony” vs “property settlement”) to see if a purported property award was intended to provide support\n94 95 . In our case, after looking beyond the labels, the judge found no evidence of a disguised support\nintent. This contrasts with the Cummings scenario: there, the divorce court had explicitly commented that\nthe wife could support herself on the assets awarded, suggesting the asset division was serving a support\nfunction 96 95 . Here, the Tallapoosa County divorce court made no similar statements – to the contrary,\nit declined any alimony and treated the home equity division in a conventional way 60 62 . The bankruptcy\njudge also considered Edwards v. Colin (M.D. Ala. 2017), where a district court reversed a bankruptcy\ndecision and found a property settlement to be in the nature of support because “there [was] no question\nthat the intent of the parties was for the settlement to serve as support… in lieu of alimony.” 97 98\nThat case involved a clear agreement between the divorcing spouses that a property payout was\nsubstituting for alimony. By contrast, in Gilliland’s case there was no mutual intent or agreement – only\nthe divorce court’s judgment, which gave no indication of a support purpose 84 85 . In In re Benson (11th\nCir. 2011), the Eleventh Circuit affirmed a bankruptcy court’s detailed analysis of multiple factors to decide\nsupport vs. property. We walked through those Benson factors above using the evidence here, and the\nresult aligns with the bankruptcy court’s conclusion: on factor after factor, the $32,000 obligation looked like\nan equalization of assets, not a maintenance obligation. Thus, both the case law and the factual record\nsupport the bankruptcy court’s classification.\n7\nLikely Outcome on Appeal (Classification): On this issue, McGregor (the appellee debtor) has the stronger\ncase, and the bankruptcy court’s decision is likely to be upheld. Gilliland’s arguments are not without merit\n– there are certainly cases where a lump-sum property award is deemed support in disguise – but those\ncases involve facts quite distinct from the ones at hand (e.g. an obvious imbalance of financial power, or\nexplicit indications that the award was instead of alimony). Here, the evidence of intent weighs against\nGilliland. The divorce decree’s plain terms and the surrounding circumstances strongly suggest a property\ndivision was intended, and the bankruptcy judge’s finding to that effect was well-supported by the record\n34 . Given the clear error standard for overturning such factual findings, the district court would need to\nbe firmly convinced a mistake was made. It is hard to see clear error in Judge Creswell’s careful analysis: she\nconsidered Gilliland’s need but found it insufficient to overcome the concrete factors pointing to a property\ndebt 99 34 . Moreover, public policy (as reflected in BAPCPA) certainly prioritizes actual domestic support\nobligations, but it does not mandate that every equitable distribution be treated as support. Congress\nensured that true DSOs receive priority and are never discharged, whereas other divorce debts (while\nstill important) do not get the same elevated status. In this case, classifying the claim as general unsecured\ndoes mean Gilliland might not be paid in full through the Chapter 13 plan, but that outcome flows from the\nnature of the debt as determined by the state court.\nIn conclusion, on Issue 1 (Timeliness), the bankruptcy court correctly applied Rule 9006 to find the proof of\nclaim timely, a decision likely to be affirmed on appeal 26 . On Issue 2 (Classification), the bankruptcy\ncourt’s ruling that the $32,000 debt is not a domestic support obligation was grounded in substantial\nevidence and consistent with law, and thus is also likely to be affirmed 34 . Gilliland faces an uphill battle\nconvincing the district court otherwise. Barring any clear error in the bankruptcy court’s fact-finding,\nMcGregor’s position should prevail on appeal – the claim will remain classified as a general unsecured\ndebt (with no priority) rather than a priority domestic support obligation. The likely result is that the\nbankruptcy court’s order will be upheld in full, leaving Gilliland with a timely-filed but non-priority claim that\nwill share in any pro-rata distribution and be subject to discharge upon completion of the Chapter 13 plan\n100 .\n1 2 3 4 5 6 7 8 16 17 22 23 24 25 26 27 28 34 39 40 42 43 58 59 60 64 65 66 67 68\n71 88 89 90 91 92 93 99 Appeal BK1.pdf\nfile://file_000000006da8722fa7fe470810e258ea\n9 10 11 12 13 14 15 18 19 20 21 35 36 37 38 41 44 45 46 47 48 49 50 51 52 56 57 61 62 69\n70 80 81 82 Bankruptcy Transcript .pdf\nfile://file_00000000b490722f9a8e4a2590e4a826\n29 53 54 55 BNK brief Brittany.pdf\nfile://file_000000004d80722f82e2b4790b7c4318\n30 31 32 33 63 72 73 74 75 76 77 78 79 83 84 85 86 87 94 95 96 97 98 100 My bankruptcy\nreply .pdf\nfile://file_0000000067c471f5aaaf9d8027d24a1a\n8",
  "source_metadata": {
    "method": "pdfplumber",
    "pages": 8
  },
  "modified_time": 1767806466.0
}