{
  "doc_id": "b614b27ce28b42fa1a78a120e79d50ddf553247f2841e11eeee98d616697103c",
  "file_path": "C:\\Users\\blain\\Dropbox\\Master_Court_Files\\20_Jan_Contempt_Info\\Response 0.docx",
  "file_name": "Response 0.docx",
  "doc_type": "docx",
  "date": null,
  "parties": [],
  "raw_text": "Between January and August 2025, Brittany failed to attend, canceled, or cut short the majority of those dinners. On January 10, 2025, Brittany rescheduled the court-ordered dinner to Saturday morning. I arrived with both children at 9:00 a.m. as agreed; she did not appear. On February 5, 2025, Brittany texted that she could not attend that Wednesday’s dinner because of work. She proposed Thursday instead, but did not show up then either. On February 12, 2025, I waited with the children for thirty minutes; Brittany never arrived. The next morning she accused me by text of “refusing make-up dinner” and threatened contempt even though she had not appeared the night before. On April 20 (Easter) and May 11 (Mother’s Day), I offered dinners so she could spend time with A.K.; she failed to participate. From June through August 2025, Brittany routinely ignored or canceled Sunday dinners. On June 1, June 22, and June 29 she gave late-day excuses. In July she wrote she “won’t be able to do dinners until I get back to work,” missing July 6 and 13 entirely. On July 20 she left a planned dinner early, saying she needed to return to Clanton before dark. On August 3, I sent multiple texts asking her what time she would meet us; she never answered or appeared. On August 10, she agreed to meet at 1:30 p.m. at Who’s Restaurant but never came. On August 17, she refused to come to Alexander City, insisting I drive to Clanton. On August 24, she again failed to appear, citing childcare for her stepchildren.\n\nOut of roughly thirty scheduled dinners from January through August, Brittany missed more than half. Each absence or cancellation is documented in the attached logs and text-message exhibits (Exhibits A–C).\nEfforts to Facilitate Visitation and Holiday Compliance\nI have complied with every visitation and counseling order and have gone beyond what was required to promote contact between Brittany and the children. \n\nI have made every attempt to kept all weekly dinner time slots open or work with Brittany on adjustments when the kids schedule had a conflict, waited with the children each week, and repeatedly messaged Brittany asking if she planned to attend. When she requested changes, I almost always accommodated them. I only insisted on following the written schedule after she began using my flexibility to accuse me of “missing” dinners.\n\nOn Mother’s Day 2025, I helped both children make gifts for their mother and invited Brittany to have dinner with A.K. Although she came by to pick up B.M., she declined to meet for dinner and left with Bennett to go back to Clanton later returning Bennett and never doing dinner with AK. On Easter 2025, I again offered for Brittany to join us for dinner so A.K. could see her mother. Brittany did not attend. \nIn addition to my weekly compliance with the Court’s orders, I have made numerous personal efforts to encourage meaningful contact between Brittany and A.K. On several occasions, I have driven A.K. to Clanton so Brittany could visit with her when Brittany was unable to travel to Alexander City. In June 2025, when Brittany said she could not attend a scheduled dinner in Alexander City, I drove to Prattville so she could spend time with A.K. After dinner, we took both children shopping at Target and a local thrift store for a few hours so Brittany could have additional time with her daughter. I also took A.K. and B.M. to Walmart to choose gifts for their mother and her new baby, and then personally drove them to the hospital so they could visit Brittany and meet their new sister. Earlier this summer, I invited Brittany and her husband to A.K.’s small family birthday party at my home; they both joined us having dinner, cake, ice cream, and  played volleyball from 3:00PM to 9:00PM. Photographs from that day are attached as Exhibit G-1, further reflecting my consistent efforts to foster a healthy relationship between Brittany and the children\n\n\nReunification\nI was present at the hearing on July 31, 2024, before Judge Steven Perryman. In that hearing, Judge Perryman did not order that reunification therapy begin immediately. Instead, the Judge outlined a gradual approach to reunification. He directed that our daughter, A.K.M., continue seeing her counselor and that Mother join some of those counseling sessions (but not all) before proceeding to any specialized reunification therapy. Judge Perryman stated “temporarily, we’re going to go with lunches, dinners, [with] family, all of you together and try to get to where visitation gets normalized”. When Mother’s attorney asked if reunification therapy with a specialist would start now, Judge Perryman answered that it would happen “after we get down the road a little bit” with the counseling and family meals. In sum, the court’s oral instruction was that Mother should first attend counseling sessions with A.K. and we should have gradual family meals; reunification therapy would come later, not right away. \nAfter that hearing, a written “Final Order” was entered on November 6, 2024. That written order, which was drafted by Mother’s counsel, did not fully match Judge Perryman’s oral directives. Notably, it required that reunification therapy with a specialist (Ms. Kelly Turner) begin “effective immediately, without waiting for the counseling phase. It also mandated weekly dinners every Wednesday at 6:30 p.m. sharp with no exceptions (stating that these dinners “shall take priority over all other events”) Judge Perryman’s oral ruling, however, had never specified a particular day or time for the family meals – he had even said he “did not care if the time was breakfast, lunch, or dinner” so long as one family meal happened per week. The Judge’s intent was to have flexibility around A.K.’s schedule, not a rigid Wednesday-only rule. I was concerned that the written order’s terms (immediate reunification therapy and fixed Wednesday dinners) contradicted the plan the Judge announced in court. Through my attorney, I objected at the time that the written order did not reflect the Judge’s actual instructions. Nevertheless, once that order was entered, I followed it.\nEarly Involvement of Kelly Turner (Reunification Therapist): Ms. Kelly Turner became involved in this matter even before the court officially appointed her. In August 2024, prior to any signed order, Mother unilaterally sought out Ms. Turner. On August 20, 2024, Ms. Turner introduced herself to us via a group text message, stating: “This is Kelly Turner… I am the therapist that will be doing the reunification therapy per the court recommendations. We had our first session yesterday…”. I was surprised because no court order for reunification therapy had been entered at that time. Ms. Turner’s message indicated she had already conducted a session on August 19, 2024, with Mother and A.K. (which A.K. did not attend due to illness) and wanted to schedule another session on 9/4/2024, asking me to “please confirm”. I immediately responded that we did not yet have a court order and that important details—such as selection of a neutral therapist and scheduling—were still being discussed by counsel. I firmly stated that any reunification therapist should have no prior history with either Mother or A.K. I also told Ms. Turner (and Mother) that until a therapist was mutually agreed or appointed by the court, no further sessions should be unilaterally set During this exchange, I specifically asked Ms. Turner if she had any prior sessions or relationship with Mother; Ms. Turner did not directly answer my question. I was left uneasy about Ms. Turner’s neutrality because it seemed Mother had orchestrated Ms. Turner’s involvement on her own.\nCompliance with Reunification Therapy and Family Dinners: After the November 6, 2024, written order named Ms. Turner and set the schedule, I fully complied with the reunification therapy requirements and the weekly family dinners. I never once refused to take our daughter A.K. to a session with Ms. Turner. In fact, I went out of my way to ensure A.K. attended every therapy appointment. I have not allowed A.K. to miss any reunification sessions – even when conflicts arose, I either rescheduled the other conflicting event or sought to adjust the therapy appointment. For example, in November 2024, A.K. had a long-awaited behavioral evaluation with her pediatric specialist that ended up conflicting with a reunification session Mother scheduled with Ms. Turner. We had waited weeks for that doctor’s appointment. As soon as I realized the conflict, I immediately notified Ms. Turner and Mother of the situation. On November 12, 2024, I begged Ms. Turner (via text and email) to reschedule the therapy session because it was “very critical that Addie Kate go to her appointment” with the doctor I assured Ms. Turner that I would bring A.K. to any other therapy time that didn’t overlap with the medical appointment. Unfortunately, Ms. Turner refused to adjust the therapy schedule – she told me to email her instead of texting and ultimately declined to offer any alternative time Faced with that, I had no choice but to have A.K. attend the reunification therapy session as scheduled (to avoid violating the order), and A.K. missed her medical evaluation as a result. Later discovered during discovery that Brittany had a private conversation via text with Turner and the appointment was purposely set on the same day and time as the behavior appointment.\n I want to make clear that I did everything in my power to follow the court’s orders regarding therapy and dinners. I did not “impede” or sabotage any reunification sessions. On the contrary, I rearranged other aspects of the children’s schedule (and my own work schedule) to make sure we fulfilled the court-ordered therapy. If any implication has been made that I failed to comply or caused sessions to be missed, that is absolutely false. I complied even when it caused A.K. to miss important appointments, because I understood the court order required it.\nCommunication and Scheduling Issues with Ms. Turner: Throughout this process, I often found it difficult to communicate with Ms. Turner. After the November 2024 order, Ms. Turner requested that all further communications go through her email (she provided a new work email and phone number and said text messaging was not ideal).  I respected her request and switched to email for scheduling and updates. However, Ms. Turner frequently failed to respond promptly to my emails. In one instance in early January 2025, Mother informed me of a supposed upcoming therapy session date that I had not heard about from Ms. Turner. I emailed Ms. Turner multiple times (on at least three separate days) just to get confirmation of the appointment Mother claimed was set. Ms. Turner did not reply until after my third follow-up email, days later, simply confirming the time. This lack of communication from Ms. Turner caused a lot of confusion and concern on my part. I was trying to follow the order and have A.K. where she needed to be, but it was problematic when the therapist herself wouldn’t confirm appointments or provide information in a timely way. (A true copy of the January 2025 email chain with Ms. Turner, showing my repeated attempts to confirm the session, is attached as Exhibit “C.”)\nMs. Turner’s Withdrawal and Affidavit Blaming Father: Ultimately, Ms. Turner abruptly terminated her involvement in the reunification therapy. She conducted only a couple of joint sessions (between Mother and A.K.) and never included me in any session before she decided to withdraw. In January 2025, Ms. Turner sent an email to the parties (through counsel) stating that she was “withdrawing” from the case and would no longer be providing reunification therapy. (A copy of Ms. Turner’s withdrawal email is attached as part of Exhibit “C.”) Shortly after her withdrawal, on February 12, 2025 (the eve of a court hearing), Mother’s attorney filed an affidavit signed by Ms. Turner. I have reviewed that affidavit. In it, Ms. Turner made several extremely negative and conclusory statements about me. She claimed that the reunification process “felt highly manipulative” and implied that I was manipulating the situation. She essentially blamed me for the lack of progress and stated she had decided to withdraw because the process was “not going to be conducive, nor effective” (implicitly due to my conduct). I was shocked and hurt by these accusations. Ms. Turner never even met with me in person during her brief tenure as reunification counselor. In fact, as her affidavit itself confirms, her only interactions with me were via a few emails. She did not interview me, did not observe me with A.K., and did not speak with me face-to-face at all. Despite that, she appears to have accepted as true everything Mother may have told her. Ms. Turner did not verify any of these things with third parties or records before drawing conclusions. In my view, the blanket “findings” Ms. Turner made in her affidavit were based on one-sided hearsay from Mother. My attorney moved to strike Ms. Turner’s affidavit from the court record due to its unreliable and prejudicial nature I want the Court to be aware that Ms. Turner’s own actions demonstrated bias and unprofessionalism: she was involved before being appointed, she refused to accommodate reasonable scheduling issues, she withdrew without ever attempting to work with me directly, and then lodged last-minute accusations against me as she exited. These facts corroborate my early concern that Ms. Turner was not a neutral reunification therapist.\nFather’s Good-Faith Efforts and Child’s Best Interests: I want to emphasize that I have followed all court orders and encouraged reunification at every step, consistent with both the letter and spirit of the Court’s directives. I attended every weekly dinner that was arranged. I sat at the table with Mother and the children and did my best to facilitate a comfortable environment. I also ensured AK attended every counseling session. My priority has always been the well-being of our children. I understand that the goal of these efforts is to repair the relationship between Mother and A.K., and I have supported that goal. At no point have I ever told A.K. that she cannot see her mother; in fact, I have encouraged A.K. to speak to and spend time with Mother. However, I cannot force A.K. to instantly overcome the anxiety and emotional hurt that she has expressed as a result of past events. Despite the Court’s and my best efforts, A.K. remains very hesitant and fearful about one-on-one visits with Mother. The progress in reunification has been slow. Part of the issue is that Mother has not consistently utilized the opportunities given to rebuild trust. For example, in July 2025, during a custody exchange of our son, I expressly told Mother she was “more than welcome” to get out of the car and talk with A.K. at drop-off. Unfortunately, Mother stayed in her vehicle and made no attempt to speak to A.K. or even congratulate A.K. on a recent achievement she’d had. Our daughter later texted me, upset, saying that Mother “never got out of the car and spoke with me… never congratulated me for doing good at cheer camp”. Incidents like this have reinforced A.K.’s reluctance and lack of trust. I share this not to cast blame, but to illustrate the reality that A.K. is still not emotionally ready for unsupervised, extended visitation with Mother. I filed the Motion to Set Aside Court-Ordered Holiday Visitation because I genuinely fear for my daughter’s mental and emotional welfare if she is forced into a prolonged holiday visit at this time. It is my understanding that the holiday visitation in question would require A.K. to be in Mother’s custody for an extended period (overnight). Given the current state of A.K.’s anxiety and the incomplete reunification process, I truly believe such a visit, if imposed now, would do more harm than good. This is not out of spite or ill will toward Mother – it is out of concern for our child’s best interests. I am simply asking the Court to consider A.K.’s present emotional needs and comfort level, which all of the above facts bear out. I stand ready to continue facilitating reunification in a gradual, therapeutic manner as originally envisioned by Judge Perryman. My only goal is to ensure that when A.K. does spend extended time alone with Mother, it is safe and positive for her. Until the professionals involved (such as a new reunification counselor or A.K.’s individual therapist) feel that A.K. is ready, I believe it is prudent to pause or adjust any court-ordered visitation that might put A.K. in a damaging situation.",
  "source_metadata": {
    "method": "python-docx",
    "size": 22720,
    "modified_time": 1767929814.0
  },
  "modified_time": 1767929814.0
}