{
  "doc_id": "c5cf595d834e7ce882e7857d6763d3bddbf38b87278da9eab19300bc45447a62",
  "file_path": "C:\\Users\\blain\\Dropbox\\Master_Court_Files\\14_Discovery\\2025-09-30_Discovery_Answers.pdf",
  "file_name": "2025-09-30_Discovery_Answers.pdf",
  "doc_type": "pdf",
  "date": null,
  "parties": [],
  "raw_text": "IN THE CIRCUIT COURT OF TALLAPOOSA COUNTY, ALABAMA\nALEXANDER CITY DIVISION\nCHRISTOPHER BLAINE MCGREGOR )\n)\nPLAINTIFF )\n)\nv. ) CASE NO. DR-2023-900051.01\n)\nBRITTANY MICHELLE GILLILAND )\n)\nDEFENDANT )\nPLAINTIFF’S SUPPLEMENTAL RESPONSES TO DEFENDANT’S\nCONSOLIDATED INTERROGATORIES AND REQUESTS FOR PRODUCTION\nComes now the Plaintiff/Father, Christopher Blaine McGregor, by and through his\nattorney of record, Dianne James Davis, and submits the following Supplemental Responses to\nPlaintiff’s Consolidated Interrogatories and Requests for Production:\nINTERROGATORIES\n1) Describe in detail each instance since February 27, 2024, in which you did not\nallow the Petitioner/Mother, Brittany Michelle Gilliland, her scheduled visitation rights with the\nminor children A.K. and B.M.\nResponse: Brittany does have her scheduled visitation with our son, B.M.\nbut our daughter, A.K., has not been ready to spend time with her mother, due to\nBrittany’s own past and present actions. Additionally, according to the court transcript,\nthe Court stated as follows:\n“All right. As y'all know, me and the attorneys have spoken\nwith the little girl, and for whatever reason, she feels the things\nshe does. You know, we're going to try to get to the bottom of it\nand see what we can do to work through this and get relationships\nbetter. You know, temporarily, we're going to go with lunches,\ndinners, family, all of you together and try to get to where visitation\ngets normalized.”\nBrittany has failed to attend Court ordered family dinners, and on at least one\noccasion, she chose to sit at another table and would not even speak to A.K., despite A.K.\nasking her mother to sit at her table. Brittany has never approached A.K. during pick up\nand drop off of B.M. for visitation. Brittany has failed to attend events and activities of\nboth children.\nFurther, the Court’s Order of November 6, 2024, regarding the hearing that took\nplace on July 31, 2024, stated as follows:\nFollowing the in camera interview, counsel for both Parties, along with\nthe Court, agreed that proceeding with the show cause hearing was not\nappropriate at this time.\nAdditionally, when we used to meet Brittany at the police station for visitation\nexchanges, the police would talk to A.K. and would decide not to force her to go with her\nmother. There was only one occasion in which the policewoman, Sheronda Cross, forced\nA.K. to get in the car with her mother. There have been times when I have had to give\nBrittany gas money during her visitation periods with B.M. and have had to DoorDash\nfood to her home because she had no food or money. I have consistently attempted to work\nwith Brittany. Brittany’s actions are a complete contradiction of her words in which she\nhas claimed that she wanted to spend time with A.K. and work on their relationship.\n2) List all communications you have had with the children's school or educational\ninstitution concerning Brittany Gilliland and provide the content of such communications.\nResponse: On February 19, 2025, I emailed Lisa Morgan (ATB/School Pickup\nCoordinator) and provided the signed court order confirming joint legal custody of the\nminor children with primary physical custody to me, and the requirement that pickup lists\ncannot be altered without agreement. Email stated: “We can’t agree on adding individuals\nto the pickup list for school or ATB so nothing is to be changed unless we agree”. Brittany\nwanted to add Bradley Cleckler to the pick-up list.\nOn August 8th, 2025, when Brittany again attempted to pick up on days not\nawarded by the April 14,2025 Temporary Order, I requested clarification from the Court\nto ensure Brittany did not cause any scenes at the school. Once the Court provide the\nClarification Order on August 7th, 2025, I emailed the school with the clarification order\nthat was issued & calendars showing which parent had custody during that period so\nadministrators would have written confirmation directly from the. These calendars were\nprovided to avoid confusion and ensure the school only released the children in accordance\nwith the order.\nOn August 27th, 2025, I had a conversation with B.M.’s teacher about him\ncontinuing to struggle in school with signs of ADHD. I forwarded Brittany the message &\ninformation via text on the same day.\nI have had many conversations with the children’s teachers throughout the years\nand cannot recall the content of each conversation. However, they were all concerning the\nchildren. Attached are email exchanges with the schools and/or teachers.\n4) Please detail any reasons and the factual basis for why you prevented Brittany\nGilliland from picking up A.K. from school as stipulated in the Final Decree of Divorce.\nResponse: I never prevented Brittany Gilliland from picking up A.K. from\nschool.\n7) Please state all facts that support your accusations made against Brittany Gilliland\nof causing physical harm to A.K. or any of the minor children.\nResponse: Plaintiff/Respondent objects to this request as irrelevant and not\nlikely to lead to relevant information. Without waiving said objection, the\nPlaintiff/Respondent states that all facts, testimony, including A.K.’s testimony, have\npreviously been presented and are part of the Court record. Plaintiff/Respondent has\nviewed marks and/or bruises on A.K. and, when questioned, A.K. admitted that her mother\ncaused them and explained what happened. On one such occasion, Plaintiff/Respondent\nviewed a mark on A.K. and, when questioned about it, A.K. stated that her mother was\nspanking her with a belt and hit her with the belt buckle. Plaintiff/Respondent filed for\ndivorce the following day. On another occasion, Plaintiff/Respondent witnessed an incident\nthat occurred at Easter wherein the Defendant/Petitioner came to pick up the children.\nWhen the Defendant/Petitioner attempted to hug A.K., A.K. tried to pull away but\nDefendant/Petitioner dug her fingernails into A.K.’s arm. Plaintiff/Respondent filed a\npolice report and later, the school called DHR. A.K.’s teacher asked what happened to\nA.K.’s arm & A.K. told her. DHR was called to the school, and they spoke with A.K., then\ncame to Plaintiff/Respondent’s residence and asked him what happened. A.K. has told me,\nafter confirming that her mother abused her, she used to lock her door at night to prevent\nher mother from coming in. Her mother told her no one would believe her if she told them\nher mother was abusing her. This broke my heart as a parent that I did not protect her\nuntil the day I filed for divorce.\n8) If you have conducted any surveillance, including but not limited to electronic\nsurveillance (electronic surveillance being defined as the interception of any voice\ncommunication made by the Mother by electronically recording the same or by listening in on\nany voice communication made by the Mother), of the Mother, or had any person or persons\nconduct such surveillance on your behalf, then state what surveillance you have conducted,\nincluding the date, time and place of such surveillance, the method employed for such\nsurveillance, the person conducting such surveillance, including the name and address of such\nperson, whether said surveillance was recorded, whether a written transcript or report have been\nmade of such surveillance, and the details of what was observed and/or the details of the\nconversations that were intercepted or recorded, regardless of whether you intend to use such\ndocumentation at trial. This includes anything related to rebuttal or impeachment.\nResponse: As previously stated, I have never conducted any surveillance on\nBrittany.\n10) Please provide a detailed list of the personal property items you have failed to\ndistribute to Brittany Gilliland per the Final Decree of Divorce, including but not limited to wall\ndécor, bedroom lamps, memory boxes, and clothing.\nResponse: Attached are photos but it was far too many items for me to list. As\npreviously stated, I gave Brittany all personal property she was supposed to have.\n13) Please state the last-known date that A.K., a Minor Child, engaged in visitation\nwith Mother, pursuant to the original Divorce Decree. Please provide explanations for specific\ninstances where Mother was denied visitation, if there are such instances.\nResponse: As previously stated, the last known date that A.K. had court ordered\nvisitation with her mother was on May 12, 2024, for Mother’s Day. I met Brittany at the\nACPD to do custody exchange. Also, I and A.K. have attended the court ordered family\ndinners whereas Brittany has failed to participate in several of the said family dinners. I\nhave never personally refused to allow AK to visit with her mother.\nREQUESTS FOR PRODUCTION\n1) Please provide documents or communications demonstrating the reasons for any\ndenial of visitation rights to Brittany Gilliland since February 27, 2024.\nResponse: As previously stated, Plaintiff has no such documents or\ncommunications in which he personally denied Brittany her visitation rights. However,\nattached are text messages wherein visitation was discussed. Additionally, attached are\ncharts and lists of activities, medical visits, and Sunday dinners in which Brittany did not\nattend.\n2) Please provide all correspondence, emails, texts, and written notes between you\nand the children’s school or educational institutions regarding Brittany Gilliland.\nResponse: Plaintiff/Respondent objects to this request on the grounds that it fails\nto designate a specific time-period. Without waiving said objection, attached are the text\nmessages, emails, and the like that the Plaintiff/Respondent could locate.\n3) Please provide any recordings, videos, or other electronic evidence that\ndemonstrates interactions between you and the minor children wherein Brittany Gilliland was\ndiscussed.\nResponse: Plaintiff/Respondent objects to this request on the grounds that it fails\nto designate a specific time-period. Without waiving said objection, attached are\nrecordings and the like that Plaintiff/Respondent could locate.\n5) Produce copies of all photos, videos, CDs or other evidence you have in this case,\neven if you do not plan on using it at trial or any other proceeding of this action. This includes\nany rebuttal and/or impeachment evidence.\nResponse: Please see attached.\n7) Please provide any and all bank statements, passbooks, certificates of deposit, or\nother written memoranda of any kind and description reflecting ownership by you in whole or in\npart, legal or equitable, of any savings account or bank account or account in any financial\ninstitution, including, but not limited to, savings and loan associations, credit unions, banks or\naccounts maintained with any brokerage firm from the last three years.\nResponse: Plaintiff/Respondent objects to this request on the grounds that it\nseeks discovery that is barred by the automatic stay under 11 U.S.C. §362(a).\nPlaintiff/Respondent further objects to this request as not discoverable nor relevant\npursuant to the automatic stay. The Defendant/Petitioner is a creditor in\nPlaintiff/Respondent’s Chapter 13 case by virtue of the equity obligation, and her counsel\nalready has access to all schedules, statements, and supporting financial documentation\nthrough the Bankruptcy Court. Furthermore, since Defendant/Petitioner is a creditor in\nthe Chapter 13 case, she has full access to Plaintiff/Respondent’s financial records.\nSubmitted this the 29th day of September, 2025.\n/s/Dianne James Davis\nDianne James Davis (DAV007)\nAttorney for Plaintiff/Father\n107 Main Street\nAlexander City, AL 35010\n(256) 392-3172\n(256) 392-3578 (facsimile)\ndianne@diannedavislaw.com\nCertificate of Service\nI hereby certify that I have served a copy of the foregoing upon the following via\nelectronic filing with the AlaCourt E-File System and/or by placing a copy of the same, properly\naddressed and postage paid in the U.S. Mail on this the 29th day of September, 2025.\nBarbara H. Agricola\n127 South 8th Street\nOpelika, AL 36801\n/s/Dianne James Davis\nOf Counsel",
  "source_metadata": {
    "method": "pdfplumber",
    "pages": 6
  },
  "modified_time": 1759361014.0
}