{
  "doc_id": "d07dac42c814e21741546be3c7cfb1210de7796fe0d36e6e5857a996cc2db8fa",
  "file_path": "C:\\Users\\blain\\Dropbox\\Master_Court_Files\\19_Bankruptcy_Chapter_13\\Bankruptcy Transcript .pdf",
  "file_name": "Bankruptcy Transcript .pdf",
  "doc_type": "pdf",
  "date": null,
  "parties": [],
  "raw_text": "Case 3:25-cv-00721-BL Document 2-25 Filed 10/15/25 Page 1 of 44\nUNITED STATES BANKRUPTCY COURT\nMIDDLE DISTRICT OF ALABAMA (OPELIKA)\n.\nIN RE: . Case No. 24-81152\n. Chapter 13\nCHRISTOPHER BLAINE MCGREGOR, .\n. 701 Avenue A\n. Opelika, AL 36801\nDebtor. .\n. Wednesday, July 16, 2025\n. . . . . . . . . . . . . . . . 11:05 a.m.\nTRANSCRIPT OF CONFIRMATION HEARING\nBEFORE THE HONORABLE BESS P. CRESSWELL\nUNITED STATES BANKRUPTCY COURT JUDGE\nAPPEARANCES:\nFor the Debtor: Ingrum & Layson, LLC\nBy: CHARLES M. INGRUM, JR., ESQ.\nP.O. Box 229\nOpelika, AL 36803\n(334) 745-3333\nFor the Chapter 13 Sabrina McKinney, Chapter 13 Trustee\nTrustee: By: SHAVON RICHARDSON, ESQ.\nP.O. Box 173\nMontgomery, AL 36101\n(334) 262-8371\nFor Creditor, Brittany Agricola Law, LLC\nGilliland: By: ALGERT S. AGRICOLA, ESQ.\n127 South 8th Street\nOpelika, AL 36801\n(334) 759-7557\nAudio Operator: Rhonda King, ECRO\nTranscription Company: Access Transcripts, LLC\n10110 Youngwood Lane\nFishers, IN 46048\n(855) 873-2223\nwww.accesstranscripts.com\nProceedings recorded by electronic sound recording,\ntranscript produced by transcription service.\n1\nCase 24-81152 Doc 102 Filed 10/14/25 Entered 10/14/25 14:48:56 Desc Main\nACCESS TRANSCRIPTS, LLC 1-855-USE-ACCESS (873-2223)\nDocument Page 1 of 44\nCase 3:25-cv-00721-BL Document 2-25 Filed 10/15/25 Page 2 of 44\n2\nI N D E X\n7/16/25\nWITNESSES DIRECT CROSS REDIRECT RECROSS\nFOR THE CREDITOR:\nBrittany Gilliland 14 18 21/22 22\nChristopher McGregor 23 27 -- --\nEXHIBITS ADMITTED\nCreditor's Exhibit 1 15\nCreditor's Exhibit 2 16\nCase 24-81152 Doc 102 Filed 10/14/25 Entered 10/14/25 14:48:56 Desc Main\nACCESS TRANSCRIPTS, LLC 1-855-USE-ACCESS (873-2223)\nDocument Page 2 of 44\nCase 3:25-cv-00721-BL Document 2-25 Filed 10/15/25 Page 3 of 44\n3\n1 (Proceedings commence at 11:05 a.m.)\n2 THE COURT: Okay. Now, is anyone -- I do have the\n3 eleven o'clock. Anyone in here for any other matter that's not\n4 the Christopher McGregor matter?\n5 Okay. All right, then. Let's proceed. Case Number\n6 24-81152, Christopher McGregor, Matter Number 273. We're on a\n7 confirmation hearing and objection to claim. Let me have\n8 appearances.\n9 MS. RICHARDSON: Shavon Richardson for the Trustee,\n10 Your Honor.\n11 MR. AGRICOLA: Al Agricola for the creditor.\n12 THE COURT: Okay.\n13 MR. INGRUM: Charles Ingrum, Junior, for the debtor.\n14 And I have Emiley Parr, who's a third-year card intern --\n15 THE COURT: Okay.\n16 MR. INGRUM: -- that's with -- she's just going to be\n17 there.\n18 THE COURT: Okay. Thank you. Anyone else need to\n19 make an appearance? Okay. All right. So I guess I will hear\n20 from Mr. Agricola or Mr. Ingrum about how we need to proceed\n21 today. I'm assuming it has not been resolved and we are going\n22 forward?\n23 MR. INGRUM: That's correct. Your Honor, as the\n24 Court's aware, in an objection to claim, it's a shifting\n25 burden. I cited two cases in the debtor's trial notebook. One\nCase 24-81152 Doc 102 Filed 10/14/25 Entered 10/14/25 14:48:56 Desc Main\nACCESS TRANSCRIPTS, LLC 1-855-USE-ACCESS (873-2223)\nDocument Page 3 of 44\nCase 3:25-cv-00721-BL Document 2-25 Filed 10/15/25 Page 4 of 44\n4\n1 is a Middle District of Alabama case, which cites to the Third\n2 Circuit. It states that -- and both the cases said the same\n3 thing. I cited an Eleventh Circuit one just so there was an\n4 Eleventh Circuit case.\n5 But when a proof of claim is filed, there's a prima\n6 facie case that the claim is correct. The burden then shifts\n7 to the debtor to have some type of valid objection. It can't\n8 be because we don't like it. It has to be some reason like\n9 it's filed late, as in this case, it's miscategorized, just\n10 like in this case.\n11 At which point, the burden shifts back to the\n12 creditor to prove the claim. And as Judge Williams stated in\n13 the Middle District case, ultimately, the creditor has to prove\n14 the claim.\n15 So with that being the case, I believe we have met\n16 our burden to shift back to the creditor for them to put on\n17 their case to explain why their claim should be allowed as late\n18 filed and priority.\n19 THE COURT: All right. Okay.\n20 MR. AGRICOLA: And, Judge, just to respond briefly.\n21 We filed on March 31st of this year, a response to the debtor's\n22 new objection to our Claim Number 19, which was that it was\n23 late. And we have provided with that document, an argument\n24 that the petition was filed on September 20th, 2024. Seventy\n25 days after that would have been November 29th, 2024, which was\nCase 24-81152 Doc 102 Filed 10/14/25 Entered 10/14/25 14:48:56 Desc Main\nACCESS TRANSCRIPTS, LLC 1-855-USE-ACCESS (873-2223)\nDocument Page 4 of 44\nCase 3:25-cv-00721-BL Document 2-25 Filed 10/15/25 Page 5 of 44\n5\n1 the Friday following Thanksgiving Day.\n2 Under Federal Bankruptcy Rule 9006(a)(6)(C), a legal\n3 holiday means for periods that are measured after an event, any\n4 other day declared a holiday by the state where the district\n5 court is located. Bankruptcy Rule 3002(c) measures the date\n6 for the filing of a proof of claim 70 days after the order for\n7 relief or entry of an order converting the case to Chapter 12\n8 or 13.\n9 And on May 20th, 2024, Governor Kay Ivey declared\n10 November 29, 2024 the day after Thanksgiving, a state holiday.\n11 We attached a copy of the governor's memorandum dated May 20th,\n12 2024 to all state department heads regarding state holiday\n13 schedule, which designated November 29 as a state holiday.\n14 The creditor's claim was filed on Monday, December 2,\n15 which was the first business day following November 29, 2024,\n16 and we assert that, as a matter of law, that filing was timely.\n17 THE COURT: Okay. Let me take up that issue first.\n18 And I think that's just an argument issue so we don't really\n19 need -- I mean, I know you want to submit the documents, so I'm\n20 going to -- I'm going to address the exhibits as well. But --\n21 okay.\n22 I am -- I've read this Alabama statute, so I'm aware\n23 of the code section that sets forth the holiday and authorizes\n24 the Governor to issue any holiday she deems, you know,\n25 appropriate. That is Alabama Code Section 1-3-8.\nCase 24-81152 Doc 102 Filed 10/14/25 Entered 10/14/25 14:48:56 Desc Main\nACCESS TRANSCRIPTS, LLC 1-855-USE-ACCESS (873-2223)\nDocument Page 5 of 44\nCase 3:25-cv-00721-BL Document 2-25 Filed 10/15/25 Page 6 of 44\n6\n1 And with that, I was surprised to learn that\n2 Thanksgiving is not actually in the Code, that it has to be\n3 specially set by the Governor. And so I guess my question for\n4 both of you to allow -- what satisfies the language under the\n5 Alabama Code is what I need to know. So the code section\n6 reads, -- let me see if I can find it. I do have it. Give me\n7 just a second.\n8 MR. INGRUM: Your Honor, that's in our trial\n9 notebook. One of the tabs has the section.\n10 THE COURT: Does Mr. Agricola have a copy of this\n11 notebook?\n12 MR. INGRUM: No.\n13 THE COURT: He needs to have a copy.\n14 MR. INGRUM: Sure.\n15 THE COURT: Thank you. And I have admitted nothing\n16 in here yet, just so you know, Mr. Agricola. It's just a copy.\n17 We'll go to what can be admitted later in just a second.\n18 MR. INGRUM: Your Honor, can I get the page?\n19 THE COURT: Okay. Let me find my language here. I\n20 think I had the language highlighted in my tab, so I need to\n21 find mine that I was talking about.\n22 MR. INGRUM: Your Honor, it's going to be 1-3-8,\n23 Subsection (a), Subsection (12).\n24 THE COURT: 1-3-8. Okay. I think that this -- okay.\n25 Here's the issue with what you provided. I think that's 2025,\nCase 24-81152 Doc 102 Filed 10/14/25 Entered 10/14/25 14:48:56 Desc Main\nACCESS TRANSCRIPTS, LLC 1-855-USE-ACCESS (873-2223)\nDocument Page 6 of 44\nCase 3:25-cv-00721-BL Document 2-25 Filed 10/15/25 Page 7 of 44\n7\n1 and it was changed. The 2024 code reads a little bit\n2 differently.\n3 MR. INGRUM: Yeah, I did pull up the latest -- that\n4 Lexis had to offer, so.\n5 THE COURT: Okay. So that's 2025.\n6 MR. INGRUM: Okay.\n7 THE COURT: So we need to look at 2024. Okay. And\n8 it says, okay. Holidays enumerated, personal leave days, state\n9 holidays observed by the closing of state offices, and\n10 compensatory leave days. Sunday, Christmas Day, New Year's\n11 Day, Martin Luther King Junior's birthday, Robert E. Lee's\n12 birthday, George Washington's birthday, Thomas Jefferson's\n13 birthday, Confederate Memorial, National Memorial Day,\n14 Jefferson Davis' birthday, the 4th of July, Labor Day, Columbus\n15 Day, and Fraternal Day, and Veterans' Day, and American\n16 Heritage Day.\n17 And here's the important language: And the day\n18 designated by the Governor for public Thanksgiving shall each\n19 be deemed a holiday. And then, if any holiday falls on a\n20 Sunday, the following day is the holiday. Okay.\n21 So then the question becomes, how does the Governor\n22 designate the holiday -- the Thanksgiving holiday? That's what\n23 I need you all to answer for me. Is it -- well, that's what I\n24 need you to answer for me.\n25 MR. AGRICOLA: Well, Judge, all I can tell you is the\nCase 24-81152 Doc 102 Filed 10/14/25 Entered 10/14/25 14:48:56 Desc Main\nACCESS TRANSCRIPTS, LLC 1-855-USE-ACCESS (873-2223)\nDocument Page 7 of 44\nCase 3:25-cv-00721-BL Document 2-25 Filed 10/15/25 Page 8 of 44\n8\n1 way the governor did it in 2024, and it was by issuance of a\n2 memorandum dated May 20th, 2024, setting the holiday schedule\n3 to include Friday, November 29, 2024. And I do have a\n4 certification to go with the May 20, 2024, memorandum that\n5 certifies the document as a true and correct copy of the\n6 memorandum from the governor's special assistant to the general\n7 counsel in the office of the governor, Pam Chestnut.\n8 THE COURT: Okay. All right. I'll let you --\n9 MR. INGRUM: Your Honor, I haven't seen the -- I have\n10 not seen the certification until now.\n11 MR. AGRICOLA: Well, now you have it.\n12 THE COURT: Okay.\n13 MR. INGRUM: Grabbed the research file this morning,\n14 Your Honor.\n15 THE COURT: Okay. And I know that you have objected\n16 in your statement to the admission of this memorandum. So I\n17 guess let's go back and let's go over the exhibits first to see\n18 what we're going to enter, what is going to be admissible, and\n19 then we might -- we can pick this up.\n20 I know what both of your arguments are, I think.\n21 Yours -- go ahead. You haven't made yours. I think I\n22 understand yours from your --\n23 MR. INGRUM: Yeah. Your Honor, my argument is the\n24 state's legislature controls, and in this instance, the state\n25 legislature says the governor shall choose what day, singular,\nCase 24-81152 Doc 102 Filed 10/14/25 Entered 10/14/25 14:48:56 Desc Main\nACCESS TRANSCRIPTS, LLC 1-855-USE-ACCESS (873-2223)\nDocument Page 8 of 44\nCase 3:25-cv-00721-BL Document 2-25 Filed 10/15/25 Page 9 of 44\n9\n1 to choose as Thanksgiving Day. We submitted a copy of the\n2 proclamation under seal, which qualifies under self-\n3 authentication under Federal Rule of Evidence 9021. And the\n4 Governor designates Thanksgiving Day as that Thursday.\n5 When the clerk sets the proof of claim bar date, it's\n6 70 days after the filing of the case, which is convenient,\n7 because if you file the case on a Wednesday, the proof of claim\n8 bar date becomes a Wednesday. If it's filed on a Thursday, it\n9 falls on the next Thursday.\n10 Well, any case we filed 70 days out from\n11 Thanksgiving, the clerk ignored Thanksgiving Day and set the\n12 date to file the proof of claim as Friday. Any case filed on\n13 Friday was also set for that Friday, the day after\n14 Thanksgiving. If you file a case on Saturday or Sunday, and it\n15 falls on a Saturday or Sunday, the clerk says the proof of\n16 claim bar date's the next Monday. If you file it and that 70th\n17 day happens to fall on a Monday -- you filed on a Monday, and\n18 it falls on a state holiday Monday, the clerk automatically\n19 sets it for the next day.\n20 So the clerk in this case, set proof of claim\n21 deadline for the Thursday -- or the Friday following\n22 Thanksgiving. The state legislature in the code section states\n23 that the governor shall declare which day is Thanksgiving Day.\n24 We have a proclamation under seal from the governor that states\n25 that Thanksgiving Day, that Thursday is the day observed for\nCase 24-81152 Doc 102 Filed 10/14/25 Entered 10/14/25 14:48:56 Desc Main\nACCESS TRANSCRIPTS, LLC 1-855-USE-ACCESS (873-2223)\nDocument Page 9 of 44\nCase 3:25-cv-00721-BL Document 2-25 Filed 10/15/25 Page 10 of 44\n10\n1 Thanksgiving.\n2 Now, they have submitted a memorandum, which I was\n3 prepared to object to because it was not self-authenticating\n4 under 902. They have gotten this morning certification from\n5 counsel at the governor's office. I would still say that that\n6 is a memorandum for what day state employees can have off. It\n7 sets a couple of days, not a singular day.\n8 There was a case that we cite. It's Duffy v. Dwyer.\n9 It's a Ninth Circuit Court of Appeals case in which there was a\n10 dispute between husband and ex-wife, and one of the spouses\n11 files the claim on Black Friday, on the Friday following\n12 Thanksgiving. It was actually an adversary proceeding to\n13 determine dischargeability.\n14 In the Ninth Circuit Bankruptcy Appellate Panel's\n15 decision, they look at a variety of things, but they say,\n16 ultimately, it's the state legislature that decides. There was\n17 an instance where the courts were closed due to an earthquake,\n18 and the Chief Justice declared all the courts closed due to an\n19 earthquake. They said that wasn't good enough. The state\n20 legislature didn't ordain it.\n21 There was an instance where the governor shut down in\n22 Kansas. They cited a case where the governor took it upon\n23 themselves to shut the courts down for some reason, but the\n24 state legislature did not back it.\n25 So in this case, I would state that just because the\nCase 24-81152 Doc 102 Filed 10/14/25 Entered 10/14/25 14:48:56 Desc Main\nACCESS TRANSCRIPTS, LLC 1-855-USE-ACCESS (873-2223)\nDocument Page 10 of 44\nCase 3:25-cv-00721-BL Document 2-25 Filed 10/15/25 Page 11 of 44\n11\n1 governor or one of the state offices closed in a memorandum,\n2 that's a separate issue than an under-seal proclamation that\n3 designates one day as the observance of Thanksgiving holiday.\n4 In the annotations to the code section of Alabama, it\n5 states that legal proceedings may still continue. You can\n6 still foreclose on somebody on that day. They state that the\n7 primary purpose is for commercial banking, I believe, in the\n8 annotations.\n9 So there's no -- I don't know what bolsters their\n10 claim any more than a separate memorandum, not under seal --\n11 said the state offices were closed. That does not make it a\n12 state holiday. It's the state legislature which ordained one\n13 day Thanksgiving Day, singular.\n14 THE COURT: Okay.\n15 MR. AGRICOLA: May I respond to that?\n16 THE COURT: Yes.\n17 MR. AGRICOLA: Well, the memorandum says, holiday\n18 schedule, and it says, I have authorized the following holiday\n19 schedule for state employees. And it designates Friday,\n20 November 29th, 2024. I don't really think this Court can tell\n21 the governor that she didn't properly designate a state\n22 holiday.\n23 I realize that the federal system does not recognize\n24 Friday, November 29, 2024 as a state holiday, but the federal\n25 rule references any holiday declared by the state in which the\nCase 24-81152 Doc 102 Filed 10/14/25 Entered 10/14/25 14:48:56 Desc Main\nACCESS TRANSCRIPTS, LLC 1-855-USE-ACCESS (873-2223)\nDocument Page 11 of 44\nCase 3:25-cv-00721-BL Document 2-25 Filed 10/15/25 Page 12 of 44\n12\n1 district court is located.\n2 THE COURT: Okay. All right. Let's talk about the\n3 exhibits. Then I -- let's see. Let's see. I have Creditor's\n4 Exhibits -- Exhibit 1, which is the final decree of divorce.\n5 You also have that as your exhibit?\n6 MR. INGRUM: That's correct. No objection.\n7 THE COURT: Okay. So that will be admitted. We'll\n8 come back to the CS-42 form because that's in -- with regards\n9 to the other -- to the next issue. All right. With regards to\n10 the Governor's holiday schedule, I saw that there was an\n11 objection as to relevancy. But I guess I will --\n12 MR. INGRUM: Well, Your Honor -- and Mr. Agricola and\n13 I met on Monday, and they did not -- they had to file their\n14 stuff. And I told Mr. Agricola, that -- that's fine. I know\n15 what you're going to file. I wasn't going to -- I didn't have\n16 a problem with that.\n17 But I'm -- I was objecting to something that hadn't\n18 been put into evidence. So I had no idea. I was just blindly\n19 guessing at it. In my preparation today, I was going to object\n20 to the memorandum that was attached to their answer, which I\n21 was made known of, but it wasn't certified until this morning.\n22 So I was prepared to reject under 902, self-authentication,\n23 because that's what we were doing until this morning.\n24 THE COURT: Okay. Well, I do find it relevant. And\n25 if it's been authenticated, I understand the last-minute\nCase 24-81152 Doc 102 Filed 10/14/25 Entered 10/14/25 14:48:56 Desc Main\nACCESS TRANSCRIPTS, LLC 1-855-USE-ACCESS (873-2223)\nDocument Page 12 of 44\nCase 3:25-cv-00721-BL Document 2-25 Filed 10/15/25 Page 13 of 44\n13\n1 concern you have, but I'd rather just get to the issue.\n2 MR. INGRUM: Sure.\n3 THE COURT: And so I'm going to allow it to be\n4 admitted. I do need to see -- I need a copy of the\n5 certification because I don't have that.\n6 MR. AGRICOLA: Yes, ma'am.\n7 THE COURT: Okay. Thank you.\n8 MR. AGRICOLA: It's the last page, Judge.\n9 THE COURT: Thank you. All right. And now let's\n10 look at the debtor's exhibit list. I think there was the\n11 divorce decree. Again, that's admitted. And then the\n12 proclamation.\n13 MR. AGRICOLA: Well, Judge, we just say that it's\n14 really not relevant because the bar date was not November 28th,\n15 which was Thanksgiving Day. It was November 29th, which was,\n16 we say, a legal holiday declared in our county. So I mean, we\n17 don't dispute that November 28th was Thanksgiving Day.\n18 THE COURT: Okay. Well, I do find it relevant.\n19 Again, I'd rather just -- we'll get to the issue, but -- so I\n20 will admit it. Okay. And I'm going to take all of that under\n21 advisement as to the timeliness objection. But since we're all\n22 here -- I'm assuming your witnesses are all here today? All\n23 right. So we need to go on and put the other evidence in\n24 regarding the substance of the claim.\n25 So all right. Go ahead. It's your burden. I'll let\nCase 24-81152 Doc 102 Filed 10/14/25 Entered 10/14/25 14:48:56 Desc Main\nACCESS TRANSCRIPTS, LLC 1-855-USE-ACCESS (873-2223)\nDocument Page 13 of 44\nCase 3:25-cv-00721-BL Document 2-25 Filed 10/15/25 Page 14 of 44\nGilliland - Direct 14\n1 you start.\n2 MR. AGRICOLA: We call Brittany Gilliland.\n3 BRITTANY GILLILAND, CREDITOR'S WITNESS, SWORN\n4 THE COURT: It' okay. Can you just give us one\n5 minute to get --\n6 MR. AGRICOLA: Sure.\n7 THE COURT: -- we had to shuffle around. So give us\n8 just a second. All right. Go ahead.\n9 DIRECT EXAMINATION\n10 BY MR. AGRICOLA:\n11 Q Would you state your name, please, ma'am?\n12 A Brittany Gilliland.\n13 Q Were you and your former husband divorced on February\n14 27th, 2024, following a trial before the Tallapoosa Circuit\n15 Court, Alexander City Division, by the entry of a final decree\n16 of divorce?\n17 A Yes.\n18 Q Does the final decree of divorce order your former husband\n19 to pay you one-half of the equity in the marital residence,\n20 which is equal to $51,411.21?\n21 A Yes.\n22 Q Was said amount ordered to be paid as follows: $10,000\n23 within ten days of the entry of the final decree of divorce,\n24 followed by monthly payments of $2,000 per month for 21\n25 consecutive months, beginning April 1st, 2024?\nCase 24-81152 Doc 102 Filed 10/14/25 Entered 10/14/25 14:48:56 Desc Main\nACCESS TRANSCRIPTS, LLC 1-855-USE-ACCESS (873-2223)\nDocument Page 14 of 44\nCase 3:25-cv-00721-BL Document 2-25 Filed 10/15/25 Page 15 of 44\nGilliland - Direct 15\n1 A Yes. That's correct.\n2 Q Did the divorce decree deny both parties alimony?\n3 A Yes.\n4 Q I'm showing you now a document marked as Creditor's\n5 Exhibit 1. Do you recognize that document?\n6 A Yes.\n7 Q Is that the final decree of divorce entered in your\n8 divorce case?\n9 A Yes, that's correct.\n10 MR. AGRICOLA: And we offer Creditor's Exhibit 1,\n11 Your Honor.\n12 THE COURT: It's been admitted.\n13 (Creditor's Exhibit 1 admitted into evidence)\n14 BY MR. AGRICOLA:\n15 Q I'm showing you now a document that's marked as Creditor's\n16 Exhibit 2. Do you recognize Creditor's Exhibit 2?\n17 A Yes.\n18 Q Is that the CS-42 form that was filed in your divorce\n19 case, which shows that you received income of $1,733 per month\n20 and that your former husband received income of $8,870 per\n21 month?\n22 A Yes.\n23 MR. AGRICOLA: We offer Creditor's Exhibit 2, Your\n24 Honor.\n25 THE COURT: Okay. Mr. Ingrum is standing, so --\nCase 24-81152 Doc 102 Filed 10/14/25 Entered 10/14/25 14:48:56 Desc Main\nACCESS TRANSCRIPTS, LLC 1-855-USE-ACCESS (873-2223)\nDocument Page 15 of 44\nCase 3:25-cv-00721-BL Document 2-25 Filed 10/15/25 Page 16 of 44\nGilliland - Direct 16\n1 MR. INGRUM: No objection, Your Honor.\n2 THE COURT: All right. It's admitted.\n3 (Creditor's Exhibit 2 admitted into evidence)\n4 BY MR. AGRICOLA:\n5 Q What is the source of your income?\n6 A World Finance. My employment -- current employment.\n7 Q Do you have any other source of income?\n8 A I do not.\n9 Q How much are your monthly financial obligations?\n10 A 27 -- about 2,780 a month.\n11 Q And has your monthly income changed since the filing of\n12 Creditor's Exhibit 2, the CS-42?\n13 A No, it has not.\n14 Q So it's still 1,733?\n15 A (No verbal response)\n16 Q Following the entry of the final decree of divorce in your\n17 divorce case, did the debtor make payments to you totaling\n18 $20,000?\n19 A Yes.\n20 Q Did those payments leave a balance owing to you of\n21 $32,000?\n22 A Yes.\n23 Q Did those payments stop after the debtor filed his\n24 bankruptcy case?\n25 A Yes.\nCase 24-81152 Doc 102 Filed 10/14/25 Entered 10/14/25 14:48:56 Desc Main\nACCESS TRANSCRIPTS, LLC 1-855-USE-ACCESS (873-2223)\nDocument Page 16 of 44\nCase 3:25-cv-00721-BL Document 2-25 Filed 10/15/25 Page 17 of 44\nGilliland - Direct 17\n1 Q Did you file a claim against the bankruptcy estate of your\n2 former husband, Christopher Blaine McGregor, in this case, for\n3 $32,000?\n4 A Yes.\n5 MR. AGRICOLA: Judge, we request the Court to take\n6 judicial notice of the claim.\n7 THE COURT: Okay.\n8 BY MR. AGRICOLA:\n9 Q Did the divorce action award physical custody of the minor\n10 children to your former husband?\n11 A Yes.\n12 Q As a result of the award of physical custody to your\n13 former husband, are you required to pay child support to your\n14 former husband in the amount of $617 per month?\n15 A Yes.\n16 Q Do you depend on the monthly payment of $2,000 per month,\n17 ordered by the divorce decree, to support your financial\n18 obligations?\n19 A Yes.\n20 Q As a result of your former husband's discontinuing those\n21 $2,000-per-month payments, are you meeting your monthly\n22 financial obligations?\n23 A I'm not.\n24 Q What, if anything, have you done to meet your financial\n25 obligations?\nCase 24-81152 Doc 102 Filed 10/14/25 Entered 10/14/25 14:48:56 Desc Main\nACCESS TRANSCRIPTS, LLC 1-855-USE-ACCESS (873-2223)\nDocument Page 17 of 44\nCase 3:25-cv-00721-BL Document 2-25 Filed 10/15/25 Page 18 of 44\nGilliland - Cross 18\n1 A I've had to take out loans, personal loans.\n2 Q If your former husband's debt to you of $32,000 is\n3 discharged by this Court, how will you support yourself on your\n4 income of $1,733 per month?\n5 A I'm unable to do so.\n6 Q Did you understand that the monthly payments from your\n7 former husband for 21 months, beginning on April 1st, 2024,\n8 were support for you following your divorce?\n9 A Yes.\n10 MR. AGRICOLA: Those are my questions, Your Honor.\n11 MR. INGRUM: I'm sorry, Your Honor.\n12 CROSS-EXAMINATION\n13 BY MR. INGRUM:\n14 Q Ms. Gilliland?\n15 A Yes.\n16 Q Okay. I believe they introduced Defendant's Exhibit 1,\n17 which was the divorce decree. And do you still have that in\n18 front of you?\n19 A I do.\n20 Q And it's my understanding that your ex-husband has primary\n21 physical custody of your children?\n22 A Yes.\n23 Q And you were to pay -- pursuant to Paragraph 16, you were\n24 to pay husband $617 per month child support. Is that correct?\n25 A That's correct.\nCase 24-81152 Doc 102 Filed 10/14/25 Entered 10/14/25 14:48:56 Desc Main\nACCESS TRANSCRIPTS, LLC 1-855-USE-ACCESS (873-2223)\nDocument Page 18 of 44\nCase 3:25-cv-00721-BL Document 2-25 Filed 10/15/25 Page 19 of 44\nGilliland - Cross 19\n1 Q Will you please read to the Court Paragraph 23 of the\n2 divorce decree?\n3 A 23?\n4 Q Yes.\n5 A Neither party is ordered to pay alimony.\n6 Q Okay. Now you stated that despite the fact you paid child\n7 support and neither party is to pay alimony, that you relied on\n8 the $2,000 a month being paid to you by your ex-husband. Is\n9 that correct?\n10 A That -- yeah.\n11 Q What was he paying you money for? What was the reason\n12 behind it in the divorce decree?\n13 A The -- the 2,000?\n14 Q Mm-hmm.\n15 A That was for the equity in the home.\n16 Q Okay.\n17 A Our home (indiscernible).\n18 Q And I believe that's pursuant to Paragraph 7 of the\n19 divorce?\n20 A That's correct.\n21 Q And the first -- will you read the first line of Paragraph\n22 7, please?\n23 A The husband shall pay to the wife one-half of the equity\n24 in residence, which is $51,411.21.\n25 Q Okay. So there's no dispute that the money you were\nCase 24-81152 Doc 102 Filed 10/14/25 Entered 10/14/25 14:48:56 Desc Main\nACCESS TRANSCRIPTS, LLC 1-855-USE-ACCESS (873-2223)\nDocument Page 19 of 44\nCase 3:25-cv-00721-BL Document 2-25 Filed 10/15/25 Page 20 of 44\nGilliland - Cross 20\n1 receiving was for your half of the equity in the marital home?\n2 A It was the -- the equity, yes.\n3 Q Okay. Now, you stated you relied on this $2,000. When\n4 did he have to start paying your -- I believe he had to pay you\n5 $10,000 within ten days of the order?\n6 A That's correct.\n7 Q Okay. So if you were relying on this -- I believe you\n8 submitted Exhibit 2. If you were relying on $2,000 a month as\n9 support, why did you not include that number in your child\n10 support guidelines?\n11 A I didn't have that at the time.\n12 Q But you had it right after the divorce, correct?\n13 A Once the -- the decree was declared in February, yes.\n14 Q Right.\n15 A We were -- we --\n16 Q But you never amended the child support guidelines to\n17 reflect that you had an extra $2,000 that you were relying on\n18 for support?\n19 A The decree -- excuse me, the guidelines were presented\n20 before our final hearing, which was October.\n21 Q Okay. One other question. Who is Bradley Cleckler?\n22 A That's my husband.\n23 Q Okay. So you're remarried?\n24 A Yes, I am.\n25 Q Okay. And you're aware -- or are you aware that in\nCase 24-81152 Doc 102 Filed 10/14/25 Entered 10/14/25 14:48:56 Desc Main\nACCESS TRANSCRIPTS, LLC 1-855-USE-ACCESS (873-2223)\nDocument Page 20 of 44\nCase 3:25-cv-00721-BL Document 2-25 Filed 10/15/25 Page 21 of 44\nGilliland - Redirect 21\n1 Alabama, alimony stops upon remarriage or cohabitation?\n2 A Well, that's the alimony.\n3 Q Right.\n4 A Mm-hmm.\n5 Q Okay. So you are aware of that?\n6 A Yes.\n7 Q And your statement -- and let me make sure I'm clear,\n8 because I don't want to misstate anything. Your statement,\n9 under oath, on the record, is that you believe Mr. McGregor's\n10 payments to you are for support?\n11 A Yes.\n12 Q And you are remarried?\n13 A Yes.\n14 MR. INGRUM: That's all the questions I have, Your\n15 Honor.\n16 REDIRECT EXAMINATION\n17 BY MR. AGRICOLA:\n18 Q Ms. Gilliland, when did you get married?\n19 A February.\n20 Q What date?\n21 A The 3rd.\n22 Q The 3rd?\n23 A Yes.\n24 Q Do you recall when your appeal from the final decree of\n25 divorce was entered?\nCase 24-81152 Doc 102 Filed 10/14/25 Entered 10/14/25 14:48:56 Desc Main\nACCESS TRANSCRIPTS, LLC 1-855-USE-ACCESS (873-2223)\nDocument Page 21 of 44\nCase 3:25-cv-00721-BL Document 2-25 Filed 10/15/25 Page 22 of 44\nGilliland - Recross 22\n1 A I'm -- I'm not aware of the date.\n2 Q Did you get married before or after the appeal was\n3 finalized?\n4 A It was before.\n5 MR. AGRICOLA: That's all, Your Honor.\n6 THE COURT: Okay. All right. Any other -- do you\n7 want to recross? Hold on.\n8 MR. INGRUM: Why not?\n9 RECROSS-EXAMINATION\n10 BY MR. INGRUM:\n11 Q You and your husband are holding yourselves out as husband\n12 and wife? I mean, you let people know that? You all are\n13 living together?\n14 A Yes. We now do that we're married.\n15 Q And you are calling yourselves husband and wife?\n16 A I'm sorry?\n17 Q You do refer to yourselves as husband --\n18 A Yes.\n19 MR. INGRUM: Okay. That's all I have.\n20 FURTHER REDIRECT EXAMINATION\n21 BY MR. AGRICOLA:\n22 Q Ms. Gilliland, you don't contend that you and your husband\n23 are common-law married, do you?\n24 A Common law? No, not at the -- not present.\n25 MR. AGRICOLA: That's all, Your Honor.\nCase 24-81152 Doc 102 Filed 10/14/25 Entered 10/14/25 14:48:56 Desc Main\nACCESS TRANSCRIPTS, LLC 1-855-USE-ACCESS (873-2223)\nDocument Page 22 of 44\nCase 3:25-cv-00721-BL Document 2-25 Filed 10/15/25 Page 23 of 44\nMcGregor - Direct 23\n1 THE COURT: Okay. All right. You can step down.\n2 THE WITNESS: Thank you.\n3 (Witness excused)\n4 THE COURT: Do you have any other witnesses?\n5 MR. AGRICOLA: We call Blaine McGregor.\n6 THE COURT: Okay.\n7 CHRISTOPHER BLAINE MCGREGOR, DEBTOR, SWORN\n8 MR. AGRICOLA: Request leave, Your Honor, to proceed\n9 as an on cross, under Federal Rule of Evidence 611(c).\n10 THE COURT: So granted.\n11 DIRECT EXAMINATION\n12 BY MR. AGRICOLA:\n13 Q Mr. McGregor, I'm showing you now Creditor's Exhibit 1,\n14 which is the final decree of divorce entered in your divorce\n15 case by the Circuit Court of Tallapoosa County on February 27,\n16 2024. Do you recognize that document?\n17 A Yes, sir.\n18 Q Are you familiar with that document?\n19 A Yes, sir.\n20 Q Paragraph 7 of the final decree of divorce requires you to\n21 pay to your former wife the sum of $52,000, representing half\n22 of the equity in the marital residence, correct?\n23 A Yes, sir.\n24 Q And you paid your former wife, pursuant to that provision\n25 of the divorce decree, the sum of $20,000, correct?\nCase 24-81152 Doc 102 Filed 10/14/25 Entered 10/14/25 14:48:56 Desc Main\nACCESS TRANSCRIPTS, LLC 1-855-USE-ACCESS (873-2223)\nDocument Page 23 of 44\nCase 3:25-cv-00721-BL Document 2-25 Filed 10/15/25 Page 24 of 44\nMcGregor - Direct 24\n1 A Yes, sir.\n2 Q You paid your wife $10,000 within ten days of the entry of\n3 the decree, correct?\n4 A Yes, sir.\n5 Q And then you paid $2,000 per month for five months, right?\n6 A Yes, sir.\n7 Q And you stopped making $2,000 monthly payments to your\n8 former wife after you filed your Chapter 13 bankruptcy\n9 petition, correct?\n10 A Yes, sir.\n11 Q I want to direct your attention to the last two sentences\n12 of Paragraph 7 of the final decree of divorce, and I think\n13 that's on Page 2.\n14 Q It says, \"If the husband fails to timely make these\n15 payments, then the house shall be placed on the market for sale\n16 with a licensed real estate agent. Upon sale, the net proceeds\n17 shall be equally divided between the parties.\" Did I read that\n18 right?\n19 A Yes, sir.\n20 Q So you have failed to timely make those payments, right?\n21 A Yes, sir.\n22 Q And you have not placed the house on the market for sale,\n23 have you?\n24 A No, sir.\n25 Q Why?\nCase 24-81152 Doc 102 Filed 10/14/25 Entered 10/14/25 14:48:56 Desc Main\nACCESS TRANSCRIPTS, LLC 1-855-USE-ACCESS (873-2223)\nDocument Page 24 of 44\nCase 3:25-cv-00721-BL Document 2-25 Filed 10/15/25 Page 25 of 44\nMcGregor - Direct 25\n1 A Because when we were going through the divorce, it was\n2 still -- my intention was to pay, right? But the -- the -- the\n3 debt was just -- I got -- we -- when all the debt was put on\n4 me, all the IRS debt and the credit card debt from our very\n5 drawn-out, still ongoing family court matters. And there was\n6 just no way to pay it off.\n7 Q Well, my question is, why haven't you placed the house on\n8 the market for sale?\n9 A Oh, because my credit is totally ruined, right? I -- I\n10 have physical custody of the kids, and I explored all avenues\n11 to try to retain my home. And so I -- that's when I met with\n12 the lawyer, just to explore bankruptcy. If that would be an\n13 option, you know, to see if I could alleviate some of the other\n14 debt, but it's -- it was so much IRS debt from our marriage\n15 that it's way --\n16 Q You only listed about $2,300 in debt to the IRS in your\n17 petition. Is there more than that?\n18 A No. No, sir. We listed more than that.\n19 Q But your bad credit doesn't have anything to do with\n20 selling the house, does it? You don't have to have good credit\n21 to sell your house, do you --\n22 A You don't. But I have, like I said -- I have physical\n23 custody of the kids, and I don't have anywhere to go with them.\n24 Q But you were ordered to sell the house through a licensed\n25 real estate agent by the divorce court if you failed to make\nCase 24-81152 Doc 102 Filed 10/14/25 Entered 10/14/25 14:48:56 Desc Main\nACCESS TRANSCRIPTS, LLC 1-855-USE-ACCESS (873-2223)\nDocument Page 25 of 44\nCase 3:25-cv-00721-BL Document 2-25 Filed 10/15/25 Page 26 of 44\nMcGregor - Direct 26\n1 the payments, and you didn't do that, did you?\n2 A Correct.\n3 Q Is it your belief that your bankruptcy filing allows you\n4 to avoid selling the marital residence as ordered by the\n5 Tallapoosa Circuit Court?\n6 A It's my belief that -- or understanding that through the\n7 bankruptcy process afforded to us by this federal court, that\n8 there could be a way for all my creditors to receive 100\n9 percent of their money.\n10 Q Does any provision of the final decree of divorce prevent\n11 Brittany from using those monthly payments of $2,000 from you\n12 to her as support for her living expenses?\n13 A No, sir.\n14 Q She can use that money that you were paying her for her\n15 support, can she not?\n16 A If that's what she wants to do with it, yes, sir.\n17 Q Now, you have in front of you the CS-42 form that was\n18 filed in your case. What's the date on that document up in the\n19 top right-hand corner?\n20 A 9/13/2023.\n21 Q And your divorce was not finalized until February of '24,\n22 correct?\n23 A Correct.\n24 Q Okay. Now, has your income increased since the filing of\n25 that Creditor's Exhibit 2, the CS-42?\nCase 24-81152 Doc 102 Filed 10/14/25 Entered 10/14/25 14:48:56 Desc Main\nACCESS TRANSCRIPTS, LLC 1-855-USE-ACCESS (873-2223)\nDocument Page 26 of 44\nCase 3:25-cv-00721-BL Document 2-25 Filed 10/15/25 Page 27 of 44\nMcGregor - Direct 27\n1 A I don't -- I think -- I don't know what this is per year.\n2 I had -- I'm sorry, my calculations -- but I got like a 3\n3 percent yearly cost-of-living raise through my employer. I\n4 don't know, around the same time. So I'm not sure if that was\n5 calculated in there or not. But it hasn't changed\n6 dramatically.\n7 Q So Brittany's income is shown on Creditor's Exhibit 2 as\n8 $1,733, correct?\n9 A If -- if this is the child support form that was filled\n10 out during the pendente lite hearing, when -- before -- when\n11 she quit her job, she was making around, I think, 80,000.\n12 I'm -- they -- they said this at, like -- her -- could -- and\n13 she didn't have a job then, so they set it at $10. I don't\n14 know if this is what she currently makes or doesn't make.\n15 This -- we never redid the CS-42 form after the pendente lite\n16 hearing.\n17 Q But the form that's in front of you, as Creditor's Exhibit\n18 2, shows Brittany's income at $1,733 per month, does it not?\n19 A Yes, sir.\n20 Q And if my math is correct, that's a difference of $7,137\n21 between your income and Brittany's income at that time. Is\n22 that correct?\n23 A Yes, sir.\n24 MR. AGRICOLA: Those are my questions, Your Honor.\n25 CROSS-EXAMINATION\nCase 24-81152 Doc 102 Filed 10/14/25 Entered 10/14/25 14:48:56 Desc Main\nACCESS TRANSCRIPTS, LLC 1-855-USE-ACCESS (873-2223)\nDocument Page 27 of 44\nCase 3:25-cv-00721-BL Document 2-25 Filed 10/15/25 Page 28 of 44\nMcGregor - Cross 28\n1 BY MR. INGRUM:\n2 Q So I believe you just testified that, at some point,\n3 Brittany, your ex-wife was making, how much a year?\n4 A Between 60,000 and 70,000. She was the breadwinner for a\n5 long time because I don't have a college education, and I was\n6 working to help put her through college to earn her master's\n7 degree in higher ed. And I thought she'd quit her job, but she\n8 was fired. That's what we learned during the divorce trial.\n9 And she was the breadwinner for a while for our family.\n10 Q Well, and I'm not trying to try the divorce case over.\n11 But why did you file the bankruptcy case?\n12 A When she quit her job, you know, it was half of our income\n13 gone, and credit card debt piled up, IRS got -- debt piled up.\n14 And then due to differences in the home, when I filed for\n15 divorce and then legal fees started to stack up on top -- onto\n16 the credit cards, and it just become too much.\n17 Q So is it a fair statement that you filed bankruptcy as a\n18 result of the cost and fees of the divorce and the obligations\n19 you were put -- placed under due to the divorce?\n20 A Yes, sir.\n21 Q And when you filed your bankruptcy case, you notified --\n22 you -- and -- your initial filing, you met with me, and we\n23 filed your case, we listed Brittany Gilliland initially?\n24 A Yes, sir.\n25 Q And didn't you hear from her about the next week?\nCase 24-81152 Doc 102 Filed 10/14/25 Entered 10/14/25 14:48:56 Desc Main\nACCESS TRANSCRIPTS, LLC 1-855-USE-ACCESS (873-2223)\nDocument Page 28 of 44\nCase 3:25-cv-00721-BL Document 2-25 Filed 10/15/25 Page 29 of 44\nMcGregor - Cross 29\n1 A I -- I text her the same day, right --\n2 Q Okay.\n3 A -- and informed her.\n4 Q And I believe she filed a document in state court in\n5 October, specifically listing the bankruptcy case?\n6 A Several different times, Your Honor.\n7 Q Okay. And she's been represented by counsel this whole\n8 time, correct?\n9 A Yes, sir.\n10 Q And you heard what Brittany testified. I believe it is\n11 correct, you have primary physical custody of the children?\n12 A Yes, sir.\n13 Q She pays you child support?\n14 A Yes, sir.\n15 Q There was no alimony named or specifically, expressly\n16 stated that there would be no alimony in between the parties?\n17 A Yes, sir. That's correct.\n18 Q And how long were you all married?\n19 A Around five years, close to five years.\n20 Q Okay. And why did -- why were you ordered to pay her any\n21 money? What was the reason behind it?\n22 MR. AGRICOLA: Objection, Your Honor.\n23 MR. INGRUM: He opened the door.\n24 MR. AGRICOLA: He doesn’t know why the Judge entered\n25 any kind of orders. And the judge's reasons are in the\nCase 24-81152 Doc 102 Filed 10/14/25 Entered 10/14/25 14:48:56 Desc Main\nACCESS TRANSCRIPTS, LLC 1-855-USE-ACCESS (873-2223)\nDocument Page 29 of 44\nCase 3:25-cv-00721-BL Document 2-25 Filed 10/15/25 Page 30 of 44\nMcGregor - Cross 30\n1 (indiscernible) of the judge's --\n2 MR. AGRICOLA: What is your understanding?\n3 THE COURT: Okay. Rephrase the question.\n4 BY MR. INGRUM:\n5 Q What is your understanding --\n6 THE COURT: Sustained.\n7 BY MR. INGRUM:\n8 Q -- as to why you have to pay her money?\n9 MR. AGRICOLA: Objection to relevance, Your Honor.\n10 His understanding is not relevant.\n11 THE COURT: I think he can answer the question.\n12 THE WITNESS: My understanding is that it's the\n13 equity in the home, you know?\n14 BY MR. INGRUM:\n15 Q Well, Mr. Agricola doesn't want you guessing. So we'll go\n16 through those. Do you still have that Exhibit in front of you?\n17 A Yes, sir.\n18 Q Please read Paragraph 7 to the Court.\n19 A \"The husband should pay the wife one half of the equity in\n20 the residence, which is $51,411.21. This amount should be paid\n21 as follows: 10,000 within ten days of this order, followed by\n22 monthly payments of 2,000 per month for 21 consecutive months,\n23 beginning April 1st.\"\n24 Q Keep going.\n25 A \"The Court is aware that the total of payments\" -- the --\nCase 24-81152 Doc 102 Filed 10/14/25 Entered 10/14/25 14:48:56 Desc Main\nACCESS TRANSCRIPTS, LLC 1-855-USE-ACCESS (873-2223)\nDocument Page 30 of 44\nCase 3:25-cv-00721-BL Document 2-25 Filed 10/15/25 Page 31 of 44\nMcGregor - Cross 31\n1 \"the total of the payments above total 52,000, the additional\n2 $588.79 awarded may be avoided by the husband paying the full\n3 $51,411.21 within 90 days of this order.\"\n4 Q Keep going.\n5 A \"Otherwise, the additional 588.79 should be considered for\n6 the delay in the wife receiving full payment.\"\n7 Q Keep going.\n8 A \"If the husband fails to timely make these payments, then\n9 the house should be placed on the market for sale with a\n10 licensed real estate agent. Upon sale, the net proceeds shall\n11 be equally divided between the parties.\"\n12 Q And when you filed this bankruptcy case, did you list your\n13 home?\n14 A Yes, sir.\n15 Q And is it your understanding that home is part of your\n16 bankruptcy estate?\n17 A Yes, sir.\n18 Q Do you live there?\n19 A Yes, sir.\n20 Q Do your children live there?\n21 A Yes, sir.\n22 Q Did you propose to pay 100 percent to your unsecured -- to\n23 all of your unsecured creditors?\n24 A Yes, sir.\n25 MR. INGRUM: That's all I have, Your Honor.\nCase 24-81152 Doc 102 Filed 10/14/25 Entered 10/14/25 14:48:56 Desc Main\nACCESS TRANSCRIPTS, LLC 1-855-USE-ACCESS (873-2223)\nDocument Page 31 of 44\nCase 3:25-cv-00721-BL Document 2-25 Filed 10/15/25 Page 32 of 44\n32\n1 THE COURT: Go ahead. Do you --\n2 MR. AGRICOLA: Those are our witness, Judge. We\n3 don't have any further questions.\n4 THE COURT: Any first -- okay. All right.\n5 MR. AGRICOLA: I have nothing.\n6 THE COURT: Nothing further. All right. Then I will\n7 let -- you can step down.\n8 (Witness excused)\n9 THE COURT: All right. I will let you do closing\n10 arguments.\n11 MR. AGRICOLA: Judge, most of the cases that deal\n12 with this issue involve a marriage settlement agreement. And\n13 that's why I think the cases rely so heavily on the intent of\n14 the parties when they entered into a settlement agreement.\n15 And, you know, the cases say, that's the touchstone,\n16 what did the parties intend for the payment to be? Here, we\n17 don't have a marriage settlement agreement. So the factors\n18 that are listed in Benson, which is 441 Fed. Appx. 650 (11th\n19 Cir. 2011). A lot of them don't really apply. For example:\n20 The first factor that the Court instructs bankruptcy courts to\n21 consider when deciding whether a payment is in the nature of\n22 support or maintenance or alimony is the language of the\n23 agreement. We don't have an agreement.\n24 The second factor that Benson sets out is the\n25 financial positions of the parties when the agreement was made.\nCase 24-81152 Doc 102 Filed 10/14/25 Entered 10/14/25 14:48:56 Desc Main\nACCESS TRANSCRIPTS, LLC 1-855-USE-ACCESS (873-2223)\nDocument Page 32 of 44\nCase 3:25-cv-00721-BL Document 2-25 Filed 10/15/25 Page 33 of 44\n33\n1 Well, again, we don't have an agreement, but we do have\n2 evidence of their financial position.\n3 And in a case that arose out of the Middle District\n4 called Edwards v. Collins. It's not reported in Fed. Supp.,\n5 but it's 2017 WL 1822570 (M.D. Ala. May 5, 2017) on an appeal\n6 from this Court. And, Your Honor, actually, I think closed out\n7 that case following Judge Sawyer's retirement.\n8 But that case involved a divorce in I believe it was\n9 Elmore County. And it -- I think it's a very significant case.\n10 The husband filed a Chapter 13 bankruptcy petition and sought\n11 to pay the wife as a non-priority creditor. The wife contended\n12 that the payments to her were a domestic support obligation.\n13 And the district court reversed the determination of the\n14 bankruptcy court for the Middle District, which had held that\n15 payments to the wife under the settlement agreement were\n16 dischargeable, property settlement.\n17 The court held that the bankruptcy court erred in\n18 framing the issue as to whether the payments were a property\n19 settlement or alimony. And it said that the proper analysis is\n20 whether the property settlement can be a non-dischargeable\n21 domestic support obligation, citing Benson and Cummings.\n22 Now, Cummings is an Eleventh Circuit decision from\n23 2001. It's Cummings v. Cummings, and it's 244 F.3d 1263. And\n24 I'll get back to that case in a minute. But in both of those\n25 cases, the Eleventh Circuit had recognized that a property\nCase 24-81152 Doc 102 Filed 10/14/25 Entered 10/14/25 14:48:56 Desc Main\nACCESS TRANSCRIPTS, LLC 1-855-USE-ACCESS (873-2223)\nDocument Page 33 of 44\nCase 3:25-cv-00721-BL Document 2-25 Filed 10/15/25 Page 34 of 44\n34\n1 settlement can be in the nature of support.\n2 And so the Court said that the -- Judge Sawyer erred\n3 in framing the issue as to whether it was alimony or property\n4 settlement. That the real question was whether the property\n5 settlement could be in the nature of alimony or support. So\n6 it's not the black and white issue that the debtor would seek\n7 to make it, whether it's property settlement or alimony, it's\n8 more nuanced.\n9 In the Cummings case, they concluded that the\n10 equitable distribution to the wife was a non-dischargeable\n11 domestic support obligation because a property division often\n12 achieves the same goal as a support obligation. And for that\n13 reason, state courts do not rigidly distinguish between the\n14 two.\n15 Now, the waiver of alimony rights has been cited as\n16 another reason why a property settlement can be in the nature\n17 of support or alimony. In the Edwards v. Collins case, the\n18 Court found that the wife waived her rights to alimony because\n19 of the benefits she received in the settlement and emphasized\n20 that the financial disparity between the parties was\n21 significant.\n22 That's why we wanted to introduce the CS-42 because\n23 it clearly shows the financial disparity between the incomes of\n24 the two parties. And we believe it is very relevant as\n25 required by the case law to be considered.\nCase 24-81152 Doc 102 Filed 10/14/25 Entered 10/14/25 14:48:56 Desc Main\nACCESS TRANSCRIPTS, LLC 1-855-USE-ACCESS (873-2223)\nDocument Page 34 of 44\nCase 3:25-cv-00721-BL Document 2-25 Filed 10/15/25 Page 35 of 44\n35\n1 The Court noted that the record demonstrated that the\n2 wife needed the payments from the husband to support herself.\n3 The Court -- well, Judge Sawyer's, primary reason, which the\n4 District Court found was that he didn't want to interfere or\n5 re-characterize what the divorce court had done. And again,\n6 said that was the wrong focus. The proper analysis is whether\n7 the property settlement is in the nature of support.\n8 We contend that it is, and we contend that her\n9 testimony supports the fact that she needed those $2,000\n10 monthly payments to support herself. Clearly, her current\n11 income is insufficient to meet her financial needs.\n12 In Cummings, the wife brought an adversary proceeding\n13 against the husband, who had filed a Chapter 7 bankruptcy,\n14 seeking a declaration that a $6.3 million equitable\n15 distribution ordered by the divorce court was in the nature of\n16 support and thus non dischargeable. There was no settlement\n17 agreement, like we have in this situation, but rather, there\n18 was a divorce decree.\n19 The Court held that the bankruptcy court failed to\n20 take into account the intent of the divorce court as reflected\n21 in the divorce judgment. And basically, he said -- the Court\n22 said that it was clear that some portion of the $6.3 million\n23 equitable division was intended for support.\n24 And since -- I think it was kind of a procedural\n25 coincidence that since the Court was remanding to the\nCase 24-81152 Doc 102 Filed 10/14/25 Entered 10/14/25 14:48:56 Desc Main\nACCESS TRANSCRIPTS, LLC 1-855-USE-ACCESS (873-2223)\nDocument Page 35 of 44\nCase 3:25-cv-00721-BL Document 2-25 Filed 10/15/25 Page 36 of 44\n36\n1 bankruptcy court, it recommended that the debtor should seek\n2 leave -- relief from the automatic stay in order to ask the\n3 divorce court what portion of the equitable distribution it\n4 intended to be support for the wife.\n5 So again, we don't -- and I confess that there's just\n6 not a whole lot in the divorce decree that gives us much\n7 indication, but I do think, that the provision about selling\n8 the marital residence and dividing the proceeds is an\n9 indication that it might have -- it was intended to be support.\n10 In Benson, they also said the frequency and number of\n11 payments was another matter. This was 21 months of payments,\n12 which begins to look more like alimony.\n13 And just before I get sidetracked, I wanted to\n14 mention the Court may -- should -- may be aware that Alabama\n15 law provides that following a divorce and following any appeal\n16 from a divorce, the parties shall not marry except to each\n17 other for 60 days. Ms. Gilliland testified that she got\n18 married before the appeal from her divorce was entered, and the\n19 law in Alabama is that that's not a valid marriage. So the\n20 argument that their marriage cut off any entitlement to alimony\n21 doesn't work.\n22 Another one of the factors in Benson was whether the\n23 agreement waives other support rights. Well, again, no\n24 agreement, but there is no alimony provided. So it's entirely\n25 credible that the payments to the wife were intended as support\nCase 24-81152 Doc 102 Filed 10/14/25 Entered 10/14/25 14:48:56 Desc Main\nACCESS TRANSCRIPTS, LLC 1-855-USE-ACCESS (873-2223)\nDocument Page 36 of 44\nCase 3:25-cv-00721-BL Document 2-25 Filed 10/15/25 Page 37 of 44\n37\n1 for her since there was not going to be any alimony.\n2 THE COURT: So can I get some clarification --\n3 MR. AGRICOLA: Sure.\n4 THE COURT: -- because I do not have a thorough\n5 knowledge in Alabama divorce law. So are you saying because\n6 she married before the appeal was over, it's invalid?\n7 MR. AGRICOLA: That's correct.\n8 THE COURT: Okay. Is she -- okay.\n9 MR. AGRICOLA: That's the law, Judge.\n10 THE COURT: Okay.\n11 MR. AGRICOLA: And I believe, if memory serves me\n12 correctly, most every divorce decree contains a provision that\n13 says that, essentially, that they shall not marry except to\n14 each other for 60 days during the course following the divorce\n15 or from any appeal from the divorce. Can't seem to put my\n16 finger on that (indiscernible). But I believe that would be in\n17 the divorce decree, if my memory serves me correctly.\n18 THE COURT: Okay.\n19 MR. AGRICOLA: It's Paragraph 3, that neither party\n20 shall marry again, except to each other until 60 days after the\n21 date of this decree. Paragraph 4, if an appeal from this\n22 decree is taken within 60 days, neither party shall marry\n23 again, except to each other during the pendency of said appeal.\n24 So that's Paragraphs 3 and 4 of Creditor's Exhibit 1, Your\n25 Honor.\nCase 24-81152 Doc 102 Filed 10/14/25 Entered 10/14/25 14:48:56 Desc Main\nACCESS TRANSCRIPTS, LLC 1-855-USE-ACCESS (873-2223)\nDocument Page 37 of 44\nCase 3:25-cv-00721-BL Document 2-25 Filed 10/15/25 Page 38 of 44\n38\n1 So to the extent that there's any reliance on\n2 marriage as a reason not to continue these payments as support,\n3 that is not a valid reason.\n4 THE COURT: Okay. And so just so I understand, so I\n5 guess, I don't know if you'd call it a remedy, is not the right\n6 word, but for violation of this court order, it invalidates the\n7 marriage. Her marriage to her second husband, that's -- is\n8 that a remedy? I don't know how we would --\n9 MR. AGRICOLA: No, Your Honor, it's actually a\n10 statute.\n11 THE COURT: Okay.\n12 MR. AGRICOLA: And I don't have the cite, but there's\n13 a statute that says that no party following a divorce may get\n14 married except to the other party for 60 days.\n15 THE COURT: And I guess what I'm asking is what\n16 happens when that -- if that is violated? What is the\n17 consequence of that? It invalidates that marriage, so this\n18 marriage cannot be deemed valid?\n19 MR. AGRICOLA: That's right.\n20 THE COURT: Okay. All right.\n21 MR. AGRICOLA: And I only bring that up because\n22 Mr. Ingrum brought up the marriage and seemed to be headed for\n23 an argument that that would invalidate any payments as support\n24 to the wife.\n25 THE COURT: Okay.\nCase 24-81152 Doc 102 Filed 10/14/25 Entered 10/14/25 14:48:56 Desc Main\nACCESS TRANSCRIPTS, LLC 1-855-USE-ACCESS (873-2223)\nDocument Page 38 of 44\nCase 3:25-cv-00721-BL Document 2-25 Filed 10/15/25 Page 39 of 44\n39\n1 MR. AGRICOLA: There's another case, Your Honor, that\n2 arose out of the Middle District, and it was authored by, Judge\n3 Sawyer. It is In re Coon, C-O-O-N, 522 B.R. 357 (Bankr. M.D.\n4 Ala. 2014). I would note that this decision was before the\n5 decision in Edwards v. Collins, where Judge Sawyer's\n6 determination about alimony or property settlement was\n7 reversed.\n8 But in that case, the debtor husband brought an\n9 adversary proceeding against the wife seeking a determination\n10 that amounts owed under the divorce decree were not alimony,\n11 were not entitled to priority and were dischargeable. Section\n12 4 of the settlement agreement, again, we had a settlement\n13 agreement in that case, required the husband to pay $2,000 a\n14 month for six months, and then $3,000 a month for the next 54\n15 months.\n16 The Court ruled that Section 4 payments totaling\n17 $43,000, were non dischargeable domestic support obligation.\n18 Section 8 dealt with division of the husband's retirement plan\n19 and required the husband to pay the wife half of the value of\n20 his retirement account at the time, totaling $40,000. And\n21 after considering the eight Benson factors, the Court held that\n22 the Section 4 payments were entitled to priority under 11\n23 U.S.C. 507(a)(1)(A) and accepted from discharge under 11 U.S.C.\n24 1328(a)(2) and 523(a)(5).\n25 The Bankruptcy Code defines a domestic support\nCase 24-81152 Doc 102 Filed 10/14/25 Entered 10/14/25 14:48:56 Desc Main\nACCESS TRANSCRIPTS, LLC 1-855-USE-ACCESS (873-2223)\nDocument Page 39 of 44\nCase 3:25-cv-00721-BL Document 2-25 Filed 10/15/25 Page 40 of 44\n40\n1 obligation as a debt owed to a former spouse of the debtor that\n2 is in the nature of alimony, maintenance, or support of such\n3 former spouse without regard to whether such debt is expressly\n4 so designated.\n5 The question of whether these payments are entitled\n6 to priority is a question of federal law, although the cases\n7 say that the Court is to consider how the state court treated\n8 them. But the cases also say that since at the time of the\n9 divorce, it was probably never considered that bankruptcy would\n10 be filed subsequent to the divorce, the labels put on the\n11 payments by the divorce court are not binding on the federal\n12 court.\n13 We say, Judge, that based on these cases, we believe\n14 that this -- these payments, the $52,000 owed by the husband to\n15 the wife, as a result of the divorce decree, are a domestic\n16 support obligation, non-dischargeable, and entitled to priority\n17 under 11 U.S.C. 507 (a)(1)(A), as well as -- and not subject to\n18 discharge under 1328 (a)(2). And we would ask the Court to so\n19 rule.\n20 THE COURT: Okay. Mr. Ingrum.\n21 MR. INGRUM: Your Honor, Mr. Agricola mentioned the\n22 Cummings case, and they talked about the Court needs to look at\n23 the intent of the divorce court. I don't know what clearer\n24 intent there could be. This Steve Perryman wrote this\n25 decision. He used to practice in the bankruptcy court.\nCase 24-81152 Doc 102 Filed 10/14/25 Entered 10/14/25 14:48:56 Desc Main\nACCESS TRANSCRIPTS, LLC 1-855-USE-ACCESS (873-2223)\nDocument Page 40 of 44\nCase 3:25-cv-00721-BL Document 2-25 Filed 10/15/25 Page 41 of 44\n41\n1 He -- it can't be child support, because she pays him\n2 child support. He has custody of the children. It expressly\n3 states that neither party is ordered to pay alimony.\n4 And then when it discusses -- when the divorce decree\n5 itself discusses why Mr. McGregor is paying his ex-wife money,\n6 it's -- I don't know that it can be any clearer, that it is\n7 based on the equity in the residence.\n8 Now, Ms. Gilliland has testified that she's\n9 remarried. Now, Mr. Agricola makes a good argument that the\n10 marriage is not valid, but they're cohabitating. And the rule\n11 is not that alimony stops upon remarriage, it's remarriage or\n12 cohabitation.\n13 So the fact that they're remarried really is just\n14 more evidence of the cohabitation. But they've gone through\n15 the ceremony. They hold themselves out as husband and wife.\n16 They live together, they sleep together. So there is\n17 cohabitation there, and that's -- there's no evidence -- the\n18 state of the evidence, there's no evidence to contradict that.\n19 There are divorce decrees, like Mr. Agricola said,\n20 that -- where there's a settlement agreement, and that's where\n21 it can really get sticky because sometimes the lawyers are\n22 going back and forth. They're trying to, you know -- there's\n23 give and take. There's usually mediation involved. And there\n24 is some lack of clarity.\n25 There was a case I had in front of Judge Sawyer. I\nCase 24-81152 Doc 102 Filed 10/14/25 Entered 10/14/25 14:48:56 Desc Main\nACCESS TRANSCRIPTS, LLC 1-855-USE-ACCESS (873-2223)\nDocument Page 41 of 44\nCase 3:25-cv-00721-BL Document 2-25 Filed 10/15/25 Page 42 of 44\n42\n1 don't remember it off the top of my head, but they had alimony\n2 in gross. And the Court, you know, Judge Sawyer looked at that\n3 to think there was alimony. Well, it was just actually\n4 discussing a property settlement, which we got to.\n5 I am familiar with the Edwards v. Collins case. I\n6 thought Judge Sawyer did a fine job of analyzing the factors\n7 involved there. I'm -- but when you look at the Benson\n8 factors, when you look at what was the intent of the Court, I\n9 don't know of a divorce case that clearly says -- screams\n10 property settlement more than this. And Mr. Agricola points\n11 out the disparity of the income. So what? She admits that\n12 that was a while back. She didn't include the $2,000 that she\n13 was getting, but she says that she relied on as support.\n14 She has a master's degree. She was making $60,000 to\n15 $80,000 a year. She chooses not to work now. The disparity in\n16 income is by choice, not by circumstance. There's no testimony\n17 otherwise, except for what Mr. McGregor testified to. In fact,\n18 he stated that when she lost her job, that that -- he had to\n19 absorb the credit card debt, and that's part of why he is in\n20 this court. He absorbed the tax debt, which is why he's in\n21 this court.\n22 So -- and the thing that puzzles me, I don't even\n23 know any other way to say it. But she just -- Ms. Gilliland\n24 testified that she believes that it's in the nature of support,\n25 which could potentially judicially have stopped her from making\nCase 24-81152 Doc 102 Filed 10/14/25 Entered 10/14/25 14:48:56 Desc Main\nACCESS TRANSCRIPTS, LLC 1-855-USE-ACCESS (873-2223)\nDocument Page 42 of 44\nCase 3:25-cv-00721-BL Document 2-25 Filed 10/15/25 Page 43 of 44\n43\n1 the claimant's property settlement back in state court, which\n2 would negate the entire sale of the house or anything else.\n3 But she's relying on that because it's convenient.\n4 It's what makes sense under the law today. And it is not\n5 reflective of anything in this order.\n6 Again, it can't be child support. She can say she\n7 relies on it. Heck, I'd rely on it. Anybody would rely on it.\n8 They can do whatever they want to do with it. But it is\n9 spelled out very clearly in Paragraph 7, and I don't know how\n10 it could be any plainer than that.\n11 So anyway, that's all I've got. Thank you, Your\n12 Honor.\n13 THE COURT: Okay. With that, I am going to take this\n14 one under advisement. And court is adjourned.\n15 THE BAILIFF: All rise.\n16 (Proceedings concluded at 12:08 p.m.)\n17 * * * * *\n18\n19\n20\n21\n22\n23\n24\n25\nCase 24-81152 Doc 102 Filed 10/14/25 Entered 10/14/25 14:48:56 Desc Main\nACCESS TRANSCRIPTS, LLC 1-855-USE-ACCESS (873-2223)\nDocument Page 43 of 44\nCase 3:25-cv-00721-BL Document 2-25 Filed 10/15/25 Page 44 of 44\n44\n1 C E R T I F I C A T I O N\n2\n3 I, Heidi Jolliff, court-approved transcriber, hereby\n4 certify that the foregoing is a correct transcript from the\n5 official electronic sound recording of the proceedings in the\n6 above-entitled matter.\n7\n8\n9 ____________________________\n10 HEIDI JOLLIFF, AAERT NO. 2850 DATE: October 14, 2025\n11 ACCESS TRANSCRIPTS, LLC\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\nCase 24-81152 Doc 102 Filed 10/14/25 Entered 10/14/25 14:48:56 Desc Main\nACCESS TRANSCRIPTS, LLC 1-855-USE-ACCESS (873-2223)\nDocument Page 44 of 44",
  "source_metadata": {
    "method": "pdfplumber",
    "pages": 44
  },
  "modified_time": 1767806400.0
}