{
  "doc_id": "dc890621b423e8596110a34a773a234dec53ba32a62ddda22dd75f4804b8c10d",
  "file_path": "C:\\Users\\blain\\Dropbox\\Master_Court_Files\\14_Discovery\\2025-09-16_REQUESTS_FOR_INTERROGATORIES_AND_PRODUCTIONS_FROM_BLAINE.pdf",
  "file_name": "2025-09-16_REQUESTS_FOR_INTERROGATORIES_AND_PRODUCTIONS_FROM_BLAINE.pdf",
  "doc_type": "pdf",
  "date": null,
  "parties": [],
  "raw_text": "IN THE CIRCUIT COURT OF TALLAPOOSA COUNTY, ALABAMA\nALEXANDER CITY DIVISION\nCHRISTOPHER BLAINE MCGREGOR )\n)\nPLAINTIFF )\n)\nv. ) CASE NO. DR-2023-900051.01\n)\nBRITTANY MICHELLE GILLILAND )\n)\nDEFENDANT )\nPLAINTIFF’S/DEFENDANT’S CONSOLIDATED INTERROGATORIES AND\nREQUESTS FOR PRODUCTION TO DEFENDANT/PLAINTIFF\nCOMES now the Plaintiff, Christopher Blaine McGregor, by and through his attorney of\nrecord, Dianne James Davis, and propounds the following interrogatories and requests for\nproduction to the Defendant, Brittany Michelle Gilliland, separately and severally, in the manner\nand form prescribed by law.\nINSTRUCTIONS\nInterrogatories are to be answered under oath notice must be filed with the Clerk of Court.\nMaterials to be produced may be copies and attached with your answers to these\ninterrogatories.\nIn answering these interrogatories, furnish all information available to you including\ninformation in the possession of your attorney, any investigators and all persons acting on your\nbehalf. If you cannot answer the interrogatories in full after exercising due diligence to secure\nthe information, so state and answer to the extent possible, specifying your inability to answer\nthe remainder and stating whatever information or knowledge you have concerning the\nunanswered portions.\nIf in response to this discovery any party fails to disclose any facts or other discoverable\ninformation and then at a later date discloses such facts or information, please state how the\nexistence of these additional facts or information was “discovered”, by whom such additional\nfacts or information were “discovered”, when such additional facts or information were\n“discovered”, who made the decision to disclose such facts or information in response to this\ndiscovery, when that decision was made, and in detail, why such additional facts or information\nwas not disclosed in the parties initial responses.\nIf the information requested is not available to the party to whom this discovery is\ndirected, said party is requested to state all efforts made to obtain said information and from what\nsource such information might be obtained, if known to said party.\nThese interrogatories shall be deemed continuing, and the party to whom they are\naddressed shall be obligated to change, supplement, and amend their answers as required by the\nAlabama Rules of Civil Procedure.\n1) Are you currently married? If so, please provide a true copy of your marriage\ncertificate.\n2) Do you have any information, knowledge, or belief that the children have been\nabused, neglected, frightened, not well cared for or exposed to immoral behavior\nwhile in the other parent’s care and custody or anyone else residing in that\nparent’s household? If so, give the details of each such incident or event, the date,\nand the names and addresses of any witnesses.\n3) Please provide the following information regarding your current residence:\na. Address;\nb. Type of residence (i.e., house, apartment, mobile home, number of\nbedrooms, bathrooms, etc.);\nc. The names and ages of every other individual who resides at your\ncurrent residence and your relationship to each; and\nd. The sleeping arrangements for each household member when\neither minor child is at your residence overnight.\n4) Please list in detail any and all communications you have had with the minor\nchildren’s schools, teachers, counselors, or administrators regarding the Plaintiff,\nin the past two (2) years, including the content and purpose of each\ncommunication.\n5) Please provide all documents, emails, text messages, or written communication\nbetween you and any of the children’s teachers, principals, counselors, or\nadministrators, regarding the Plaintiff.\n6) Please provide a copy of any police reports you have filed against the Plaintiff in\nthe past twenty-four (24) months to the present.\n7) Please provide copies of your paycheck stubs or other proof of your income for\nthe last six (6) months.\n8) Please provide a true and correct copy of your state and federal income tax returns\nfor the past two (2) years (in the event that a return has not been filed for a given\nyear, a copy of any estimate, request for extension, or any other form filed by you\nor received by you from the Internal Revenue Service for the year in question),\nincluding, but not limited to all W-2s, 1099s, schedules, itemizations forms,\nworksheets, and other documents used or made in the computation of the tax\nreturn.\n9) In the past three (3) years, have the police or any law enforcement agency been\ncalled to any location in connection with you, or has a law enforcement or police\nincident report been made by you or against you by another person? If so, provide\nthe following information for each incident:\na. Date of incident;\nb. Reporting person's name;\nc. Alleged suspect’s name;\nd. A brief statement as to what gave rise to the incident including, but\nnot limited to, the allegation made, crime alleged, and explanation, if any\ndisposition (e.g., arrest and conviction/probation; arrest and dismissal\nupon taking classes; no arrest, made me leave residence; no warrant\nsigned; case still pending);\ne. Provide a copy of all police reports related to each incident.\n10) Have you or anyone residing in your household ever been arrested or convicted of\nany crimes, misdemeanors, or traffic infractions? If your answer is in the\naffirmative, please state the nature of each charge, the jurisdiction, and whether\nyou were convicted or any penalties were imposed.\n11) Please state what method or methods of discipline you use or have used on the\nminor children. Do you now or have you ever used corporal punishment as a\nmeans of disciplining your children?\n12) Please state if you, or anyone known to you, have ever hit, threatened, injured,\nmistreated, molested, or otherwise subjected your children to physical, verbal, or\nmental abuse. If so, please state what you (or anyone else) did, the date or dates\nof the abuse and the circumstances of the conduct.\n13) Please list any and all occasions or time periods in which you chose not to\nparticipate in your scheduled visitation with either of the minor children, giving\nthe reasons for your failure and/or refusal to exercise said visitation.\n14) For the statements in your pleadings wherein you allege that the Plaintiff has\nattempted to alienate the children from you, has actively hindered communication\nwith the minor children’s schools, and has been manipulating the children’s\nperception of you, please provide the following:\na. The factual basis of your allegations;\nb. The name, address and telephone number of any person who can\ncorroborate any of your allegations; and\nc. Provide a copy of any photos, audio/video recordings, records, text\nmessages, emails, correspondence, or other physical evidence that\nsupports your allegations.\n15) Do you, or anyone residing in your household, consume alcoholic beverages,\nnarcotic drugs, or controlled substances in the presence of the minor children? If\nso, please state the date(s), the identity of the person(s) involved, and the\ncircumstances of each occasion.\n16) Have you, or anyone residing in your household, ever driven a vehicle in which\nthe minor children were occupants while under the influence of alcohol and/or\ndrugs? If so, state the date and circumstances of each occasion.\n17) Please list all steps, if any, that you have taken to improve your relationship with\nthe minor child, A.K., in the last eighteen (18) months.\n18) Please identify all activities or events of the minor child, A.K., of which are\naware, that you have failed to attend in the past two (2) years, and provide the\nreasons for your absence from each.\n19) Please state whether you, or any third party at your request, have ever recorded\nand conversations, interactions, or communications involving the Plaintiff and/or\nminor children. If so, provide the date and location of the each recording, as well\nas the substance of each and the name of the person doing the recording.\n20) Please state whether you have failed or refused to attend any of the weekly\nfamily dinners, including Sunday dinners, with the minor children as ordered by\nthe Court. If so, identify each date you failed or refused to attend, the reason for\nyour absence, and whether you notified the other parent in advance.\n21) Please state every instance in which either of the minor children has operated or\nridden as a passenger on an ATV, four-wheeler, or similar vehicle without wearing\na helmet or other protective gear. For each instance, identify the date, locations,\nand circumstances, and state why a helmet or protective gear was not used.\n22) Please describe in detail how you have been involved in the children's education.\nSpecially list all educational concerns you have about the children, all parent-\nteacher conferences you have attended, and detail any difficulties you have had\ncommunicating with the other parent regarding the children's educational needs.\n23) Prior to the first reunification session on December 12, 2023, state whether you\nhad any contact with Kelly Turler, including but not limited to meetings, phone\ncalls, emails or other communications. Identify whether you met privately with\nKelly Turner before A.K. was allowed into the room during the first session, and\nfor each such interaction, describe the date, manner of communication, subject\ndiscussed, and whether the Plaintiff or A.K. were present. In addition, state what\nqualifications in reunification therapy Kelly Turner had that led you to select her\nas the reunification therapist in this matter.\n24) Has the Department of Human Resources, Social Services, Child Protective\nServices, or any other government agency ever investigated an abuse or neglect\nclaim against you or any other person residing in your household? If so, please\nprovide the following for each such claim:\na. The identity of the entity or agency;\nb. The date of the claim;\nc. A description of the offense;\nd. The outcome of the matter;\ne. Any punishment or consequence to the person against who the\nclaim was made (you received); and\nf. The name and address of any other person with knowledge of the\nfacts stated in your response to this interrogatory.\n25) Please provide the name and address of each person who has knowledge of the\nfacts or events referenced in the pleadings or in any answers to these\ninterrogatories, or who may testify at any proceeding in this matter. For each\nperson, provide their name, address, telephone number, and the subject matter of\ntheir anticipated testimony.\n26) Please produce a copy of any photograph, surveillance footage, audio or video\nrecording, text message, social media post, screenshot, tangible item, and any and\nall written matter, including electronically stored information, that relates directly\nor indirectly to the issues in this matter or that you intend to use during the trial of\nthis matter.\n27) Have you been advised that your answers are made under oath, may be used as\nmaterial testimony in the event of a trial or hearing, and must be updated if your\nforegoing responses change?\nSubmitted this the 16th day of September, 2025.\n/s/Dianne James Davis\nDianne James Davis (DAV007)\nAttorney for Plaintiff/Father\n107 Main Street\nAlexander City, AL 35010\n(256) 392-3172\n(256) 392-3578 (facsimile)\ndianne@diannedavislaw.com\nCertificate of Service\nI hereby certify that I have served a copy of the foregoing upon the following via the\nAlaCourt E-File System and/or by electronic transmission on this the 16th day of September,\n2025.\nBarbara H. Agricola\n127 South 8th Street\nOpelika, AL 36801\n/s/Dianne James Davis\nOf Counsel",
  "source_metadata": {
    "method": "pdfplumber",
    "pages": 6
  },
  "modified_time": 1759001167.0
}