{
  "doc_id": "e3f2c376f16700e0856e69207ec56feb42afde87072d77ec7ca333e8debe18bf",
  "file_path": "C:\\Users\\blain\\Dropbox\\Master_Court_Files\\11_Appeal_Documents\\11.21.24 Appellant's Brief.pdf",
  "file_name": "11.21.24 Appellant's Brief.pdf",
  "doc_type": "pdf",
  "date": null,
  "parties": [],
  "raw_text": "No. CL-2024-0597\n___________________\nIn the\nALABAMA COURT of CIVIL APPEALS\n___________________\nBrittany Michelle Gilliland,\nAppellant,\nvs.\nChristopher Blaine McGregor,\nAppellee.\n------------------❖------------------\nON APPEAL FROM TALLAPOOSA CIRCUIT COURT\nNO. DR-23-900051\n------------------❖------------------\nBRIEF OF APPELLANT\n------------------❖------------------\nBarbara H. Agricola\nAlgert S. Agricola, Jr.\nMorgan R. Caro-Whipple\nAgricola Law, L.L.C.\n127 South 8th Street\nOpelika, AL 36801\n(334)759-7557 P\nbarbara@agricolalaw.com\nal@agricolalaw.com\nmorgan@agricolalaw.com\nORAL ARGUMENT NOT REQUESTED\nNovember 21, 2024\nSTATEMENT REGARDING ORAL ARGUMENT\nAppellant does not believe oral argument is necessary. Should the\nCourt desire to hear from the parties to this appeal at oral argument,\nAppellant wishes to participate.\n2\nTABLE OF CONTENTS\nPage\nSTATEMENT REGARDING ORAL ARGUMENT ………………………...2\nSTATEMENT OF JURISDICTION ………………………………………….5\nTABLE OF AUTHORITIES …………………………………………………..7\nSTATEMENT OF THE CASE ………………………………………………..8\nNature of the Case……………………………………………………….8\nCourse of Proceedings …………………………………………………..8\nDisposition in the Court Below ………………………………………10\nISSUES PRESENTED FOR REVIEW ……………………………………..11\nSTATEMENT OF FACTS ……………………………………………………11\nSTATEMENT OF THE STANDARD OF REVIEW ………………………20\nSUMMARY OF THE ARGUMENT …………………………………………21\nARGUMENT …………………………………………………………………...22\nI. THE TRIAL COURT ERRED TO REVERSAL WHEN\nIT AWARDED SOLE PHYSICAL CUSTODY TO\nPLAINTIFF AND VISITATION TO DEFENDANT\nTHAT WENT AGAINST THE GREAT WEIGHT OF\nTHE EVIDENCE…………….……................................22\nII. THE TRIAL COURT ERRED TO REVERSAL WHEN\nIT AWARDED SOLE PHYSICAL CUSTODY TO\nPLAINTIFF AND VISITATION TO DEFENDANT\nSINCE THERE WAS SUFFICIENT EVIDENCE TO\nOVERCOME THE REBUTTABLE PRESUMPTION\n3\nAGAINST DEFENDANT HAVING\nCUSTODY…………………………………………………25\nCONCLUSION ………………………………………………………………..29\nCERTIFICATE OF COMPLIANCE ……………………………………….30\nCERTIFICATE OF SERVICE ………………………………………………31\n4\nSTATEMENT OF JURISDICTION\nThis Court has jurisdiction over Defendant’s appeal under Art. VI,\nSec. 141(b), Ala. Const. 2022, and Ala. Code 1975 §12-3-10, because it is\na timely appeal from a final judgment of the Tallapoosa Circuit Court\ninvolving a domestic relations case, more specifically a divorce, that was\nentered on February 27, 20241, which: (1) awarded the parties joint legal\ncustody of the minor children; (2) awarded Plaintiff [sole] physical\ncustody of the minor children; (3) awarded Defendant visitation\n(Thursday pick up from school until Monday return to school every 1st\nand 3rd week of the month); (4) awarded Defendant the 1st and 3rd full\nweeks of June and July to exercise summer vacation with the children;\n(5) ordered that the Parties to alternate Christmas, Thanksgiving, and\nSpring Break; (6) ordered each party would have the children for their\nrespective Mother’s or Father’s Day holiday; (7) ordered that the party\nnot exercising his or her time with the children shall have the right to\n1 The trial court issued a Final Decree of Divorce that addressed\nreal property and personal property division, payment of equity to Wife\nfrom the marital home, matters related to custody, and child support. For\npurposes of this brief, only matters related to child custody will be\naddressed.\n5\ncall or Facetime them at least once a day; (8) ordered that Plaintiff shall\nclaim the children every year for income tax purposes; and (9) ordered\nthat Plaintiff shall maintain health and dental insurance on the minor\nchildren.2 C. 092-099, Doc.156.\nDefendant filed a timely Motion to Alter, Amend, or Vacate the\nFinal Decree of Divorce pursuant to Ala.R.Civ.P. 59. C. 100-102, Doc. 161.\nOn March 21, 2024, Plaintiff filed an Answer to Defendant’s Motion to\nAlter, Amend, or Vacate the Final Decree of Divorce. C. 103-104, Doc.\n163. Thereafter, on July 26, 2024, Defendant’s counsel filed a Notice of\nAppeal and Docketing Statement. C. 107-108, Doc. 107; C. 109-110, Doc.\n109. Defendant asserts that the trial court erred to reversal in its Final\nDecree of Divorce [C. 092-099, Doc. 156.] by awarding custody to the\nPlaintiff as set out hereinabove.\n2 With respect to documents contained within the Clerk’s Record,\nDefendant will cite first to the page in the Clerk’s Record where the\ndocument can be found and also to the document number assigned to the\ndocument by the AlaFile electronic filing system.\n6\nTABLE OF AUTHORITIES\nCases Page\nEx parte Bryowsky,\n676 So.2d 1322, 1324-26 (Ala. 1996)…………………………………………20\nEx Parte Byars,\n794 So.2d 345, 347 (Ala. 2001)………………………………………………..22\nEx Parte Devine,\n398 So.2d 686, 696 (Ala. 1981)………………………………………………..23\nHeadrick v. Headrick,\n916 So.2d 610, 614 (Ala.Civ.App. 2005)……………………………………..26\nPhillips v. Phillips,\n622 So.2d 410, 412 (Ala.Civ.App. 1993)………………………....................21\nStatutes\nAla. Code 1975 § 12-3-10………………………………………………………..5\nAla. Code 1975 § 30-3-131………………………………………………...25, 26\nConstitutional and Other Authority\nArt. VI, Sec. 141(b), Ala. Const. 2022………………………………………….5\n7\nSTATEMENT OF THE CASE\nNature of the Case\nThis case concerns a dispute between the Defendant Wife and\nPlaintiff Husband as to whether it was in the best interest of the children\nfor Plaintiff to be awarded sole physical custody of the minor children and\nDefendant to be awarded visitation given the evidence in this case. The\nPlaintiff contended at trial that Defendant was abusive to their daughter,\nA.K.M., and as a result the daughter feared Defendant. Defendant\ncontended at trial that she never abused A.K.M., and Plaintiff engaged\nin parental alienation by purchasing expensive gifts for A.K.M. and\ninvolving her in the divorce case, so that she would favor the Plaintiff.\nCourse of Proceedings\nOn September 18, 2023, Plaintiff filed his Complaint for Divorce in\nthe Tallapoosa Circuit Court based on a complete incompatibility of\ntemperament between the parties that they could no longer live together\nas husband and wife. He requested custody of the minor children. C. 012-\n014, Doc. 2. Contemporaneously filed with the Complaint for Divorce was\nan Emergency Ex Parte Motion for Pendente Lite Relief alleging\nDefendant physically abused their daughter and the children were not\n8\nsafe with her. C. 015-016, Doc. 6. On that same day, the Court issued an\nEx Parte order awarding Plaintiff sole physical custody of the minor\nchildren and exclusive use of the marital home, pendente lite. C. 017, Doc.\n7.\nOn September 8, 2023, Defendant filed her Answer and\nCounterclaim for Divorce denying all of Plaintiff’s allegations and\nrequesting sole physical custody of the children and possession of the\nmarital home. C. 019-022, Doc. 11. Contemporaneously filed with the\nAnswer and Counterclaim was a Motion to Set Aside the Ex Parte Order\nand Defendant’s Motion for Pendente Lite Relief. C. 023-026, Doc. 14. On\nSeptember 11, 2023, the trial court set this matter for a pendente lite\nhearing on September 12, 2023. C. 034, Doc. 37.On September 13, 2023,\nPlaintiff filed an Answer to the Counterclaim. C. 036, Doc. 43.\nOn September 18, 2023, the trial court issued a pendente lite order\nthat kept sole physical custody with Plaintiff but gave Defendant set\nvisitation with the minor children and ordered Defendant to pay child\nsupport. C. 047-048, Doc. 59. It also set the final trial for November 6,\n2023. C. 047-048, Doc. 59.\n9\nThe trial court conducted a bench trial on November 6, 2023. C. 071-\n072, Doc. 143.\nDisposition in the Court Below\nOn February 27, 2024, without making any findings of fact, the trial\ncourt issued a Final Decree of Divorce which: (1) awarded the parties\njoint legal custody of the minor children; (2) awarded Plaintiff [sole]\nphysical custody of the minor children; (3) awarded Defendant visitation\n(Thursday pick up from school until Monday return to school every 1st\nand 3rd week of the month); (4) awarded Defendant the 1st and 3rd full\nweeks of June and July to exercise summer vacation with the children;\n(5) ordered that the Parties to alternate Christmas, Thanksgiving, and\nSpring Break; (6) ordered each party would have the children for their\nrespective Mother’s or Father’s Day holiday; (7) ordered that the party\nnot exercising his or her time with the children shall have the right to\ncall or Facetime them at least once a day; (8) ordered that Plaintiff shall\nclaim the children every year for income tax purposes; and (9) ordered\nthat Plaintiff shall maintain health and dental insurance on the minor\nchildren. C. 092-099, Doc.156\n10\nDefendant filed a timely Motion to Alter, Amend, or Vacate the\nFinal Decree of Divorce pursuant to Ala.R.Civ.P. 59. C. 100-102, Doc. 161.\nOn March 21, 2024, Plaintiff filed an Answer to Defendant’s Motion to\nAlter, Amend, or Vacate the Final Decree of Divorce. C. 103-104, Doc.\n163. Thereafter, on July 26, 2024, Defendant’s undersigned counsel filed\na Notice of Appeal and Docketing Statement. C. 107-108, Doc. 107; C.\n109-110, Doc. 109.\nISSUES PRESENTED FOR REVIEW\nI. WHETHER THE TRIAL COURT ERRED TO\nREVERSAL WHEN IT DETERMINED THE BEST\nINTEREST OF THE CHILDREN WAS TO AWARD\nSOLE PHYSICAL CUSTODY TO PLAINTIFF AND\nVISITATION TO DEFENDANT?\nII. WHETHER THE TRIAL COURT ERRED TO\nREVERSAL WHEN IT AWARDED SOLE\nPHYSICAL CUSTODY TO PLAINTIFF AND\nVISITATION TO DEFENDANT WHEN THERE\nWAS SUFFICIENT EVIDENCE TO OVERCOME\nTHE REBUTTABLE PRESUMPTION AGAINST\nDEFENDANT HAVING CUSTODY?\nSTATEMENT OF THE FACTS\nThe trial court heard testimony presented by both sides on\nNovember 6, 2023. At trial, the following was shown:\n11\nOn direct examination by Plaintiff’s counsel, Plaintiff testified that\nthe Parties were married on May 3, 2018, and had two children together,\nnamely A.K.M., a daughter who was born on May 24, 2012, and B.M.M,\na son who was born on May 10, 2019. R. 7. See C. 012-014, Doc. 12.\nPlaintiff testified that he and the Defendant worked as a team to get the\nhousework done during the years that they both were employed. R. 13.\nDefendant was terminated around the months of August through\nOctober 2021 and became a stay-at-home mother. R. 8. Plaintiff claimed\nthat after Defendant’s termination, she did not help around the house,\nand he did most of the grocery shopping, cooking, and cleaning. R. 14.\nHowever, Plaintiff admitted that the Defendant took on the\nresponsibility of taking the children to school and to their medical and\ndental appointments. R. 14. R. 59. In fact, from the time the Parties’ son,\nB.M.M. was born in 2019, until the time of the final trial in 2023, Plaintiff\nhad not taken him to any appointments. R. 60. Similarly, after the\nParties’ daughter, A.K.M., turned seven years old, Plaintiff had not been\nto any of her appointments either. R. 61.\nOn direct examination by Defendant’s counsel, Defendant testified\nthat one major point of contention that led to their separation, and\n12\nultimately their divorce, was the difference in how Plaintiff treated their\ndaughter compared to their son. R. 205. The Defendant did not agree with\nhow Plaintiff chose to parent. R. 164. She stated that the Plaintiff spent\nmost of his time focused on A.K.M., so the Defendant was the primary\ncaretaker for B.M.M. R. 164.\nOne specific situation that the Defendant recalled for the Court was\nwhen Plaintiff decided to purchase a cellphone for their daughter when\nshe was about seven years old. R. 164. Defendant expressed her\ndisapproval of A.K.M. having a cellphone that young, but the Plaintiff\ntold her “Well, I’m going to do what I want to do. That’s my daughter.” R.\n164. Since having the cellphone, Defendant has found A.K.M. using it for\ninappropriate purposes such as making TikTok videos to songs with\nexplicit language that led to the cellphone being taken away as\npunishment. R. 165. While the Parties would discuss the inappropriate\nuse of the cellphone, Plaintiff always allowed A.K.M. to have the\ncellphone back. R. 165.\nDefendant also provided testimony that Plaintiff would purchase\nexpensive gifts for A.K.M. throughout their marriage. Defendant also\nstated that during the divorce, Plaintiff pushed A.K.M. away from her\n13\nand got closer to Plaintiff. R. 172. R. 185. Plaintiff admitted that both\ndogs were purchased for A.K.M. R. 37. Also, during the pendency of the\ndivorce, Plaintiff redecorated A.K.M.’s room and bought her items from\nher wish list that consisted of things such as: two pajama sets worth\n$150.00, makeup, and other clothing items. R. 184. Plaintiff promised\nA.K.M. that he would take her to a Taylor Swift concert. R. 78. Also,\nshortly before the final trial, Defendant testified that she heard Plaintiff\ntell their daughter that she could not go on her school field trip unless\nDefendant agreed to settle the divorce case. R. 185.\nDefendant testified that another area of contention was the\nphysical abuse she suffered. R. 167. Defendant testified that Plaintiff has\nshoved her, knocked her on the couch, and pushed the couch over that\nresulted in her falling on the floor. R. 168. She recounted an incident\nwhere Plaintiff took her cellphone and went upstairs. R. 168. In response,\nshe followed Plaintiff upstairs and took his laptop as retaliation. R. 168.\nHe grabbed the laptop from her and hit her on the head with it, which\nleft a raised bump on her head. R. 168. R. 143. Then, Plaintiff spit on her.\nR. 169. After the incident, Defendant showed her friend, Stacy Green\n(“Green”), the bump. R. 143.\n14\nOn direct examination of Green, she testified that she did recall\nseeing Defendant with “quite a goose egg on the front of her head”, and\nshe was told by Defendant that Plaintiff hit her with a laptop. R. 143.\nGreen testified that Defendant did not seek medical treatment because\nshe was terrified that DHR would take her kids. R.144. According to\nGreen, Plaintiff was very controlling, and Defendant’s self-esteem\nsuffered because of it. R. 144. Green and Defendant had been friends\nsince before she was married to Plaintiff, and she knew that the Parties\nwere having marital issues. R. 141. R. 143. Other testimony provided by\nGreen was that Defendant was a wonderful mother. R. 146.\nContrary to Defendant’s testimony, Plaintiff claimed that the\nDefendant’s abusive behavior towards him and A.K.M. led to him filing\nfor divorce. R. 8. Plaintiff testified that the day before he filed for divorce,\nhe witnessed Defendant put their daughter against the wall, slap her in\nthe face, and hit her in the mouth. R. 8. There was no testimony that law\nenforcement was called.\nPlaintiff testified that after he filed for divorce, A.K.M. attended her\nfriend, Brooklyn’s, birthday party. R. 49. Defendant was present at the\nbirthday party since she was close friends with Brooklyn’s mom, Porscha\n15\nCaldwell (“Porscha”). R. 49. R. 211. During the party, A.K.M. spent time\nwith Defendant. R. 49.\nDuring Plaintiff’s cross examination by Defendant’s counsel,\nDefendant’s counsel moved to admit two videos into the record. R. 49-52.\nThe videos were admitted. R. 52. Plaintiff testified that the first video in\nthe exhibit depicted A.K.M. and Defendant rocking in a rocking chair and\nlooking at a story on a cellphone together during the party. R. 49.\nDuring Defendant’s direct examination by Defendant’s counsel, she\nstated that she was not allowed to pick A.K.M. up and take her to the\nbirthday party, so Plaintiff had someone else take her. R. 182. When it\nwas time for A.K.M. to leave, Defendant noticed that A.K.M.’s demeanor\nhad changed, and she would no longer come around Defendant. R. 183.\nA.K.M. waited by the road for Plaintiff to pick her up. R. 183. Defendant\nnoticed that any time she was around A.K.M. without Plaintiff they\nbonded but when Plaintiff was around, A.K.M. did not engage with her.\nR. 187.\nPorscha testified that A.K.M. and Defendant had a great, normal\nmother and daughter relationship. Porscha and Brooklyn spent summers\nwith A.K.M. and Defendant. R. 212.\n16\nAs for the second video in the exhibit, Plaintiff testified that it was\nB.M.M. facetiming Defendant to tell her that he loved her before bed. R.\n51. Plaintiff admitted that this was something the children did every\nnight before bedtime. R. 51. This video was recorded after the divorce was\nfiled. R. 51. Defendant testified that during those calls, she would ask to\nspeak to A.K.M. and Plaintiff would tell her that she had to call A.K.M.’s\ncellphone directly. R. 154. When Defendant tried to call A.K.M., her\nnumber was blocked. R. 154.\nPlaintiff’s counsel moved to admit Exhibit 9 into the record, and it\nwas admitted. R. 10. R. 11 Plaintiff testified that the exhibit depicted an\ninjury to A.K.M.’s arm caused by Defendant during an at-home dance\npractice in the basement. R. 10. Plaintiff admitted that he was not\npresent in the basement. R. 10. Defendant testified that the injury was\ncaused by Plaintiff’s nephew, Landon, who likes to play rough with\nA.K.M. R. 173. Defendant stated that in the past, Landon has hit and\nscratched A.K.M., B.M.M., and scratched some of A.K.M.’s friends. R.\n173. Defendant denied causing the bruise. R. 174.\nThereafter, Plaintiff’s counsel moved to admit Exhibit 10 into the\nrecord, and it was admitted. R. 11. R. 13 Plaintiff testified that the\n17\nExhibit 10 depicted a bruise on A.K.M. that he thought happened at\nschool but had since learned that Defendant spanked her with a belt\nbuckle. R. 11. However, Plaintiff admitted that he was not present to\nwitness the event. R. 11. Defendant testified that A.K.M. received this\ninjury in either third or fourth grade by another student who stepped on\nher leg. R. 174. Defendant stated that she reported the injury to A.K.M.’s\nafter-school teacher. R. 174. Defendant denied causing the injury. R. 174.\nOn or about September 28, 2023, Plaintiff placed A.K.M. in\ncounseling at Healing Hearts in Alex City, Alabama. R. 38. R. 86. Her\nCounselor, Heather Dixon (“Dixon”), had four appointments with A.K.M.\nprior to the final trial. R. 86. During direct examination by Plaintiff’s\ncounsel of Dixon, she testified that after the initial intake, she made a\nreport to DHR since she was a mandatory reporter. R. 89. However, at\nthe time of the final trial, which was more than a month after the report\nwas made, DHR had not investigated. R. 96. After the final trial but\nbefore the Final Decree of Divorce was issued, DHR found that Defendant\nwas “Not Indicated for Physical Abuse, Bruises, or Cuts on A.K.M.” C.\n081-082, Doc. 149.\n18\nDixon testified that she “works with the parent and the child to\ncome to some kind of resolution.” R. 87. Yet, her recommendation was for\nDefendant to have supervised visitation with both children even though\nshe had never met B.M.M. and her only conversations were with A.K.M.\nand Plaintiff. R. 89. R. 90. Dixon admitted to not discussing any issues\nwith Defendant because she was still building rapport and trust with\nA.K.M. R. 94.\nDuring cross-examination by Defendant’s counsel, Dixon was\nshown the video of A.K.M and Defendant spending time together at\nBrooklyn’s birthday party. R. 91. When Dixon was asked by Defendant’s\ncounsel if she would be surprised that this video was recorded eight days\nbefore Dixon’s first meeting with A.K.M., she responded, “Uh-huh”,\n(indicating yes). R. 91.\nIn Defendant’s case-in-chief, Defendant’s counsel called Tasha\nHowell (“Howell”) as a witness. R. 134. Howell and Defendant had been\nfriends for eight years and their daughters were on the dance team\ntogether. R. 135. During competition season, Howell, Defendant, and\ntheir daughters spent around five to six weekends together preparing for,\ntraveling to, and competing in dance competitions. R. 136. Howell stated\n19\nthat these weekends were high stress for everyone involved but she never\nwitnessed Defendant lose her temper with A.K.M. R. 137. She further\nstated that Defendant handled all of A.K.M.’s dance competitions, while\nPlaintiff just watched the competitions. R. 138. Howell stated that she\nsaw a good relationship between A.K.M. and her mother. R. 136.\nAt the time of the final trial, the Parties had been separated since\nAugust 16, 2023. R. 6. Plaintiff was living in the marital home with the\nchildren pendente lite, and Defendant was living at her friend’s mother’s\nhome. R. 221. Both Parties were working. R. 17. R. 149. R. The Plaintiff\ntestified that he was earning about $105,000.00 annually and Defendant\ntestified that she was earning about $41,000.00 annually as a Manager\nfor Triton Management Group (“Triton”). R. 149. R. 17.\nSTATEMENT OF THE STANDARD OF REVIEW\nWhen a [trial] court makes a custody determination\nbased on ore tenus evidence, its findings in support of that\ndetermination are accorded a presumption of correctness on\nappeal. Ex parte Bryowsky, 676 So. 2d 1322, 1324-26 (Ala.\n1996). An appellate court will not reverse the [trial] court’s\ncustody judgment ‘unless the evidence so fails to support\nthe determination that it is plainly and palpably wrong, or\nunless an abuse of the trial court’s discretion is shown. Id.\nTo substitute our judgment for that of the trial court would\nbe to reweigh the evidence. This Alabama law does not\nallow.” Phillips v. Phillips, 622 So.2d 410, 412 (Ala.Civ.App.\n1993).\n20\nSUMMARY OF THE ARGUMENT\nIn its Final Decree of Divorce, the trial court made no findings of\nfact relating to child custody and the fitness of each party; it simply\nstated that the Parties would be awarded joint legal custody and Plaintiff\nwould have sole physical custody of the minor children with Defendant\nhaving visitation rights. Initial custody determinations are based on the\nbest interest of the child standard. Yet, applying the standard to the facts\nin this case, an award other than joint physical custody of the minor\nchildren was a determination that was plainly and palpably wrong.\nFurthermore, if the trial court found that domestic or family\nviolence had occurred such that there was a rebuttable presumption\nagainst Defendant having custody, the testimony and evidence presented\nat the final trial was enough to rebut that presumption. Plaintiff alleged\ninstances of Defendant abusing their daughter. Yet, Plaintiff\ncontinuously allowed Defendant to care for their children. Defendant\ntook them to school, hospital and dental appointments, as well as\nweekend dance competitions. Further, several witnesses provided\ntestimony that Defendant and her daughter had a good mother-daughter\nrelationship, and they never saw any instances of abuse.\n21\nThe trial court erroneously awarded Plaintiff sole physical custody\nof the minor children when the evidence and testimony in this case have\nshown that was not in the best interest of the children.\nTaking the totality of the evidence presented, the trial court\nerroneously found that Defendant did not rebut the presumption against\ncustody.\nARGUMENT\nI. THE TRIAL COURT ERRED TO REVERSAL WHEN\nIT AWARDED SOLE PHYSICAL CUSTODY TO\nPLAINTIFF AND VISITATION TO DEFENDANT\nINSTEAD OF JOINT PHYSICAL CUSTODY TO THE\nPARTIES AS THAT WAS NOT IN THE BEST\nINTEREST OF THE CHILDREN.\n“When the trial court makes an initial custody determination,\nneither party is entitled to a presumption in his or her favor, and the ‘best\ninterest of the child’ standard will generally apply.” Ex Parte Byars, 794\nSo.2d 345, 347 (Ala. 2001). However, the following factors must be\nconsidered when determining the best interest of the children: the sex\nand age of the children, the characteristics and needs of each child, the\nrelationship between each child and each parent, and the relationship\nbetween the children. Ex Parte Devine, 398 So.2d 686, 696 (Ala. 1981).\nOther factors that are important are the respective home environments\n22\noffered by the parties; each parent’s age, character, stability, mental and\nphysical health, and each parent’s ability to provide for the emotional,\nsocial, moral, material and educational needs of the children. Id. at 697.\nAt the time of the final trial, the Parties had been separated for\nroughly two and a half months. Plaintiff was living in the marital home\nwith the children pendente lite, and Defendant was living at her friend’s\nmother’s home. The Parties were both employed. Plaintiff was making\nabout $105,000.00 annually and Defendant about $41,000.00 annually as\na Manager for Triton Management Group (“Triton”). Prior to Defendant\nobtaining her position with Triton, she was a stay-at-home mother for\ntwo years.\nHowever, the Parties agree that for the majority of the marriage,\nthey both were employed and worked as a team to care for the home and\nthe children. Defendant took the children to school and to their doctor\nand dental appointments. She was also responsible for getting A.K.M. to\nher dance competitions. Plaintiff also testified that every night the\nchildren Facetimed their mother to tell her goodnight.\nThere was concerning testimony that Plaintiff was actively\nengaging in tactics to alienate A.K.M. from Defendant, which was not in\n23\nher best interest. Plaintiff purchased expensive gifts for A.K.M. ($150.00\npajama sets, make up, clothes, and dogs) and made negative comments\nabout Defendant in front of A.K.M. (you can go on your school fieldtrip if\nyour mom settles this case) that affected the relationship between A.K.M.\nand the Defendant. Yet, when Plaintiff was not around, A.K.M. bonded\nwith the Defendant. It was only when the Plaintiff was around that\nA.K.M. became distant.\nLastly, the Court heard from several witnesses that had been\nfriends with Defendant ranging from eight years to fifteen years. Their\nsentiments were all the same. Green said that Defendant was a\nwonderful mother. Porscha said that A.K.M. and Defendant had a great\nand normal mother-daughter relationship. There was nothing out of the\nordinary that she noticed. Howell said that she had only seen a good\nrelationship between her and A.K.M.\nUltimately, there was substantial testimony and evidence\npresented at the final trial that does not support the trial court’s Final\nDecree of Divorce. After applying the applicable best interest of the child\nfactors to this case, it is clear that the trial court’s determination is\nplainly and palpably wrong. Accordingly, the trial court erred to reversal\n24\nby failing to find that it was in the best interest of the children that the\nParties be awarded joint physical custody.\nII. THE TRIAL COURT ERRED TO REVERSAL WHEN\nIT AWARDED SOLE PHYSICAL CUSTODY TO\nPLAINTIFF AND VISITATION TO DEFENDANT\nWHEN THERE WAS SUFFICIENT EVIDENCE TO\nOVERCOME THE REBUTTABLE PRESUMPTION\nAGAINST DEFENDANT HAVING CUSTODY.\nIn its Final Decree of Divorce, the trial court made no findings of\nfact relating to child custody and the fitness of each party; it simply\nstated that the Parties would be awarded joint legal custody and Plaintiff\nwould have sole physical custody of the minor children with Defendant\nhaving visitation rights. Pursuant to Alabama Code § 30-3-131 (1975),\nIn every proceeding where there is at issue a dispute as to the\ncustody of a child, a determination by the court that domestic\nor family violence has occurred raises a rebuttable\npresumption by the court that it is detrimental to the child and\nnot in the best interest of the child to be placed in sole custody,\njoint legal custody, or joint physical custody with the\nperpetrator of domestic or family violence. Notwithstanding\nthe provisions regarding rebuttable presumption, the judge\nmust also take into account what, if any, impact the domestic\nviolence had on the child.\nALA. CODE § 30-3-131(1975). However, if there is testimony and evidence\npresented to the court that offsets any bad evidence or testimony, it can\n25\nbe used to rebut the presumption against custody. Headrick v. Headrick,\n916 So.2d 610, 614 (Ala.Civ.App. 2005).\nIn Headrick, the wife initiated a divorce action by filing a Petition\nfor Protection from Abuse against the husband, which was granted, and\nthe husband filed a Counterclaim for divorce. Id. at 612. The Court found\nthat both parties were physically abusive towards each other and had\ndifficulties with proper parenting. Id. The husband was aware that wife\nabused prescription drugs but allowed her to keep the child. Id. The wife\nwas aware of the husband's temper but still allowed the child to stay with\nhim, even though her family was available to watch the child. Id. Each\nparty argued they were the better parent to have custody of the child. Id.\nUltimately, the court concluded that neither parent was better than the\nother and awarded the Parties joint legal and physical custody of the\nchild. Id.\nThe Headrick case provides the appropriate rule of law governing\nthe decision on rebutting a presumption against a parent having custody.\nIn the present case, the Parties were seeking sole physical custody of the\nminor children by claiming they were the fit and proper person to have\ncustody. Plaintiff presented testimony that Defendant was physically\n26\nabusive towards him and their daughter, which led him to file for divorce.\nNotably, for two of the three incidents involving A.K.M., he was not\npresent to witness who injured her.\nPlaintiff claims that Defendant grabbed their daughter’s arm\nduring an at-home dance practice in the basement. Plaintiff was not in\nthe basement. Defendant provided testimony that A.K.M.’s cousin,\nLandon, caused the bruise on her arm while playing rough with her,\nwhich is apparently a common occurrence with Landon. Further, the\ntestimony presented by the parties regarding the injury to A.K.M.’s leg,\nwas that it happened while she was in third or fourth grade. A.K.M. is\nnow in sixth grade. Defendant provided testimony that the injury\nhappened while at school, which mirrored Plaintiff’s testimony. Except,\nPlaintiff conveniently stated that since this pending divorce, he found out\nthat Defendant caused the injury.\nInterestingly, prior to this divorce action being initiated, the\nPlaintiff allowed the children to be around the Defendant all the time.\nDefendant took the children to school and to their doctor and dental\nappointments. There was also testimony provided by Tasha Howell\n(“Howell”) that Defendant was responsible for handling all of A.K.M.’s\n27\ndance competitions. She went on to say that during competition season it\nwas not uncommon for her, Defendant, and their daughters to spend five\nto six weekends traveling to competitions together, which caused a lot of\nstress for everybody. However, Howell never once saw Defendant lose her\ntemper with A.K.M.\nFurthermore, there was testimony from Plaintiff that he allowed\nA.K.M. to attend her friend, Brooklyn’s, birthday party after he filed for\ndivorce. Defendant was present at the party and spent that time bonding\nwith A.K.M. There was a video recording of Defendant and A.K.M.\nrocking in a rocking chair at the party and looking at a story on a\ncellphone together. This is particularly important since A.K.M.’s\ncounselor, Heather Dixon (“Dixon”), testified at the final trial that seeing\nthe video, which was recorded just a week before their initial\nappointment, surprised her. At all times during A.K.M.’s interactions\nwith Dixon, Dixon had only spoken to A.K.M. and Plaintiff about issues\nwithout any input from Defendant. Significantly, after the final trial was\nover but before the Final Decree of Divorce was issued, Defendant’s\ncounsel submitted a letter from DHR to the Court that Defendant was\nNot Indicated for Physical Abuse, Cuts, or Bruises of A.K.M.\n28\nBased on the totality of the evidence, Defendant rebutted the\npresumption against custody, and the trial court was plainly and\npalpably wrong for awarding Plaintiff sole physical custody of the minor\nchildren. Accordingly, the trial court erred to reversal by failing to find\nthat Defendant overcame the rebuttable presumption against custody.\nCONCLUSION\nBased on the arguments and authorities cited herein, the trial\ncourt’s Final Order is due to be reversed.\nRespectfully submitted this 21st day of November, 2024.\n/s/ Barbara H. Agricola\nBarbara H. Agricola, (AGR004)\n/s/ Algert S. Agricola, Jr.\nAlgert S. Agricola, Jr. (AGR001)\n/s/ Morgan R. Caro-Whipple\nMorgan R. Caro-Whipple (CAR273)\nCounsel for Brittany Gilliland\nOF COUNSEL:\nAGRICOLA LAW, L.L.C.\n127 south 8th Street\nOpelika, AL 36801\n(334) 759-7557 P\nbarbara@agricolalaw.com\nal@agricolalaw.com\nmorgan@agricolalaw.com\n29\nCERTIFICATE OF COMPLIANCE\nThis document complies with the type-volume limitation set forth\nin Ala. R. App. P. 32(a)(7), because, excluding the parts of the\ndocument exempted by Ala. R. App. P. 32(c), this document contains\n4,370 words which is less than 14,000 words as required by Ala. R.\nApp. P. 28(j)(1).\nThis document complies with the typeface requirements and\nthe type-style requirements of Ala. R. App. P. 32(a)(7) because this\ndocument has been prepared using Microsoft Word in 14-point\nCentury Schoolbook font.\nThis 21st day of November, 2024.\n/s/ Barbara H. Agricola\nBarbara H. Agricola, (AGR004)\n/s/ Algert S. Agricola, Jr.\nAlgert S. Agricola, Jr. (AGR001)\n/s/ Morgan R. Caro-Whipple\nMorgan R. Caro-Whipple (CAR273)\nCounsel for Brittany Gilliland\nOF COUNSEL:\nAGRICOLA LAW, L.L.C.\n127 south 8th Street\n30\nOpelika, AL 36801\n(334) 759-7557 P\nbarbara@agricolalaw.com\nal@agricolalaw.com\nmorgan@agricolalaw.com\nCERTIFICATE OF SERVICE\nI hereby certify that on November 21, 2024, I electronically filed the\nforegoing document with the Clerk of the Alabama Court of Civil Appeals\nusing the CTrack electronic filing system and I sent by electronic mail, a\ntrue and correct copy to the following counsel:\nThomas F. Young, Jr.\nP.O. Box 1160\nAlexander City, Alabama 35011\ntyoung@mhhlaw.net\nNancy Linn Eady\n3500 Blue Lake Drive, Suite 200\nBirmingham, Alabama 35243\nCounsel for Plaintiff\n/s/ Barbara H. Agricola\n/s/ Algert S. Agricola, Jr.\n/s/ Morgan R. Caro-Whipple\nOF COUNSEL\n31",
  "source_metadata": {
    "method": "pdfplumber",
    "pages": 31
  },
  "modified_time": 1759532853.0
}