{
  "doc_id": "ef33d26c4a29fefdebec4f7f26209a0a3b36f5990404771c05f142d766750517",
  "file_path": "C:\\Users\\blain\\Dropbox\\Master_Court_Files\\14_Discovery\\2025-09-15_Discovery_Requests_FROM_BRITTANY.pdf",
  "file_name": "2025-09-15_Discovery_Requests_FROM_BRITTANY.pdf",
  "doc_type": "pdf",
  "date": null,
  "parties": [],
  "raw_text": "IN THE CIRCUIT COURT OF TALLAPOOSA COUNTY, ALABAMA\nCHRISTOPHER BLAINE MCGREGOR,\nRespondent,\nv. CASE NO.: 70-DR-23-900051.01\nBRITTANY MICHELLE GILLILAND,\nPetitioner.\nPETITIONER’S SECOND SET OF CONSOLIDATED DISCOVERY REQUESTS\nCOMES NOW, Petitioner, BRITTANY MICHELLE GILLILAND, by and through the\nundersigned counsel of record, Barbara H. Agricola of Agricola Law LLC, and propounds the\nfollowing Interrogatories, Requests for Production of Documents, and Requests for Admission to\nthe Respondent, CHRISTOPHER BLAINE MCGREGOR, pursuant to Rules 33, 34, and 36 of\nthe Alabama Rules of Civil Procedure.\nPreliminary Statement and Definitions:\nThe following Preliminary Statement and Definitions apply to each of the Interrogatories set\nforth hereunder and they are deemed to be incorporated therein.\nA. The terms “you” and “your,” as they are used herein, refer to Respondent, and include any\nand all agents, servants, and employees to Respondent including, but not limited to,\nRespondent’s lawyer(s) and to any other person or persons acting pursuant to Respondent’s\ndirection.\nB. The singular number and the masculine gender, as used herein, shall be deemed to include\nthe plural, the feminine, or the neuter, as may be appropriate.\nC. The term “person” as used herein, shall be deemed to include, in the plural as well as\nsingular, any natural person, firm, association, partnership, joint venture, corporation or\nother legal entity unless the context is otherwise indicated.\nD. If you are asked to identify a person, please state for each such person:\n• That person’s full name;\n• If that person is other than a natural person (e.g., corporation, partnership, etc.), the\ntype of entity it is;\n• That person’s last known home address and the telephone number;\n• If the person is a natural person, his/her relationship (including business, blood or\nChristopher Blaine McGregor v. Brittany Michelle Gilliland\nCircuit Court of Tallapoosa County, Alabama\nCase No.: 70-DR-23-900051.01\nPetitioner’s First Set of Consolidated Discovery Requests\nPage 1 of 6\nother relationship), if any, to you.\nE. The term “document” as used herein, shall mean originals and all copies unless identical,\nof written, recorded and graphic matter, produced or reproduced, formal or informal,\nwhether for internal or external use, including but not limited to correspondence, letters,\nmemoranda, drafts, corporate minutes, notes, minutes, lists of persons or things, books,\ncharge cards, cancelled checks, mechanical and electrical sound recording, bonuses,\nretirement benefits, savings plans, stock options, and video tapes.\nF. These interrogatories call for all information (including information contained in writing)\nknown or available to you, including all information in the possession of your attorneys,\naccountants, employees and/or their firms, corporations and other persons acting on your\nbehalf or under your control.\nG. If you cannot answer any interrogatory fully, after exercising due diligence to make\ninquiries and secure the information requested, please so state and answer each\ninterrogatory to the extent you deem possible, specifying the portion of the interrogatory\nyou claim you are unable to answer fully and completely and specifying the facts upon\nwhich you rely to support your contention that you are unable to answer the interrogatory\nfully and completely and state with knowledge, information, or belief you have concerning\nthe unanswered portion of such interrogatory.\nH. These interrogatories are continuing in character so as to require you to file supplemental\nanswers and responses of you obtain further or different information before trial as required\nby the Alabama Rules of Civil Procedure.\nThese interrogatories are to be answered under oath in writing and said written answers\nunder oath are to be served upon Petitioner ’s attorney, Barbara H. Agricola, 127 South 8th Street,\nOpelika, Alabama 36801, within thirty (30) days of receipt of these interrogatories, pursuant to\nRule 33 of the Alabama Rules of Civil Procedure. These discovery requests are continuing in\nnature and are due to be supplemented should any answers change and/or need to be supplemented.\nIf such supplementation and/or changes becomes necessary, it is the responsibility of the\nanswering party to take whatever action to provide said changes/supplementation to Agricola Law,\nLLC.\nAdditionally, these discovery requests are requests to produce copies and therefore, any\ncosts for such production shall be reimbursed by Agricola Law, LLC. This means that an answer\nto any discovery request which makes the requested information/documents available for\ninspection shall be treated as a failure to respond since these are requests to produce, not make\navailable for inspection and therefore, the next appropriate steps will be taken to compel the\nproduction and/or response to said discovery requests answered in any fashion wherein it does not\ncomply with these requests to produce.\nChristopher Blaine McGregor v. Brittany Michelle Gilliland\nCircuit Court of Tallapoosa County, Alabama\nCase No.: 70-DR-23-900051.01\nPetitioner’s First Set of Consolidated Discovery Requests\nPage 2 of 6\nINTERROGATORIES\n1. Please explain why you fraudulently signed Mother’s 401(k) check and to which account you\ndeposited that check. Further, explain why you also filed Mother’s 2023 tax return without her\nknowledge, and provide the bank account that you direct deposited Mother’s tax return into.\nState the amount of funds for each, as well as the banking institution and account number.\nResponse:\n2. Please explain why you were terminated from your position at Briggs and Stratton and provide\ndocumentation of your termination.\nResponse:\n3. Please state if you ever notified Mother that HPV vaccine and ADHD appointments were made\non behalf of Minor Child A.K. Further, state if you ever received consent from Mother in\nregards to A.K.’s medical treatment, and why you failed to include her in the medical care of\nthe Minor Children.\nResponse:\n4. Please explain why you informed Minor Children’s school in August 2025 that Mother was\nnot to pick up the Minor Children after school and provide the documentation you gave to the\nschool to indicate as such.\nResponse:\n5. Please state if you have ever told a medical care professional, school official, or extra-curricular\nleader that Mother did not have any authority to make, cancel, or attend any appointments,\nactivities, school events, etc. Specifically, for each and every medical care provider, school,\nand extracurricular activity, state if you listed Mother as a secondary/emergency contact and\nif you have ever attempted to hinder Mother’s ability to exercise her legal rights as a parent in\nregards to making appointments, attending activities, and awareness of appointments and\nactivities.\nResponse:\nChristopher Blaine McGregor v. Brittany Michelle Gilliland\nCircuit Court of Tallapoosa County, Alabama\nCase No.: 70-DR-23-900051.01\nPetitioner’s First Set of Consolidated Discovery Requests\nPage 3 of 6\nREQUEST FOR PRODUCTION\nThe requested documents are to be produced and require the answering party to provide\ncopies and/or duplicates of the same to be served upon Barbara H. Agricola, 127 South 8th Street,\nOpelika, Alabama 36801, within thirty (30) days of receipt of these requests for production of\ndocuments, pursuant to Rule 34 of the Alabama Rules of Civil Procedure.\nThe requests for production shall be deemed continuous so as to require seasonable\nsupplemental answers if the Defendant obtains further information between the time of answering\nthese interrogatories and the time of the trial of this action. If such supplementation and/or changes\nbecome necessary, it is the responsibility of the answering party to take whatever action to provide\nsaid changes/supplementation to Agricola Law, LLC.\n1. Please provide copies of your personal 2023-2025 state and federal income tax returns,\nand all W-2, 1099, or other appropriate forms and schedules thereto for said years.\nResponse:\n2. Please provide any and all records, notes, reports, files, e-mails, and other data and data\ncompilations stored in any medium and any other documentary evidence of income from\nself-employment, rent, royalties, proprietorship of business, and joint ownership of a\npartnership or closely held corporation.\nResponse:\n3. Please provide any and all documentation to support each response to the Interrogatories.\nResponse:\n4. Please provide any and all documents and other physical evidence which you may use in\npreparation or at any of the proceedings of this cause including any pictures of an explicit\nnature or otherwise, regardless of whether you intend to use it at the trial in this action.\nThis includes anything related to rebuttal or impeachment.\nResponse:\n5. Provide statements for each and every car payment made on Mother’s vehicle including\nthe date and balance of the vehicle, and state if the debt accrued was paid off in full as of\nMarch 1, 2024, with documentation provided.\nResponse:\n6. Provide any and all police reports from February 2023 to present that have been made in\nregards to any altercations between the Parties.\nChristopher Blaine McGregor v. Brittany Michelle Gilliland\nCircuit Court of Tallapoosa County, Alabama\nCase No.: 70-DR-23-900051.01\nPetitioner’s First Set of Consolidated Discovery Requests\nPage 4 of 6\nResponse:\n7. Provide documentation of each and every social media post, on any and all platforms, that\nhave been made about Mother whether directly or indirectly, including posts made by A.K.\nProvide screenshots of any posts and screen-recordings/downloads of any videos made.\nResponse:\n8. Provide a copy of the 2023 tax return that you filed on Mother’s behalf.\nResponse:\n9. Provide a copy of the 401(k) check that was signed fraudulently in 2024 as well as the\nmobile deposit that was made to your account.\nResponse:\n10. Provide documentation of each and every child support payment made by Mother from\nFebruary 2024 to August 2024. Further, provide any proof and/or documentation you\nprovided to Alabama DHR in order to garnish Mother’s wages.\nResponse:\n11. Please provide any and all documentation to support your response to Interrogatory # 7,\nincluding a list of prescriptions filled/refilled from each pharmacy.\nResponse:\nChristopher Blaine McGregor v. Brittany Michelle Gilliland\nCircuit Court of Tallapoosa County, Alabama\nCase No.: 70-DR-23-900051.01\nPetitioner’s First Set of Consolidated Discovery Requests\nPage 5 of 6\nREQUESTS FOR ADMISSIONS\nThe requested responses are to be admitted or denied and shall be served upon Petitioner’s\nAttorney, Barbara H. Agricola, 127 South 8th Street, Opelika, Alabama 36801, within thirty (30)\ndays of receipt of these requests for admissions, pursuant to Rule 36 of the Alabama Rules of Civil\nProcedure.\nThe requests for admission shall be deemed continuous so as to require seasonable\nsupplemental answers if the Defendant obtains further information between the time of answering\nthese requests and the time of the trial of this action. If such supplementation and/or changes\nbecome necessary, it is the responsibility of the answering party to take whatever action to provide\nsaid changes/supplementation to Agricola Law, LLC.\n1. Please admit or deny that you informed Dr. Tyler or his staff that Mother was not\nauthorized to change or cancel A.K.’s medical appointments.\nAdmit Deny\n2. Please admit or deny that you informed Minor Children’s school that Mother was not\nto pick up the Children in August 2025.\nAdmit Deny\nRespectfully submitted on September 15, 2025.\n/s/ Barbara H. Agricola (AGR004)\nAttorney for Petitioner\nOF COUNSEL:\nAGRICOLA LAW\n127 South 8th Street\nOpelika, Alabama 36801\nTelephone: 334.759.7557\nFacsimile: 334.759.7558\nbarbara@agricolalaw.com\nwww.agricolalaw.com\nChristopher Blaine McGregor v. Brittany Michelle Gilliland\nCircuit Court of Tallapoosa County, Alabama\nCase No.: 70-DR-23-900051.01\nPetitioner’s First Set of Consolidated Discovery Requests\nPage 6 of 6",
  "source_metadata": {
    "method": "pdfplumber",
    "pages": 6
  },
  "modified_time": 1759000399.0
}