{
  "doc_id": "f1208e8ba62fe593a558198f70a391655cb0db018c448f6e6a3f17680c184f48",
  "file_path": "C:\\Users\\blain\\Dropbox\\Master_Court_Files\\11_Appeal_Documents\\Appellee Brief Final (1).pdf",
  "file_name": "Appellee Brief Final (1).pdf",
  "doc_type": "pdf",
  "date": null,
  "parties": [],
  "raw_text": "IN THE COURT OF CIVIL APPEALS OF ALABAMA\n---------------------------------------\nCASE NO. CL-2024-0597\n---------------------------------------\nBRITTANY MICHELLE GILLILAND,\nAPPELLANT,\nv.\nCHRISTOPHER BLAINE MCGREGOR,\nAPPELLEE.\nOn Appeal from the Tallapoosa County Circuit Court\nDR-2023-900051\n-------------------------------------------------------------------------------------------------\nBRIEF OF APPELLEE, CHRISTOPHER BLAINE MCGREGOR\n--------------------------------------------------------------------------------------------------\nNANCY L. EADY THOMAS F. YOUNG, JR.\nMORRIS HAYNES MORRIS HAYNES\n3500 Blue Lake Drive Post Office Box 1660\nSuite 200 Alexander City, Alabama\nBirmingham, Alabama 35011-1660\n35243\n205-324-4008 256-329-2000\nneady@mhhlaw.net tyoung@mhhlaw.net\nATTORNEY FOR CHRISTOPHER BLAINE MCGREGOR\nORAL ARGUMENT NOT REQUESTED.\nSTATEMENT REGARDING ORAL ARGUMENT\nChristopher Blaine McGregor, the appellee, does not request oral\nargument.\n1\nTABLE OF CONTENTS\nSTATEMENT REGARDING ORAL ARGUMENT ..................................1\nTABLE OF CONTENTS .........................................................................2\nTABLE OF AUTHORITIES ....................................................................4\nINTRODUCTION .....................................................................................6\nSTATEMENT OF THE CASE ................................................................6\nSTATEMENT OF THE ISSUE ............................................................. 10\nSTATEMENT OF FACTS ..................................................................... 10\nA. There Was Conflicting Testimony About Who Took Primary\nCare of the Children ............................................................. 11\nB. There Was Conflicting Testimony Whether The Mother Had\nHurt Daughter Physically and Mentally .............................. 13\nC. There Was Conflicting Evidence on the Issue of Whether the\nWife Exhibited Signs of Mental Instability While Arguing\nWith the Father .................................................................... 17\nD. There was Conflicting Evidence on the Discipline Issues\nSurrounding Cell Phones and Other Gifts ........................... 19\nE. The Testimony of Heather Dixon, the Daughter’s Counselor,\nSupports Giving Physical Custody to the Father ................. 20\nSTATEMENT OF THE STANDARD OF REVIEW .............................. 21\nSUMMARY OF THE ARGUMENT ...................................................... 23\n2\nARGUMENT ......................................................................................... 26\nA. Evidence Heard by the Trial Court is Not Present in the\nRecord on Appeal, Requiring the Trial Court’s Judgment to\nBe Affirmed ........................................................................... 26\nB. There Was Substantial Evidence from Which the Court\nCould Have Found that the Wife Abused the Daughter ...... 31\nC. Substantial Evidence Supported the Judge’s Finding that It\nWas In the Best Interest of the Children to Award the\nFather Custody ..................................................................... 35\nCONCLUSION ...................................................................................... 38\nATTORNEY'S FEE DECLARATION ..................................................... 39\nCERTIFICATE OF COMPLIANCE ....................................................... 41\nCERTIFICATE OF SERVICE ................................................................ 42\n3\nTABLE OF AUTHORITIES\nCase: Page:\nBynum v. Bynum,\n296 So. 2d 711 (Ala. Civ. App. 1974).................................... 24,26,28\nCorbitt v. Corbitt,\n369 So. 3d 1078 (Ala. Civ. App. 2022)....................................... 23,31\nEx parte Bryowski,\n676 So. 2d 1322 (Ala. 1996)....................................................... 22,34\nEx parte Fann,\n810 So. 2d 631 (Ala. 2001) ............................................................. 22\nHagler v. Hagler,\n278 So. 2d 715 (Ala. Civ. App. 1973).............................................. 30\nJohnson v. Johnson,\n395 So. 2d 1043 (Ala. Civ. App. 1981)....................................... 30,31\nRobinson v. Robinson,\n--- So. 3d ---, No. CL-2024-0074, 2024 WL 4096163 (Ala. Civ. App.\n2024)......................................................................................... 23, 35\nSteed v. Steed,\n877 So. 2d 602 (Ala. Civ. App. 2003)......................................... 23,35\n4\nStatutes and Rules: Page:\nAla. R. App. P. 28(j)(1) ............................................................................ 41\nAla. R. App. P. 32(a)(7) ........................................................................... 41\nAla. R. App. P. 32(d)................................................................................ 41\n5\nINTRODUCTION\nThis appeal stems from divorce proceedings between Christopher\nBlaine McGregor (“the father”) and Brittany Michelle Gilliland (“the\nmother”). Christopher McGregor filed for divorce after he discovered\nBrittany had been abusing their minor daughter to the point that there\nwere marks on her. Ample testimony showed that the abuse occurred,\nthat the children were more comfortable with their father, and that the\nfather was more capable of looking after them than was the mother.\nBased on the ore tenus rule, the evidence adduced at court and the fact\nthat some of the evidence the trial court based its decision on was not\npresent in the record on appeal, the trial court’s decision to award the\nfather sole physical custody of the children was justified. The appeal\nshould be denied.\nSTATEMENT OF THE CASE\nThe father and the mother were married in May 2018. R. 12.\nTwo children resulted from the marriage, A.K., a daughter, born May 24,\n2012 and B.M., a son, born May 10, 2018. (“daughter” and “son”\nrespectively.)\n6\nOn August 18, 2023, the father filed for divorce from the mother on\nthe grounds of incompatibility. R. 12-14. In the complaint for divorce,\nthe father asked for custody of the minor children with the mother to be\nallowed visitation. R. 13. At the same time, the father moved for\nemergency ex parte pendente lite relief, alleging that the mother had\n“recently caused physical injury to [the daughter] by striking or grabbing\nher in a way that left bruises or other marks on said child.” R. 14. The\npetition also alleged that because the son was only four years old, he\nwould not be able to adequately articulate facts if he were subject to\nphysical abuse. R. 15. Finally, the petition also alleged that the\nmother “has been acting erratically regarding the discipline of the\nparties’ children within the last year.” R. 15. The trial judge issued a\npendente lite order the same day granting the father physical custody of\nthe minor children and setting the “matter” for hearing on September 12,\n2023. R. 17. The mother filed an answer and counterclaim for divorce\non September 8, 2023. R. 19. Her counterclaim alleged that the father\nwas “manipulative and controlling,” that he “refused to allow [her] to\nhave a bank account,” and that he “constantly berated her in front of the\n7\nchildren.” R. 20. The same day, the mother also requested pendente\nlite relief. R. 23.\nThe trial court held a pendente lite hearing on all parties’ motions\non September 12, 2023. R. 27. At the pendente lite hearing, the trial\ncourt heard testimony ore tenus. R. 47. No transcript or summary of\nthe testimony was provided in the court record by the mother, appellee.\nThe pendente lite order stated that the parties would share legal custody\nof the minor children with primary placement with the father and set\nforth a visitation schedule for the mother. R. 47.\nThe final hearing on the initial divorce was held on November 6,\n2023. T. 1. The trial court took testimony from numerous witnesses.\nIn addition, the parties agreed that the Court would adopt the “full-\nfledged” pendente lite hearing and consider the testimony there in\nmaking his decision. T. 19. At the pendente lite hearing, the trial\njudge heard from the daughter. T. 13. With the permission of both\nparties, the trial judge spoke to the daughter in chambers without a court\nreporter present. S1.1\n1 On January 8, 2025, the father filed a motion to supplement the\n8\nOn February 1, 2024, the trial judge entered a “final decree of\ndivorce.” R. 83-90. However, that order was set aside by the trial court\nas being “entered in error.” R. 91. Instead, the final decree of divorce\nwas entered on February 27, 2024. R. 92-99. Pertinent to the child\ncustody issues raised by the mother in her appeal, the trial court ruled:\n1) The parents were awarded “joint legal custody” of both\nchildren. R. 95.\n2) The mother was given visitation periods the first and third\nweeks of each month from “picking up the children on Thursday at school\nuntil taking the children back to school the following Monday morning”\non those weeks. R. 95. The mother was further allowed visitation for\nan entire week during the first and third full weeks of June and July. R.\n95. Arrangements were made for holiday visitation as well. R. 97.\nFurther, each parent was given the right to “call or Facetime with the\nrecord on appeal with the trial court to include the following statement:\n“In addition to the materials contained in the record, as part of making\nits decision on the original divorce decree, the Court spoke to the minor\nchildren separately in chambers without either counsel or a court\nreporter present. This was done with the permission of all parties.”\nShould the motion be granted, the citation for this information will be\nprovided once the supplemental record is compiled.\n9\nminor children once a day while the child is with the other parent.” R.\n97. The mother was ordered to pay child support in the amount of $ 617\nper month for both children. R. 97. The trial court did not find that the\nfather had committed domestic abuse of the mother.\nSTATEMENT OF THE ISSUE\n1) Did sufficient evidence support the trial court’s award of physical\ncustody of both children to the father?\nSTATEMENT OF FACTS\nAt the trial of this matter, the trial court heard conflicting\ntestimony on matters relevant to child custody, including testimony not\npresented in the record on appeal, such as the testimony at the pendente\nlite hearing and the trial court’s conversations with the minor children.\nThe parties agreed that the daughter and the son are their natural\nchildren and that the daughter was born on May 24, 2012 and the son on\nMay 10, 2019. R. 7. Other than that, they presented conflicting\ntestimony on who took primary care of the children, whether the mother\nhad abused the daughter, whether the mother cared for the children as\nprimary custodian, and whether the father had abused the mother.\n10\nA. There Was Conflicting Testimony About Who Took\nPrimary Care of the Children\nThe father testified that when both the father and the mother were\nemployed, they acted as a team, cleaning the house together. However,\nwhen the mother lost her job, the mother stopped doing anything in the\nhouse. “The house was not kept up. There were always dishes in the\nsink, loads of clothes on the bed.” T. 14. At that point, the father did\nmost of the house-cleaning with help from the father’s mother, Lisa. T.\n14. The father testified as well that he did 90% of the cooking. T. 14.\nThis included lunch and dinner and all of the grocery shopping for both\nmeals. T. 14. In addition, he did about seventy percent of the clothes\nwashing. Id. The father further testified that once the mother was not\nworking, she did take care of the children’s doctor’s appointments. Id.,\n14-15.\nLisa McGregor, the father’s mother, testified that over the years,\nthe father did the cooking. T. 111-112. Ms. McGregor had the\nopportunity to observe the family both as a visitor and as residents, since\nthe family had lived with her on and off over the years. T. 111-112. She\ntestified that the father has a great relationship with his children, helps\n11\nthe daughter with her homework, feeds them, buys snacks for them,\ncooks for them and washes clothes. T. 112.\nIn contrast, the mother testified that she took care of most of the\nregular day-to-day care of the daughter from the time of the daughter’s\nbirth, although the father participated. T. 152. This day-to-day care\nincluded giving the daughter a bath, taking her to the doctor, washing\nclothes, preparing meals and taking her to dental and hair cut\nappointments, as well as registering her for school. T. 152. The mother\nalso testified that she made bottles and changed the son’s diapers. T.\n164. Both parties agreed that the mother took the kids to school before\ntheir separation. T. 14.\nRegarding a support system to help with the children, the father\ntestified that the mother does not have a support system because she had\nno relationship with either her mother or father. T. 45. The father has\nhis mother, his father, his brother and his sister-in-law who can help him.\nT. 37. The mother testified that she “had really great friends, but no\nfamily,” although she later added that she did have brothers and sisters.\nT. 176, 192.\n12\nB. There Was Conflicting Testimony Whether the Mother\nHad Hurt The Daughter Physically and Mentally\nThe parties disagreed over whether the mother had abused the\ndaughter. The father testified that he filed for divorce immediately\nwhen he saw the mother hurt the daughter for the first time. T. 8-9.\nHe heard the daughter screaming. T. 8-9. When the father walked into\nthe bedroom, he saw that the mother had the daughter up against the\nwall, and slapped her in the face, hit her in the mouth, and pulled her by\nthe hair into the living room. T. 8-9. The father testified that the\nmother had told him that “in her opinion, it was okay to slap a kid or pop\nthem in the mount if they smarted off to the adult.” T. 9. The father\nentered into an evidence a photograph taken after the mother and the\ndaughter had been in the basement practicing for a national dance\ncompetition and the mother thought the daughter wasn’t putting enough\neffort into the practice. T. 10. The photograph shows that Addie’s arm\nhad bruises and marks. Id. There was another photograph, Exhibit 10,\nthat the father submitted that he testified showed further marks on the\ndaughter. T. 12. For a long time, the father thought that the marks in\n13\nthat photo were made by someone at school, but he found out later that\nthe mother made the marks. T. 12.\nOne of the mother’s witnesses, Porcsha Caldwell, testified that she\nreceived a phone call from the mother before the divorce where the\nmother asked her if she had ever “popped” her child in the mouth. Ms.\nCaldwell answered, saying “If you just mean a little, you know, stop\ntalking to me that way slight pop in the mouth, nothing to hurt her, then\nyes, I have.” T. 218. The mother then responded to someone else,\npresumably the father, not on the telephone call, “See, I’m not the only\none…” Ms. Caldwell then heard the father say, “Porcsha can discipline\nher children how she wants to, but you’re not going to slap my child in\nthe face.” T. 219. Porcsha then said “I did not say I have ever slapped\nmy child in the face. I do not agree with that. I have lightly popped her\nin the mouth, and that was the extent of it.” T. 219.\nOn the other hand, the mother testified that she believed that the\ndaughter had been coached to say that the mother had caused the marks\non her arm. T. 204-205. She also testified that she did not cause any\nof the injuries in the photographs to the daughter in any form or\n14\nfashion. T. 174. The mother testified that it was L.M., the daughter’s\ncousin with Down’s Syndrome, who had caused the marks on the\ndaughter’s arms in that the two liked to “rough house.” T. 173.2\n“There’s been instances where he’s slapped at her arm. He’s scratched\nher, scratched her friends.” T. 173. However, on at least one occasion\nwhen L.M. supposedly had hurt the daughter rough housing with her,\nL.M.’s parents could prove that L.M. was nowhere near the daughter on\nthat day. On March 15, one of the days the marks appeared on the\ndaughter’s arms, it was spring break in Alex City and L.M. had been with\nhis maternal grandparents and his sister, not with the daughter. T. 125.\nAnd that evening, from 4:00 p.m. to 8:30 p.m., he was at the baseball field\nin his capacity as manager of the middle school’s baseball team. T. 125.\nThus, it would have been physically impossible for L.M. to have caused\nthe marks on the daughter. T. 126. L.M.’s mother testified that she\nhad never seen L.M. be inappropriately rough with the daughter at any\ntime. R. 127.\n2 L.M. is the father’s nephew, the son of the father’s brother Brian and\nsister-in-law, Katie. T. 126.\n15\nWith respect to mental abuse, the father’s mother, Lisa McGregor,\nexplained that the mother found it frustrating to help the daughter with\nher homework. Lisa explained, “She cannot comprehend that [the\ndaughter’s] not as smart – everybody has a different way of learning, I\nguess, you know, and it takes a little bit more time for [the daughter.]”\nT. 113. Lisa also testified that the mother had told her, when trying to\nhelp the daughter with her homework, “I can’t do this.” T. 113. Lisa\ntestified that the mother “gets too frustrated trying to help [the daughter]\ndo homework.” T. 113. Lisa has heard the mother call Addie stupid.\nT. 114. The father testified that the mother would get “absolutely\ndistraught” helping the daughter with her homework and so would call\nher “stupid and it would escalate from there.” T. 41. He has also seen\nthe mother yank food out of the daughter’s hands, telling the daughter\nshe would get fat and doing so would affect her dancing career. T. 41.\nThe father testified that he has seen the mother grab one of the family\ndogs by the neck and fling it onto the floor, while the daughter screamed\nand told the mother she shouldn’t have done that.” T. 42-43.\nMother’s witnesses were mainly individuals she knew through her\n16\ndaughter’s participation in a traveling dance team. T. 135, 211. One\nsuch friend, Tasha Howell, testified that over the last four- or five-years\nduring competition season, she and the mother and their children might\nbe together five to six weekends in the spring and “then we have different\nvarious things through the year.” T. 136. On those occasions, Ms.\nHowell has never seen the mother lose her temper with the daughter. T.\n137. However, Ms. Howell testified that she “supposes” that the mother\nhas a good relationship with the daughter. T. 138. However, all three\nof the mother’s witnesses, Howell, Caldwell and Stacy Green, testified\nthat the marks in the Exhibit 9 photograph, if made by a parent, were\ninappropriate and should never be made. T. 140, 146-147, 223.\nC. There Was Conflicting Evidence on the Issue of\nWhether the Mother Exhibited Signs of Mental\nInstability While Arguing with the Father\nWhile the mother claimed that the father abused her, evidence on\nthat point in fact showed the mother’s instability when her temper was\naroused. The mother claimed that the father had hit her on the forehead\nwith a laptop during an argument. T. 167-169. According to the\nmother, the father took her phone, and she followed him upstairs trying\n17\nto get it back. T. 167-169. While trying to do so, she snatched the\nlaptop up, he snatched it back and hit her over the head with it. T. 167-\n169. She also testified that the father has shoved her and pushed the\ncouch over, making her fall to the floor. T. 169.\nHowever, the father testified that he had been upstairs in the office\nand the mother came upstairs screaming and pushed him out of his\ncomputer chair. When she did so, the computer equipment came over\non top of him and her. “She did pull it. All the computer equipment\ncame over on top of us and … the kids had made it upstairs by that time\nand they were standing their screaming.” T. 15. The father testified\nthat he sent the daughter to go get his brother, who lived next door, for\nhelp, which she did. T. 15.\nIncidents like this so traumatized the daughter that she had a\nsecret “emoji” code with her aunt, Katie McGregor, where the daughter\ncould let her aunt know without interference if she needed help. T. 130.\nThat way, the daughter always knew somebody could come help her if\nshe needed it. T. 131. Katie testified that it was “almost always” the\nmother that upset the daughter that way rather than the father. T. 131.\n18\nD. There Was Conflicting Evidence On the Discipline\nIssues Surrounding Cell Phones and Other Gifts\nAnother area of disagreement between the father and the mother\nwas whether the father gave too many gifts to the daughter. The mother\ntestified that the father gave the daughter a cell phone when she was\nseven against her wishes. T. 165. However, the father testified that it\nwas a joint decision. T. 73. “[the daughter] had an iPad, the iPad with\nthe carrier was up for renewal, and in the store that day, based off\nwhatever promotion they had, there was no iPad promotion, and she got\na phone.” T. 73. The mother testified that the father failed to monitor\nthe daughter’s cell phone and would return it to the daughter against her\nwishes even if it had been taken away for discipline. T. 165. However,\nthe father testified that he did monitor the daughter’s cell phone. T. 75.\nIn addition, he testified that both parents would take it away for\ndisciplinary purposes if needed, including one time for more than a\nmonth. T. 75-76.\nThe mother also implied that the father gave the daughter gifts that\nwere too expensive during the pendency of the divorce, such as pajamas\nand makeup, as well as promising her Taylor Swift tickets, as compared\n19\nto the gifts that the son received. T. 184. However, in doing so, she has\noverlooked the fact that the son is only four, and so age-appropriate\npresents are correspondingly less expensive. T. 206. In addition, as\nthe mother admitted, at least two years of the son’s first four years fell\nduring the COVID pandemic, during which time little was happening\nanywhere. T. 206.\nE. The Testimony of Heather Dixon, The Daughter’s\nCounselor, Supports Giving Physical Custody to The\nFather.\nAt the November hearing, the trial court heard testimony from\nHeather Dixon, a professional counselor treating the daughter. At the\ntime of the hearing, she had completed four sessions with the daughter.\nT. 85-86. She had also met both the father and the mother, although she\nhad conducted no joint sessions. T. 86, 88.\nIn her opinion, the daughter has issues with her mother and is\nafraid of her. T. 87. Ms. Dixon is a mandatory reporter and based on\nher conversations with the daughter, she did report the mother to DHR.\nT. 88. Ms. Dixon has concerns about granting the mother custody of the\nchildren. In particular, she is concerned about the “alleged abuse. If\n20\nshe is able to become that angry and lose self-control, what may happen\nto the children?” T. 89. She believed that the father’s concerns about\nthe welfare of the children in the mother’s hands were valid. T. 96. In\naddition, her goal as a therapist is to repair the relationship between the\ndaughter and the mother. As she stated, “The relationship needs to be\nrepaired; the events that made [the daughter] scared … need to be talked\nthrough and some repairs made.” T. 88. The daughter has stated that\nshe does not want the mother with her during the sessions. T. 88.\nBased on the foregoing, giving the conflicting evidence and the\nevidence not included with the record on the appeal, the trial court’s\njudgment is support and the appeal must be denied.\nSTATEMENT OF THE STANDARD OF REVIEW\nThe standard of review in a child custody case is well settled.\n“When evidence in a child custody case has been presented ore tenus to\nthe trial court, that court’s findings of fact based on that evidence are\npresumed to be correct. The trial court is in the best position to make a\ncustody determination—it hears the evidence and observes the\nwitnesses.” Ex parte Bryowski, 676 So. 2d 1322, 1324 (Ala. 1996).\n21\n“Where a trial court does not make specific findings of fact concerning an\nissue, this Court will assume that the trial court made those findings\nnecessary to support its judgment, unless such findings would be clearly\nerroneous.” Ex parte Fann, 810 So. 2d 631 (Ala. 2001).\n“Appellate courts do not sit in judgment of disputed evidence that\nwas presented ore tenus before the trial court in a custody hearing.” Id.\nIn other words, an appellate court “will not reverse unless the evidence\nso fails to support the determination that is plainly and palpably wrong,\nor unless an abuse of the trial court’s discretion is shown. To substitute\nour judgment for that of the trial court would be to reweigh the evidence.\nThis Alabama law does not allow.” Id.\nMoreover, “this presumption is based on the trial court's unique\nposition to directly observe the witnesses and to assess their demeanor\nand credibility. This opportunity to observe witnesses is especially\nimportant in child-custody cases. ‘In child custody cases especially, the\nperception of an attentive trial judge is of great importance.’” Corbitt v.\nCorbitt, 369 So. 3d 1078, 1088 (Ala. Civ. App. 2022).\n“When the trial court makes an initial custody determination,\n22\nneither party is entitled to a presumption in his or her favor, and the ‘best\ninterest of the child’ standard will generally apply.” Robinson v.\nRobinson, --- So. 3d ---, No. CL-2024-0074, 2024 WL 4096263 at * 9 (Ala.\nCiv. App. 2024). There are several factors a trial court may consider in\nmaking the initial award of custody, including the “characteristics of\nthose seeking custody, including age, character, stability, mental and\nphysical health ... [and] the interpersonal relationship between each\nchild and each parent.” Id. Extra factors might include the sex and age\nof the children, and each parent’s ability to provide for their needs, but\nthe “overall focus of the trial court’s decision is the best interests and\nwelfare of the children.” Id., quoting Steed v. Steed, 877 So. 2d 602, 604\n(Ala. Civ. App. 2003).\nSUMMARY OF THE ARGUMENT\nThe mother’s appeal should be denied.\nFirst, the appellate courts have long held that “the judgment of a\ntrial court which is based on evidence heard by it but which is not\nincluded in the record on appeal cannot be disturbed by the appellate\ncourt where one of the grounds of appeal is the sufficient of the evidence\n23\nto support such judgment.” Bynum v. Bynum, 296 So. 2d 711, 725 (Ala.\nCiv. App. 1974). In reaching its decision, the trial court considered\nevidence adduced at the pendente lite hearing as well as a conversation\nin chambers with the children. T. 13, 19, S1.3 This evidence is not part\nof the trial record and thus the mother’s appeal, based on the sufficiency\nof the evidence, must be denied.\nThere was substantial evidence from which the Court could have\nfound that the mother abused the daughter. There was testimony from\nboth the father, Lisa McGregor who is the father’s mother, and the\ndaughter’s counselor regarding physical and mental abuse that took\nplace which supported the Court’s awarding physical custody to the\nfather. T. 8-9, 10, 12, 41, 42-43, 113, 114. 218-219\nIn addition, there was substantial evidence from which the trial\n3 On January 8, 2025, the father filed a motion to supplement the\nrecord on appeal with the trial court to include the following statement:\n“In addition to the materials contained in the record, as part of making\nits decision on the original divorce decree, the Court spoke to the minor\nchildren separately in chambers without either counsel or a court\nreporter present. This was done with the permission of all parties.”\nShould the motion be granted, the citation for this information will be\nprovided once the supplemental record is compiled.\n24\ncourt found that it was in the best interest of the children to award the\nfather primary physical custody. In addition to the evidence above\nshowing the mother abused the daughter physically and mentally, there\nwas evidence that the father did most of the house-cleaning, cooking and\nlaundry. T. 14, 15, 111-112. In addition, the father has a robust\nsupport system through his mother, father, brother and sister-in-law to\nhelp him with the children, T. 37, 45. Descriptions of arguments the\ncouple had while married tend to show the mother’s instability when her\ntemper was aroused. T. 15. On one such occasion, the daughter\nbecame so scared that her aunt, Katie McGregor, arranged for a secret\n“emoji” code the daughter could send if she needed help to reassure her.\nT. 130, 131. Heather Dixon, the counselor who is treating the daughter,\ntestified that the father’s concerns about the welfare of the children in\nthe mother’s hands were valid, especially considering the mother’s\ntemper. T. 89, 96.\nThe appeal should be denied.\nARGUMENT\nThe trial court’s order granting physical custody of the children to\n25\nthe father should be affirmed. First, since the judgment of the trial\ncourt relied on evidence heard by the trial court but not present in the\nrecord, the appellate court cannot disturb the judgment. Bynum v.\nBynum, 296 So. 2d 711, 725 (Ala. Civ. App. 1974). Second, there was\nsubstantial evidence from which the trial court could have found that the\nmother was physically and mentally abusive toward the daughter.\nFinally, there was substantial evidence that granting the father primary\nphysical custody of the children was in their best interest. The divorce\ndecree should be affirmed.\nA. Evidence Heard by the Trial Court is Not Present\nin the Record on Appeal, Requiring the Trial\nCourt’s Judgment to be Affirmed\nIn addition to the final hearing held on November 6, 2023, the Court\nheld a prior pendente lite hearing on September 12, 2023. R. 27. That\nhearing included ore tenus testimony. R. 47. It also included an in\ncamera conversation between the trial judge and the children.\nQ. Okay, and we filed an ex parte thing, and we had\nalready had the hearing on it, I think, where the Judge\nheard from your daughter; is that correct?\nA. Yes, sir.\n26\nT. 13.\nAt the final hearing, the parties agreed that the testimony and\nevidence taken at the pendente lite hearing would be part of the basis\nused by the trial court for making its rulings in the final hearing.\nMr. Young (Counsel for the father):\nAnd, Judge, a lot of these things are what we’ve introduced\nbefore. I don’t know if the Court wants to take judicial notice\nof what you got before, but I’ll be glad to go into them again.\nMr. Radney (Counsel for the mother):\nJudge, I have no objection to you adopting the full-fledged\npendente lite hearing and considering it as a part of this.\nThe Court: All right. Let’s do that.\nMr. Young: That’s fine with me, Judge. Thank you.\nT. 19.\nIn addition, a motion to supplement the record is pending before\nthe trial court. The supplement will state:\nIn addition to the materials contained in the record, as part of\nmaking its decision in the original divorce decree, the Court\nspoke to the minor children separately in chambers without\neither counsel or a court reporter present. This was done\nwith the permission of all parties.\nS1. (The correct record citation will be added once the supplement is\n27\napproved and prepared.)\nNeither the testimony from the pendente lite hearing, nor the\nconversations the judge had with the children, are part of the record on\nappeal. Since the trial judge considered evidence that is not part of the\nappellate record, and since the mother’s grounds for appeal are based on\nthe sufficiency of the evidence, the trial court’s order should be affirmed.\nIn Bynum v. Bynum, 296 So. 2d 722 (Ala. Civ. App. 1974), the Court\nof Civil Appeals reviewed a trial court’s award of custody of a six-year-\nold boy to his father. As part of the hearing, the trial court conducted a\nprivate interview of the child in camera without the parents present. No\none objected. In fact, the trial judge spoke to the child twice, three days\napart. Bynum, 296 So. 2d at 723. The trial judge announced that he\nhad reduced the substance of those two conversations to writing and\nsealed them in an envelope. Id. The writing was to remain secret if\nthere was not an appeal but if an appeal occurred, the judge’s statement\nwas to be placed in the record. Id. The attorney for the mother objected\nto including the statement in the record, but the trial judge put it in\nanyhow. Id. at 723-724. On appeal, the appellate court first explained\n28\nthat “the practice of trial courts interviewing minors In camera in custody\ncases is widespread and well-known and has a beneficent purpose, for it\nis believed that a fuller disclosure can be obtained in such examination\nthan if the child is examined in open court with both parents confronting\nhim.” Id. at 724. The court then observed that “the judgment of a trial\ncourt which is based on evidence heard by it, but which is not included in\nthe record on appeal cannot be disturbed by the appellate court where\none of the grounds of appeal is the sufficiency of the evidence to support\nsaid judgment.” Id. at 725. Thus, it explained, even had the trial court\nNOT placed its written statement into the record, the appellate court\nwould have had to affirm the judgment.\nSimilarly, in the instant case, not only is the conversation the trial\njudge had with the children not in the record, but also the ore tenus\ntestimony taken as part of the pendente lite hearing and incorporated\ninto the final hearing is missing from the record. The judgment should be\naffirmed.\nIn Johnson v. Johnson, 395 So. 2d 1043 (Ala. Civ. App. 1981), the\nappellate court used similar reasoning to affirm an award of the custody\n29\nof two daughters to their father. While recognizing there was “ample\nevidence that the mother is a loving and caring mother,” the court also\nnoted that “there was evidence before the trial court which is not before\nthis court; i.e., the in camera conversation with the children.” Johnson,\n395 So. 2d at 1044. The court continued:\nIt has long been established that this court may not disturb a\ntrial court's finding of fact ‘where there was evidence before\nthe trial court which may have influenced it in arriving at its\nfinding of fact and which is not before us.’\nJohnson, 395 So. 2d at 1044-1045, quoting Hagler v. Hagler, 278 So. 2d\n715 (1973).\nSince the trial considered testimony and evidence in making its\nruling not before the appellate court here, and since the mother’s appeal\nis based on sufficiency of the evidence grounds, the trial court’s opinion\nis due to be affirmed.\nB. There Was Substantial Evidence From Which The\nCourt Could Have Found That The Mother Abused The\nDaughter.\nThe mother argues, somewhat confusingly, that a rebuttable\npresumption that she was not entitled to obtain custody of the children\ndue to domestic abuse was refuted and the trial court erred in granting\n30\nphysical custody to the father. However, the issue before this Court is\nwhether there was substantial evidence from which the trial court could\nhave found it was in the daughter’s best interest for the father to have\nphysical custody of the daughter based on the mother’s treatment of\ndaughter.\n“Determination of child custody rests in the sound discretion of the\ntrial court and the exercise of such discretion will not be reversed except\nfor plain and palpable abuse. Furthermore, there is a strong\npresumption favoring the trial court’s finding in child custody cases.”\nJohnson v. Johnson, 395 So. 2d 1043, 1044 (Ala. Civ. App. 1981). “This\npresumption is based on the trial court’s unique position to directly\nobserve the witnesses and to assess their demeanor and credibility.”\nCorbitt v. Corbitt, 369 So. 2d 1078, 1088 (Ala. Civ. App. 2022).\nIn addition to whatever testimony outside of the record on appeal\nthe judge considered, there was ample testimony in the record to support\na finding that the mother had harmed the daughter both physically and\nmentally. The father testified that the event that triggered his filing for\ndivorce was his personally observing the mother harming the daughter.\n31\nT. 8-9. Walking into a room, the father saw that the mother had the\ndaughter up against the wall, slapping her in the face, hitting her in the\nmouth and then pulling her by the hair into the living room. T. 8-9.\nThe father testified that the mother had told him she felt it was okay to\nslap a child if they smarted off to an adult. T. 9. There were two\nphotographs entered into evidence that showed injuries to the daughter,\nand evidence to support a finding that the mother caused those injuries.\nT. 9, 10, 12. One of the mother’s witnesses testified that the mother\ncalled her to ask if she ever “popped” her daughter in the mouth, and\nduring the conversation heard the father exclaim that regardless of what\nothers did, “you’re not going to slap my child in the face.” T. 219. The\ndaughter’s aunt testified that the daughter was so frightened of her\nmother especially that the aunt and the daughter established an emoji\ncode that the daughter could use to send for help from her phone. T.\n130.\nLisa McGregor’s, the father’s mother, explained that the mother\nfound it frustrating to help the daughter with her homework. As she\nexplained, ““She cannot comprehend that [the daughter’s] not as smart –\n32\neverybody has a different way of learning, I guess, you know, and it takes\na little bit more time for [the daughter.]” T. 113. Lisa also testified that\nthe mother had told her, when trying to help the daughter with her\nhomework, “I can’t do this.” T. 113. Lisa testified that the mother “gets\ntoo frustrated trying to help [the daughter] do homework.” T. 113. Lisa\nhas heard the mother call Addie stupid. T. 114. The father testified\nthat the mother would get “absolutely distraught” helping the daughter\nwith her homework and so would call her “stupid and it would escalate\nfrom there.” T. 41. He has also seen the mother yank food out of the\ndaughter’s hands, telling the daughter she would get fat and doing so\nwould affect her dancing career. T. 41. The father testified that he has\nseen the mother grab one of the family dogs by the neck and fling it onto\nthe floor, while the daughter screamed and told the mother she shouldn’t\nhave done that.” T. 42-43.\nThe daughter’s therapist, Heather Dixon, testified that in her\nprofessional opinion, the daughter has issues with the mother and fears\nher. T. 87. Some actions the daughter told her about concerned Ms.\nDixon enough she reported the mother to DHR, although no further\n33\nactions were taken. T. 88. Ms. Dixon’s concerns about granting the\nmother custody of the children centered on the “alleged abuse.” T. 89.\n“If she is able to become that angry and lose self-control, what may\nhappen to the children?” T. 89. Thus, the therapist believed that the\nfather’s concerns about the welfare of the children were valid. T. 96.\nThe fact that evidence was also adduced to the contrary is not\nenough to overturn the trial court’s ruling. “Appellate courts do not sit\nin judgment of disputed evidence that was presented ore tenus before the\ntrial court in a custody hearing.” Ex parte Bryowski, 676 So. 2d 1322,\n1324 (Ala. 1996). There was substantial evidence to support the award\nof physical custody of the children to the father.\n34\nC. Substantial Evidence Supported the Judge’s Finding That\nIt Was in the Best Interest of the Children to Award the\nFather Custody\nThe factors that a trial judge is to consider in making an initial\naward of custody in a divorce proceeding include the age, character,\nstability, mental and physical health, and the ability to provide for the\nneeds of the children of the people seeking custody. Robinson v.\nRobinson, --- So. 3d ---, No. CL-202-0074, 2024 WL 4098283 at *9 (Ala.\nCiv. App. 2024). A court also may consider the sex and age of the\nchildren. Id. But the “overall focus of the trial court’s decision is the\nbest interests and welfare of the children.” Id., quoting Steed v. Steed,\n877 So. 2d 602, 604 (Ala. Civ. App. 2003). The hearing gave the trial\ncourt more than enough to support its implicit finding that the best\ninterests and welfare of the children lie in granting the father primary\ncustody of the children.\nIn addition to the evidence of mental and physical damage\ndiscussed above, there was testimony that once she lost her job, the\nmother stopped doing anything around the house, leaving dishes in the\nsink and loads of clothes on the bed. T. 14. At that time, the father\n35\nbegan doing most of the house-cleaning with help from his mother. T.\n14. He also did ninety percent of the cooking, including lunch and\ndinner, as well as the grocery shopping. Id. He does about seventy\npercent of the clothes washing as well. Id. The father’s mother\ntestified that the father has a great relationship with both children, helps\nthe daughter with her homework, feeds the children, buys snacks for\nthem, and washes their clothes. T. 112. The father also has a strong\nsupport system that will help him with the children’s needs, including\nhis mother, his father, his brother, and his sister-in-law. T. 37. The\nmother, unfortunately, does not. T. 45. There was evidence showing\nthe father appropriately disciplined the children, such as monitoring the\ndaughter’s cell phone and taking it away from her if necessary. T. 75-\n76.\nThe father continues to live in the marital home, but there is some\nquestion about whether the mother has a permanent residence. She\ntestified that she was living at 341 Sanford Road, a house owned by Tracy\nBrown, who is her friend Porcsha Caldwell’s mother. T. 148, 220.\nHowever, no written lease for the house was put into evidence and on at\n36\nleast one occasion, the mother was asked to find somewhere else to stay\nfor the night. T. 224. The father was concerned that the mother would\nbe sleeping in her car that evening, although he later discovered that the\nmother had stayed with a friend’s brother. T. 44.\nThere also was testimony from which the trial judge could have\nfound that the mother was not emotionally stable. For example, while\nthe mother claimed that the father hit her on the head with a laptop, the\nfather testified that the incident occurred because the mother lost\ncontrol. One day the father was in his office and the mother came\nupstairs screaming and fighting and pushed him out of the computer\nchair, pulling the computer equipment over on top of the two. T. 15.\nThe children saw the fight and were standing there screaming.\nUltimately the daughter went to get the father’s brother for help. T. 15.\nAfter the fight, the mother took the son, leaving the daughter there, and\nleft the house. T. 16.\nOn another occasion, late at night, the mother was in a foul mood,\nso the father went upstairs. T. 42. He was eating a hot dog, and the\nmother came upstairs and slapped the father across the face and slapped\n37\nthe hot dog out of his hand. T. 42. In another incident, the father heard\nthe daughter say, “You shouldn’t have done that,” and he entered the\nroom to discover that the mother had picked up the dog by the neck and\nflung it on the floor. T. 42-43.\nThere was ample evidence in the record on which the trial court\ncould have based its decision that the father should have primary\nphysical custody of the children. The trial court’s divorce decree should\nbe affirmed.\nCONCLUSION\nBased on the foregoing, Christopher Blaine McGregor, the appellee,\nrespectfully requests that the trial judge's order be affirmed. He also\nasks that he be awarded the attorney's fees and costs arising from this\nappeal.\nRespectfully submitted on this the 9th day of January, 2025.\nMORRIS HAYNES\n/s Nancy L. Eady\nNancy L. Eady, EAD004\nAttorney for Christopher Blaine\nMcGregor, Appellee\n3500 Blue Lake Drive\n38\nSuite 200\nBirmingham, Alabama 35243\n(205) 324-4008\nAlso Counsel for Appellee:\nMr. Thomas F. Young\nMorris Haynes\nPost Office Box 1660\nAlexander City, Alabama 35011-1660\nATTORNEY’S FEE DECLARATION\nCOMES NOW the undersigned attorney of record for the Appellee,\nChristopher Blaine McGregor, in this appeal, and declares as follows:\n1. That she has represented the Appellee in this cause through\nthe pendency of this appeal.\n2. That during the pendency of this appeal, she has spent a total\nof 14 hours, billed at the rate of Two Hundred Dollars ($200.00) an hour,\ntotaling $ 2800. This time was accumulated reviewing the clerk’s record\nas well as the transcript, discussions with the client, discussions with\ntrial counsel below, researching case law, drafting the brief and filing the\nbrief.\n3. That, in her judgment, the costs expended by the undersigned\nwere reasonable and proper to defend the issues raised by the Appellant.\n39\nThe Undersigned Attorney further declares that the above claims\nare true and correct and represent the services actually rendered by her\nas attorney, and the amount is due and payable. She further declares\nthat the above claims are not duplications of charges and expenses in any\ncase, companion or otherwise.\nRespectfully submitted on this the 9th day of January, 2025.\nMORRIS HAYNES\n/s Nancy L. Eady\nNancy L. Eady, EAD004\nAttorney for Christopher Blaine\nMcGregor, Appellee\n3500 Blue Lake Drive\nSuite 200\nBirmingham, Alabama 35243\n(205) 324-4008\nAlso Counsel for Christopher Blaine McGregor:\nMr. Thomas F. Young, Jr.\nMorris Haynes\nPost Office Box 1660\nAlexander City, Alabama 35011-1660\n40\nCERTIFICATE OF COMPLIANCE\nPursuant to Alabama Rule of Appellate Procedure 32(d), the\nundersigned certifies that the above document has been prepared using\nCentury Schoolbook 14. The document has 7373 words. The font and\nword count comply with the requirements of Alabama Rule of Appellate\nProcedure 28(j)(1) & 32(a)(7).\nDone on this the 9th day of January, 2025.\n/s Nancy L. Eady\nOf Counsel\n41\nCERTIFICATE OF SERVICE\nI hereby certify that I have served the original brief upon the\nAlabama Court of Civil Appeals via e-filing and have emailed a copy of\nthe same upon the following attorneys of record, which are the following:\nMs. Barbara H. Agricola (barbara@agricolalaw.com)\nMr. Algert S. Agricola, Jr. (al@agricolalaw.com)\nMs. Morgan Caro-Whipple (morgan@agricolalaw.com)\nAgricola Law, L.L.C.\n127 South 8th Street\nOpelika, Alabama 36801\non this the 9th day of January, 2025.\n/s Nancy L. Eady\nOf Counsel\n42",
  "source_metadata": {
    "method": "pdfplumber",
    "pages": 43
  },
  "modified_time": 1759532853.0
}