{
  "doc_id": "f1edbaf6692bab2ae960aba27a9caac65e7793d8f7889e666d08524b42f0bb3b",
  "file_path": "C:\\Users\\blain\\Dropbox\\Master_Court_Files\\02_Transcripts\\2024-07-31_Transcript_BFH_OCR.pdf",
  "file_name": "2024-07-31_Transcript_BFH_OCR.pdf",
  "doc_type": "pdf",
  "date": null,
  "parties": [],
  "raw_text": "State of Alabama\n1\n5th Judicial Circuit\n1 STATE OF ALABAMA\n2 IN THE FIFTH JUDICIAL CIRCUIT COURT\n3 FOR THE COUNTY OF TALLAPOOSA\n4\n5\n6 CHRISTOPHER BLAINE )\n)\n7 MCGREGOR, )\n)\n8 Plaintiff, ) CASE NO.\n) 70-DR-2023-900051.\n9 vs. ) 01\n)\n10 BRITTANY MICHELLE )\n)\n11 GILLILAND, )\n)\n12 Defendant. )\n13\n14\n15 Hearing\n16\n17\n18\nBEFORE:\n19\nTHE HONORABLE STEVEN R. PERRYMAN\n20 395 Lee Street\nAlexander City, AL 35010\n21\nJuly 31st, 2024\n22\n23\n24\n25 By: Brooke F. Head, CCR No. 656\nOfficial Court Reporter\nBrooke F. Head, AL-CCR No. 656\nOfficial Court Reporter\nState of Alabama\n2\n5th Judicial Circuit\n1 APPEARANCES\n2 For the MORRIS HAYNES ATTORNEYS AT\nPlaintiff: LAW\n3 BY: Tom F. Young, Jr., Esq.\n131 Main Street\n4 Alexander City, AL 35010\n5 For the AGRICOLA LAW, LLC\nDefendant: BY: Barbi Agricola, Esq.\n6 (Matt Holdren, Law Clerk)\n127 South 8th Street\n7 Opelika, AL 36801\n8\n9 --oOo--\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\nBrooke F. Head, AL-CCR No. 656\nOfficial Court Reporter\nState of Alabama\n3\n5th Judicial Circuit\n1 PROCEEDINGS\n2 THE COURT: Christopher Blaine McGregor\n3 versus Brittany Gilliland.\n4 MR. YOUNG: Judge, may I take one thing\n5 up? And I meant to mention this yesterday,\n6 but I just thought about this. Following the\n7 judgment in this case in February of this\n8 year, there was a motion to alter, amend, or\n9 vacate filed by Thomas in this case that died\n10 on the vine. Okay?\n11 THE COURT: Right.\n12 MR. YOUNG: Friday, though, I got a\n13 notice of appeal of that final order. Now, I\n14 just want to make sure that this Court is\n15 going to retain enough jurisdiction because\n16 they're asking for contempt on an order that,\n17 now, they're saying shouldn't be in effect.\n18 THE COURT: Have y'all appealed the\n19 order?\n20 MS. AGRICOLA: We filed the notice of\n21 appeal, but until something happens from the\n22 appellate court, we still have to follow the\n23 laws and follow the order as is.\n24 MR. MATT HOLDREN: He's still in\n25 contempt of the order that's in effect.\nBrooke F. Head, AL-CCR No. 656\nOfficial Court Reporter\nState of Alabama\n4\n5th Judicial Circuit\n1 THE COURT: Yeah, but if I hold him in\n2 contempt and the order is overthrown and\n3 said, \"No. That's out the door.\" Then I may\n4 have put him in jail for something that's no\n5 longer valid.\n6 MS. AGRICOLA: Well, then maybe we\n7 could convert this. Instead of a show-cause\n8 hearing to a PDL to maintain because the\n9 problem we've got here, you know, is the time\n10 of an appeal, etc.\n11 THE COURT: Right.\n12 MS. AGRICOLA: But there's been no --\n13 limited visitation since the February order,\n14 which is just damaging the situation.\n15 THE COURT: What's going on with the\n16 visits? I specified what they are. I think\n17 it's what? Week on/week off?\n18 MS. AGRICOLA: Very clearly, you have.\n19 THE COURT: What is happening with\n20 that?\n21 MR. HOLDREN: The mom has seen the\n22 daughter for a few hours on Mother's Day\n23 since the last week of February.\n24 MS. AGRICOLA: Yeah, despite the\n25 Court's clear order.\nBrooke F. Head, AL-CCR No. 656\nOfficial Court Reporter\nState of Alabama\n5\n5th Judicial Circuit\n1 MR. YOUNG: That's just not true.\n2 We've got witnesses. We've got the daughter.\n3 We came up here with everybody we could come\n4 up with.\n5 THE COURT: Is the daughter visiting\n6 according to the schedule?\n7 MR. YOUNG: There has been some issues,\n8 and that's what the resource officer at the\n9 school has talked about. There's been times\n10 when she's gone to pick her up, and the\n11 daughter hasn't wanted to go, and that's\n12 nothing we had anything to do with\n13 interfering with. The school subsequently\n14 called us and said, \"Can you come pick them\n15 up because the daughter's not going with the\n16 father [sic].\" So those kind of things\n17 happen, but it's not anything to do with us.\n18 THE COURT: How old is the daughter?\n19 MS. AGRICOLA: How old is the daughter?\n20 Ten?\n21 MR. YOUNG: Yeah. He's met with the\n22 daughter.\n23 THE COURT: Yeah. I met with her.\n24 MS. AGRICOLA: And dad's like, \"Oh. I\n25 can't make her go.\"\nBrooke F. Head, AL-CCR No. 656\nOfficial Court Reporter\nState of Alabama\n6\n5th Judicial Circuit\n1 THE COURT: I do know how it goes,\n2 personally, because my daughter was in a\n3 nasty divorce, and I know -- I have begged my\n4 grandson to go visit his father because I\n5 know it gets my daughter in trouble, and I\n6 have begged him. \"Charles, you've got to go.\n7 You have got to go.\" \"I'm not going.\" I\n8 mean, I don't know -- you know, I don't know\n9 what you do with that --\n10 MR. MATT HOLDREN: Judge, the --\n11 THE COURT: I'm talking right now.\n12 Hold on just a second.\n13 MR. MATT HOLDREN: I'm sorry.\n14 THE COURT: Thank you. I don't know.\n15 I don't know how to solve that. I mean, but\n16 we can talk to the daughter. I don't mind\n17 talking to her again and letting her know if\n18 she don't do what I tell her she's got to do,\n19 then I may have to change custody. I may\n20 have to do something totally different\n21 because it's going to be -- as I've heard you\n22 say before, the tail don't wag the dog.\n23 MR. YOUNG: Yes, sir.\n24 THE COURT: And it's not going to. A\n25 ten-year-old can't tell us what we're going\nBrooke F. Head, AL-CCR No. 656\nOfficial Court Reporter\nState of Alabama\n7\n5th Judicial Circuit\n1 to do, so y'all might want to talk to her,\n2 and if that's the -- I mean, is that the only\n3 problem is visitation?\n4 MS. AGRICOLA: Yeah.\n5 THE COURT: Yeah. Y'all might want to\n6 talk to her and talk to the father and talk\n7 to her and let her know that she's going to\n8 do it, or I'll entertain doing something\n9 different so that it will be more visitation\n10 than she's doing now.\n11 MR. YOUNG: And, Judge, may I --\n12 THE COURT: Yeah.\n13 MR. YOUNG: There has been an\n14 intervening situation, though.\n15 THE COURT: All right. What is it?\n16 MR. YOUNG: You are aware of the fact\n17 that, based on in camera, that there was\n18 allegations of the abuse and that she told\n19 you about that.\n20 THE COURT: Right, there was.\n21 MR. YOUNG: Subsequently, there has\n22 been another situation where the school now\n23 has called DHR to report bruises on this\n24 child, so there's some legs to the fact that\n25 she's got hesitation about going with mother.\nBrooke F. Head, AL-CCR No. 656\nOfficial Court Reporter\nState of Alabama\n8\n5th Judicial Circuit\n1 It's not just a --\n2 THE COURT: Well, has DHR done\n3 anything? Has anything come of that?\n4 MS. AGRICOLA: No. This is yet another\n5 stunt from before. There's no safety plan in\n6 place, and, of course, it's our position,\n7 Judge, that there's substantial coaching of\n8 the child, a lot of parental alienation. I\n9 mean, substantial because we don't have these\n10 issues with the son, and you know, the\n11 situation is pretty severe, and it's only\n12 going to get worse if there's not something,\n13 some strong discussion or strong talk from\n14 the Court.\n15 THE COURT: Well, let's talk with her,\n16 and y'all can all talk with her. I don't\n17 care, and if need be, we'll have a hearing,\n18 but I don't know --\n19 MR. YOUNG: I wouldn't mind the Court\n20 hearing from her again. She can tell you\n21 about that.\n22 THE COURT: Well, we can go back there\n23 and --\n24 MR. YOUNG: She's a smart girl, as you\n25 know.\nBrooke F. Head, AL-CCR No. 656\nOfficial Court Reporter\nState of Alabama\n9\n5th Judicial Circuit\n1 THE COURT: All right. I'll be back to\n2 y'all in a little bit, and we'll go talk with\n3 her first and see if that resolves it. If\n4 not, then we'll do what we need to do, but,\n5 you know, if it's on appeal, we may not be\n6 doing this anyway, so I don't know.\n7 MS. AGRICOLA: We could do it on at\n8 least a PDL basis. This doesn't need to be a\n9 final, unless it's overturned.\n10 THE COURT: Which I don't think it will\n11 be because 90 percent of it was based on our\n12 hearing in camera, which is not on the\n13 record, and that is the main basis for why I\n14 did what I did is what the girl told me that\n15 won't be on the record, so I don't see a lot\n16 of luck down there, but if there is, there\n17 is, but I don't know that you -- I don't want\n18 to have a two-hour hearing and then be told,\n19 you know, three weeks from now --\n20 MS. AGRICOLA: Well, we know nothing\n21 happens in three weeks in the appellate\n22 court.\n23 THE COURT: Some happen quick, and some\n24 happen in forever.\n25 MS. AGRICOLA: We do have -- I guess --\nBrooke F. Head, AL-CCR No. 656\nOfficial Court Reporter\nState of Alabama\n10\n5th Judicial Circuit\n1 due to the contempt, so even if we can reach\n2 some sort of agreement, there's still the\n3 issue of attorney's fees and the willful\n4 contempt, and I think there's some property\n5 dispute issues as well that would make the\n6 hearing substantially shorter if we can reach\n7 an agreement on the custody and visitation.\n8 THE COURT: If y'all want to talk to\n9 her first before I talk to her, that's fine.\n10 If not, then we'll all talk to her together\n11 and go from there.\n12 MR. YOUNG: Very good, Judge. Thank\n13 you.\n14 THE COURT: All right. See y'all in a\n15 minute.\n16 (Whereupon, a short recess was taken.)\n17 THE COURT: All right. Well, I guess\n18 you know what we're here for. It's about\n19 visitation. What is going on with\n20 visitation?\n21 ADDIE KATE MCGREGOR: Well, I have some\n22 stuff from counseling in here if you --\n23 THE COURT: Okay. You've been going to\n24 counseling? All right. You can just tell\n25 me. What is going on that is interfering\nBrooke F. Head, AL-CCR No. 656\nOfficial Court Reporter\nState of Alabama\n11\n5th Judicial Circuit\n1 with you doing -- you know, I signed an order\n2 that says you are to visit at these times,\n3 and I want to know what's going on with that.\n4 ADDIE KATE MCGREGOR: Well, I just\n5 don't really want to go with my mom because I\n6 just feel like we're not really at that point\n7 yet, and whenever we go to dinner with each\n8 other, she always turns it into an argument,\n9 and she either talks -- she told me on my\n10 birthday -- and she said this is going to be\n11 my life for the next 14 years, and that's not\n12 how I want my life for the next 14 years and\n13 then --\n14 THE COURT: You're ten?\n15 ADDIE KATE MCGREGOR: I'm 12.\n16 THE COURT: 12? Yeah. It won't be 14\n17 years. I mean, you get to decide your own\n18 course when you get on older, so don't worry\n19 about that. That's not an issue. Once\n20 you're a little bit older, like 16, it's hard\n21 to tell a 16-year-old much what to do, but\n22 when you're your age, we get to do that.\n23 Tell me what's wrong that you don't feel like\n24 y'all need to visit yet?\n25 ADDIE KATE MCGREGOR: I have some stuff\nBrooke F. Head, AL-CCR No. 656\nOfficial Court Reporter\nState of Alabama\n12\n5th Judicial Circuit\n1 that I went over with my counselor and stuff.\n2 THE COURT: Okay.\n3 ADDIE KATE MCGREGOR: And it's about --\n4 I talked about school pickups with her.\n5 THE COURT: Okay.\n6 ADDIE KATE MCGREGOR: And I told her\n7 why. I said -- I was telling her how I don't\n8 really want to start my first year of middle\n9 school stressed every other Thursday that my\n10 mom is going to be outside the school and\n11 call the police when I don't want to go\n12 because I'm scared, and then I almost had a\n13 nervous breakdown last year because of my\n14 mom.\n15 THE COURT: What's going on with your\n16 mom that's -- it's okay. It's okay. We just\n17 need to know what's going on, how you feel\n18 and why you feel that way.\n19 ADDIE KATE MCGREGOR: I told her that\n20 no one knows what I really lived through\n21 whenever she was at the house, and no one\n22 understands or feels how scared I am, and I\n23 told her, like, it doesn't go away every\n24 night, and then my dad, he makes me call her\n25 every night and makes me go to dinners with\nBrooke F. Head, AL-CCR No. 656\nOfficial Court Reporter\nState of Alabama\n13\n5th Judicial Circuit\n1 her, but it always turns into a fight, and\n2 then I told her reasons why I'm scared of my\n3 mom is because she hurt me and hid it away\n4 from everyone and made me lie about my marks\n5 and then I told her how I can't even have a\n6 conversation without her lying, and she told\n7 everyone that I was a liar and turned all my\n8 best friends against me, and then when I\n9 tried to explain my feelings and why I'm\n10 scared, she's always says that someone's\n11 telling me to say something and that someone\n12 is telling me what to say and that they're\n13 brainwashing me, and then I told her, I was,\n14 like, I know what she is capable of because I\n15 lived it, and then I told her how I can't get\n16 over what she did to me every night and that\n17 I need time to heal myself before I want to\n18 work on a relationship with her.\n19 THE COURT: What did she do to you\n20 every night?\n21 ADDIE KATE MCGREGOR: Well, whenever I\n22 was laying in bed, I used to have to lock my\n23 bedroom door at night because one night, she\n24 came in, and she got me out of bed, and she\n25 laid me in the floor and tried to smother me,\nBrooke F. Head, AL-CCR No. 656\nOfficial Court Reporter\nState of Alabama\n14\n5th Judicial Circuit\n1 and I couldn't breathe, so that's why I\n2 started locking the door at night, and I have\n3 nightmares all the time that she hurts me\n4 like she did in the past, and then I worry\n5 for my brother, Bennett, because when I was\n6 little, she hurt me, and I didn't know how to\n7 tell anybody, and on Easter, she screamed,\n8 \"I'm never bringing Bennett back,\" with him\n9 hanging out the window, and I'm scared that\n10 she would hurt us both to get even, and then\n11 I put -- every time my dad makes me meet her,\n12 all she wants to do is fight with me, and\n13 then on my birthday, she told me that this is\n14 going to be my life for the next 14 years,\n15 and then she always blames everyone else, and\n16 I just told her that all I want is peace.\n17 That's really all I want.\n18 THE COURT: You wrote all this\n19 yourself?\n20 ADDIE KATE MCGREGOR: Yes.\n21 THE COURT: Did anybody tell you what\n22 to write?\n23 ADDIE KATE MCGREGOR: No, sir. This is\n24 what I wrote.\n25 MS. AGRICOLA: Addie Kate, you said\nBrooke F. Head, AL-CCR No. 656\nOfficial Court Reporter\nState of Alabama\n15\n5th Judicial Circuit\n1 earlier that you met with your counselor this\n2 week, and you were going through the things\n3 that you wrote down in your notebook; is that\n4 right?\n5 ADDIE KATE MCGREGOR: Yeah.\n6 MS. AGRICOLA: Okay. Have you met with\n7 Mr. Young, Mr. Tom, here?\n8 ADDIE KATE MCGREGOR: Yes, ma'am.\n9 MS. AGRICOLA: You have? Okay. How\n10 many times have you met with Mr. Young?\n11 ADDIE KATE MCGREGOR: I think four or,\n12 like, five times.\n13 MS. AGRICOLA: Okay, and what do you\n14 and Mr. Tom talk about?\n15 ADDIE KATE MCGREGOR: We usually just\n16 talk about -- like, he asks me, basically,\n17 why I'm scared of my mom and all that, and\n18 then he was just telling me that everything\n19 is going to be okay and just telling me that\n20 he's going to keep me safe and making me\n21 really comfortable, and he's really a person\n22 that I can trust because he helps me a lot,\n23 and he's just a really good person and --\n24 THE COURT: You're losing credibility\n25 there. Did you get that? I'm just kidding.\nBrooke F. Head, AL-CCR No. 656\nOfficial Court Reporter\nState of Alabama\n16\n5th Judicial Circuit\n1 That was a joke, a bad joke.\n2 MR. YOUNG: That was a barb at me.\n3 That's what he was --\n4 THE COURT: No. That was a bad joke.\n5 MS. AGRICOLA: So I guess what I'm\n6 wondering is -- y'all talked about coming to\n7 Court today; right?\n8 ADDIE KATE MCGREGOR: (Witness nods\n9 head indicating yes.)\n10 MS. AGRICOLA: And is that why you went\n11 to counseling more recently so you could\n12 prepare about what to say in court?\n13 ADDIE KATE MCGREGOR: Well, not prepare\n14 what to say. She helped me not be nervous,\n15 and she told me to always remember that I\n16 know my truth and that I know my worth and\n17 what I'm capable of. That's the three things\n18 that she told me, and she gave me coping\n19 skills in case I ever get nervous.\n20 MS. AGRICOLA: Yeah.\n21 ADDIE KATE MCGREGOR: And it was called\n22 the 5, 4, 3, 2, 1, and I have it in my notes\n23 app to remember it, and it's, basically, five\n24 things you can hear, like, to distract me and\n25 stuff, and then she gave me some, like, games\nBrooke F. Head, AL-CCR No. 656\nOfficial Court Reporter\nState of Alabama\n17\n5th Judicial Circuit\n1 on my phone that I can play if I ever get\n2 nervous and stuff like that.\n3 MS. AGRICOLA: Yeah. What about this?\n4 Do you think you would be open to going to\n5 your counselor with your mom there so you\n6 could talk to her with a counselor there and\n7 work through to get to a point where you do\n8 feel peace?\n9 ADDIE KATE MCGREGOR: Me and my mom\n10 have discussed that, and she told me that she\n11 wasn't going to go to my counselor.\n12 MS. AGRICOLA: Okay. Well, I'm not\n13 worried about what your mom says. I want to\n14 know how you feel. Would you be okay with\n15 that?\n16 ADDIE KATE MCGREGOR: I do want to have\n17 a relationship with my mom, and I want to\n18 make it better, but the things that she's\n19 doing is just kind of pushing me farther away\n20 from her, and I understand she's a mom and\n21 she loves her kids, and I know she loves me,\n22 but it's just she pressures me way too much,\n23 and I try to explain to her why I don't want\n24 to go, but she always tells me that someone's\n25 telling me to say that, and I have, like,\nBrooke F. Head, AL-CCR No. 656\nOfficial Court Reporter\nState of Alabama\n18\n5th Judicial Circuit\n1 coaching sessions and stuff like that.\n2 MS. AGRICOLA: I see. Okay. Well, let\n3 me ask you this. If the judge, you know,\n4 ordered your mom to go to your counselor with\n5 you, would that make you feel better so you\n6 could talk about how you feel so y'all could\n7 repair your relationship?\n8 ADDIE KATE MCGREGOR: Well, I would\n9 love for her to hear my side, but I just\n10 don't know if she'll -- I can't have a real\n11 conversation with her without lying.\n12 MS. AGRICOLA: Okay. Well, let me ask\n13 you this because you know the Judge has\n14 ordered that you're supposed to go spend the\n15 weekend with your mom every other weekend;\n16 right?\n17 ADDIE KATE MCGREGOR: (Witness nods\n18 head indicating yes.)\n19 MS. AGRICOLA: Okay, and make sure you\n20 say yes or no.\n21 ADDIE KATE MCGREGOR: Sorry, yes.\n22 MS. AGRICOLA: It's okay. So if the\n23 Judge, you know, required that your mom go to\n24 counseling so that you could -- to your\n25 counselor with you so that you could feel\nBrooke F. Head, AL-CCR No. 656\nOfficial Court Reporter\nState of Alabama\n19\n5th Judicial Circuit\n1 more comfortable to spending the weekend with\n2 her, would that be a better situation for\n3 you?\n4 ADDIE KATE MCGREGOR: Are you saying,\n5 like, she comes to every single one?\n6 MS. AGRICOLA: No, not every single\n7 one. You would still have your own\n8 counseling time like you normally do, but\n9 there would be extra ones with you and your\n10 mom where you would get to talk about how you\n11 feel.\n12 ADDIE KATE MCGREGOR: Yes, ma'am.\n13 MS. AGRICOLA: Okay. Now, let me ask\n14 you this. Do you think -- I think it's\n15 probably fair to say your parents don't\n16 really get along right now. Is that a fair\n17 statement?\n18 ADDIE KATE MCGREGOR: Yes.\n19 MS. AGRICOLA: And that makes it really\n20 hard for you and Bennett, doesn't it?\n21 ADDIE KATE MCGREGOR: Yes, ma'am.\n22 MS. AGRICOLA: Do you think if you\n23 could work hard to do what the Judge orders;\n24 right? And spend time with her that you\n25 think that would help with your parents\nBrooke F. Head, AL-CCR No. 656\nOfficial Court Reporter\nState of Alabama\n20\n5th Judicial Circuit\n1 getting along?\n2 ADDIE KATE MCGREGOR: I just can't stay\n3 alone with her. I don't know what people\n4 don't understand about that. I can't. I'm\n5 scared. I can't.\n6 MS. AGRICOLA: Okay, so the last\n7 time -- do you remember Mother's Day? Didn't\n8 you spend time with your mom during Mother's\n9 Day?\n10 ADDIE KATE MCGREGOR: Yeah. We were at\n11 the police station, and the police told me --\n12 she yelled at me to get in the car and then\n13 she told me to get up against the car, and\n14 she opened my mom's car door, and she told me\n15 to get in the car, and I told her why I\n16 didn't want to, and then she said if I don't\n17 obey my parents, I'll go to juvenile, and\n18 then she said if I don't -- sorry.\n19 MS. AGRICOLA: It's okay. You're not\n20 in trouble.\n21 THE COURT: It's okay.\n22 ADDIE KATE MCGREGOR: She said if I\n23 don't go with my mom, she's gonna make\n24 paperwork for my mom, and I thought that that\n25 meant my dad was going to go to jail, so\nBrooke F. Head, AL-CCR No. 656\nOfficial Court Reporter\nState of Alabama\n21\n5th Judicial Circuit\n1 that's why I got in the car with my mom, and\n2 I went, and when she took me to Wal-Mart\n3 because she didn't like my outfit, and she\n4 picked out this dress, and I had to change in\n5 the car, and then she took me to her church,\n6 and then after that, she took me and my\n7 brother both to Oskar's, and she invited my\n8 friend, and I got -- I took that as an\n9 opportunity, and I got in their car, and I\n10 rode with them. They rode all the way up to\n11 Auburn, and I wanted to ride back with them,\n12 but Mama said I couldn't because she wanted\n13 me to ride in her car, so I had to ride in\n14 her car, but yeah, that's really all that\n15 happened on Mother's Day.\n16 MS. AGRICOLA: Okay, and that's the\n17 longest time you've spent with her since\n18 probably February; right?\n19 ADDIE KATE MCGREGOR: I would say -- I\n20 don't really remember.\n21 MS. AGRICOLA: You haven't gone for\n22 another weekend since; right?\n23 ADDIE KATE MCGREGOR: No, ma'am.\n24 MS. AGRICOLA: Okay, so when you're\n25 talking about being scared, does your\nBrooke F. Head, AL-CCR No. 656\nOfficial Court Reporter\nState of Alabama\n22\n5th Judicial Circuit\n1 counselor help you with those feelings when\n2 you're around your mom?\n3 ADDIE KATE MCGREGOR: Yes.\n4 MS. AGRICOLA: Okay. When you're with\n5 your dad, does he encourage you to go spend\n6 the weekend with your mom?\n7 ADDIE KATE MCGREGOR: Yes, and he even\n8 -- I remember he said we were going to go eat\n9 dinner with my mom, but on her weekend,\n10 whenever I didn't want to go, and we ate\n11 dinner, and then I went back with him, but\n12 what I'm trying to say is they all try and\n13 help to make me have a relationship with my\n14 mom. They all love my mom.\n15 MS. AGRICOLA: Who's \"they?\"\n16 ADDIE KATE MCGREGOR: Like, my Aunt\n17 Katie, my NaeNae, my Uncle Brian, all of\n18 them.\n19 MS. AGRICOLA: Okay, so then just to\n20 make sure I know what you want, you would be\n21 okay with the Judge making your mom and\n22 requiring your mom to go to your counselor\n23 with you as an extra; right?\n24 ADDIE KATE MCGREGOR: I would be okay\n25 with that so we can work it out. I would\nBrooke F. Head, AL-CCR No. 656\nOfficial Court Reporter\nState of Alabama\n23\n5th Judicial Circuit\n1 like to at least talk because that's what we\n2 always say, \"We need to talk.\" And we never\n3 really do, so maybe counseling will help.\n4 MS. AGRICOLA: Okay, and if the Judge\n5 orders that, then do you think that you could\n6 try hard to be open to building that\n7 relationship with your mama?\n8 ADDIE KATE MCGREGOR: Yes, ma'am.\n9 MS. AGRICOLA: Okay. Do you want a\n10 relationship with your mama?\n11 ADDIE KATE MCGREGOR: I do, but just\n12 right now, I feel like we're not going to\n13 have one because of the stuff that she's done\n14 and the way that she makes me feel.\n15 MS. AGRICOLA: Okay. Well, it sounds\n16 like I bet that y'all could work on that in\n17 counseling. I really do, and if you are open\n18 to that, I think, and I think she wants that,\n19 then I think y'all could be in a totally\n20 different spot soon. Are you open to that?\n21 ADDIE KATE MCGREGOR: Yes.\n22 MS. AGRICOLA: Okay. That makes me\n23 happy to hear that.\n24 MR. YOUNG: Judge, I'm hesitant to\n25 dredge up anything at this point. I mean, I\nBrooke F. Head, AL-CCR No. 656\nOfficial Court Reporter\nState of Alabama\n24\n5th Judicial Circuit\n1 do want the Court to understand that there's\n2 not unreasonable hesitation on her behalf.\n3 She can talk to you about Easter.\n4 THE COURT: Right.\n5 MR. YOUNG: And what happened on that,\n6 but on that visitation and what happened as a\n7 result of the school doing all that. Tell\n8 the Judge about that, and then I'm not going\n9 to dredge into it anymore.\n10 ADDIE KATE MCGREGOR: About Easter?\n11 MR. YOUNG: Uh-huh. (Indicating yes.)\n12 ADDIE KATE MCGREGOR: On Easter, I\n13 wasn't ready. I didn't have, like -- I had\n14 just a sweatshirt on or my PJs because I was\n15 going out there to explain to my mom why I\n16 wasn't going to go with her on Easter, and\n17 Bennett had said he didn't want to go, and I\n18 guess it made her really angry, and she came\n19 and she was trying to give me a hug, and I\n20 didn't want her to give me a hug because she\n21 was angry, and it scared me, and she pulled\n22 me, like, tried to give me a hug, and she dug\n23 her hand -- her fingernails and her hand into\n24 my arm, and I, like, pushed away because it\n25 was hurting me, and then she got mad, and she\nBrooke F. Head, AL-CCR No. 656\nOfficial Court Reporter\nState of Alabama\n25\n5th Judicial Circuit\n1 threw Bennett in the car without him being in\n2 the car seat and drove down the road with\n3 Bennett hanging out the window, and she\n4 yelled, \"I'm never bringing Bennett back.\n5 You'll never see him again.\" And all I could\n6 think the whole day was Bennett flying out\n7 the window and getting ran over. That's all\n8 I could think. It scared me so bad because\n9 Bennett was just hanging out the window, and\n10 it scared me really bad because I thought I\n11 really wasn't going to see Bennett again.\n12 That's another reason why I don't want to go\n13 with my mom because she scares me like that.\n14 MR. YOUNG: And when you went to school\n15 the next day, what happened?\n16 ADDIE KATE MCGREGOR: When I went to\n17 school the next day, my teacher saw the marks\n18 on me, and she asked what happened, and I\n19 told her what happened, and she took me to\n20 the assistant principal and the counselor at\n21 our school and I don't know -- I guess they\n22 called DHR, and then DHR came to the school\n23 and they talked to me, and then they made me\n24 hold a paper and, like, hold it up to my arm\n25 and then took a picture.\nBrooke F. Head, AL-CCR No. 656\nOfficial Court Reporter\nState of Alabama\n26\n5th Judicial Circuit\n1 THE COURT: Okay. All right. Well,\n2 thank you for talking to us. Keep up the\n3 gymnastics.\n4 ADDIE KATE MCGREGOR: Thank you.\n5 MR. YOUNG: You want to tell them how\n6 much -- how good I am one more time?\n7 THE COURT: No. Don't do that.\n8 MR. YOUNG: I want a copy of that\n9 record for sure.\n10 THE COURT: All right. As y'all know,\n11 me and the attorneys have spoken with the\n12 little girl, and for whatever reason, she\n13 feels the things she does. You know, we're\n14 going to try to get to the bottom of it and\n15 see what we can do to work through this and\n16 get relationships better. You know,\n17 temporarily, we're going to go with lunches,\n18 dinners, family, all of you together and try\n19 to get to where visitation gets normalized.\n20 I'm going to order that you attend her\n21 counselor's meetings, some of them, not all\n22 of them, because she definitely wants to go\n23 to some by herself, but, you know, in\n24 counseling and in everything else in dealing\n25 with her and what's going on, everybody's\nBrooke F. Head, AL-CCR No. 656\nOfficial Court Reporter\nState of Alabama\n27\n5th Judicial Circuit\n1 going to have to maintain a cool, calm head\n2 because I know it's frustrating, but you've\n3 got to -- you can't make a bad situation\n4 worse, so just work toward that. When you're\n5 in these sessions with the counselors and\n6 when you're talking to them, be honest. I\n7 mean, you know, I've told them I've had\n8 situations with my grandson where things\n9 happened, and everybody knows it, the little\n10 grandson knows it. The father kept denying\n11 it, and that's made the situation worse, and\n12 actually, finally, two years later, he\n13 admitted it. He said, \"I'm sorry.\" The\n14 situation is a ton better now because he\n15 finally said, \"I shouldn't have done it. You\n16 know, here's what I did, and I shouldn't have\n17 done that.\" Now, that doesn't mean that he\n18 straightened up, but -- he's still doing\n19 stuff that he shouldn't do, but anyway,\n20 things are better, but things can get better,\n21 but it is totally dependent on y'all, and\n22 that is the sweetest -- I mean, she is a --\n23 just a beautiful child and so sweet, and I\n24 couldn't believe how articulate she is. She\n25 just blew me away, but, you know, let's don't\nBrooke F. Head, AL-CCR No. 656\nOfficial Court Reporter\nState of Alabama\n28\n5th Judicial Circuit\n1 mess her up, and that goes to everybody.\n2 Y'all be there for her. I don't care -- if\n3 y'all hate each other, you really can't hide\n4 it from your children, so don't. Life is too\n5 short. Don't hate each other. Y'all don't\n6 have to be married. Y'all don't have to like\n7 each other, but don't hate each other, but\n8 we're going to send everybody to counseling,\n9 and then we'll be back here and see how\n10 things go and see if we can't get things\n11 better.\n12 MR. YOUNG: Judge, may I --\n13 THE COURT: You may.\n14 MR. YOUNG: Do you want to kind of wait\n15 for us to file an order to set when we have\n16 at least moved down the road a little bit\n17 with the counseling and all that so it will\n18 be meaningful?\n19 THE COURT: Yeah. The counselor is\n20 going to do a report, and after y'all have\n21 some indication from the counselor that\n22 things are progressing, and I'm sure Addie\n23 Kate will tell y'all things are better, then\n24 yeah, y'all -- I can't keep y'all from\n25 setting any -- filing a motion to set\nBrooke F. Head, AL-CCR No. 656\nOfficial Court Reporter\nState of Alabama\n29\n5th Judicial Circuit\n1 anything at any given time, but yeah, go\n2 forward.\n3 MS. AGRICOLA: And, Judge, just to make\n4 sure the ball starts moving quickly, we'll\n5 get that proposed order that we work on\n6 together to you.\n7 THE COURT: Perfect.\n8 MS. AGRICOLA: You can think we can do\n9 it by the end of the week?\n10 MR. YOUNG: Sure.\n11 MS. AGRICOLA: Okay, but then just for\n12 the Court to make clear to the parties that\n13 mother is supposed to go to the daughter's\n14 counselor with her.\n15 THE COURT: Right, at least eight/ten\n16 times.\n17 MS. AGRICOLA: I guess, so that should\n18 start immediately regardless of what --\n19 THE COURT: Yes. That needs to start\n20 immediately.\n21 MS. AGRICOLA: Okay.\n22 THE COURT: Yeah. You can call the\n23 counselor and schedule it, and you may want\n24 to go without the daughter a time to talk to\n25 her and then go with the daughter separately.\nBrooke F. Head, AL-CCR No. 656\nOfficial Court Reporter\nState of Alabama\n30\n5th Judicial Circuit\n1 MS. AGRICOLA: And then there's going\n2 to be a separate reunification counselor.\n3 THE COURT: Yeah and then a separate\n4 reunification after we get down the road with\n5 this a little bit and see if we can't get\n6 things better.\n7 MS. AGRICOLA: And then just to make\n8 sure the parties understand -- and please\n9 tell me if I misspeak -- at least weekly\n10 dinners with the entire family?\n11 THE COURT: Yes.\n12 MR. BLAINE MCGREGOR: That's not an\n13 issue. I would go to dinner any time. This\n14 is the only thing that's -- I've had to call\n15 the police to have Brittany removed from my\n16 car. I don't want to do that.\n17 THE COURT: Don't -- all we can do is\n18 go from today. Whatever happened yesterday,\n19 that's yesterday. There's not a thing that\n20 anybody can do about any of it. Y'all get a\n21 chance to start over every single day. Start\n22 over today and see what we can't do to not\n23 screw your child up because she's awesome.\n24 All right. Yeah. Y'all send that to me, and\n25 we'll go from there. Good luck to y'all.\nBrooke F. Head, AL-CCR No. 656\nOfficial Court Reporter\nState of Alabama\n31\n5th Judicial Circuit\n1 MS. AGRICOLA: Thank you.\n2 MR. YOUNG: Thank you, Judge.\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\nBrooke F. Head, AL-CCR No. 656\nOfficial Court Reporter\nState of Alabama\n32\n5th Judicial Circuit\n1 STATE OF ALABAMA:\n2 COUNTY OF TALLAPOOSA:\n3\n4 I hereby certify that the above proceedings\n5 were taken down by me and transcribed by me using\n6 computer-aided transcription and that the above is\n7 a true and correct transcript of said proceedings\n8 taken down by me and transcribed by me.\n9 I further certify that I am neither of kin\n10 nor counsel to any of the parties nor in anywise\n11 financially interested in the outcome of this\n12 case.\n13 I further certify that I am duly licensed by\n14 the Alabama Board of Court Reporting as a\n15 Certified Court Reporter as evidenced by the ABCR\n16 number following my name below.\n17 So certified on this the 31st day of\n18 January, 2025.\n19 /s/BROOKE F. HEAD\nBROOKE F. HEAD, CCR#656\n20 OFFICIAL COURT REPORTER\n21\n22\n23\n24\n25\nBrooke F. Head, AL-CCR No. 656\nOfficial Court Reporter",
  "source_metadata": {
    "method": "pdfplumber",
    "pages": 32
  },
  "modified_time": 1759004513.0
}