{
  "doc_id": "f23d75eb0df4f96b70aedd2a637cb4dd0a18890b229eb151a115c9552741b253",
  "file_path": "C:\\Users\\blain\\Dropbox\\Master_Court_Files\\20_Jan_Contempt_Info\\1.9.26 Affidavit of Christopher Blaine.docx",
  "file_name": "1.9.26 Affidavit of Christopher Blaine.docx",
  "doc_type": "docx",
  "date": null,
  "parties": [],
  "raw_text": "Affidavit of Christopher Blaine McGregor – Response to Motion for Contempt\nBackground\nI, Christopher Blaine McGregor (\"Father\"), am over 19 years of age, reside in Tallapoosa County, Alabama, and am the biological father of A.K.M. and B.M.M. I submit this affidavit in response to Brittany Michelle Gilliland’s (\"Mother\") Motion for Contempt filed 8 January 2026. The motion asserts that I willfully violated the court’s orders regarding Christmas 2025 visitation. I respectfully deny those allegations and set out the facts showing that I complied with every court order and encouraged the children’s relationship with their mother.\nAllegations 1–4 – Holiday‐visitation orders and motions\nMother’s allegation: Mother claims I was required to comply with the holiday schedule in the court’s November 12, 2025, order and that I filed a motion to set aside that order.\nMy response:\nJuly 31, 2024, hearing (Judge Perryman’s oral ruling). After an in-camera interview with our daughter, Judge Steven Perryman restricted Mother’s visitation to weekly family meals. The Court explained that the child felt unsafe; there had been allegations of abuse, and the school later reported bruises. The judge directed that “we’re going to try to get to the bottom of it” and temporarily ordered lunches and dinners with the entire family to normalize visitation and to send both parents to counseling. He insisted that we “start over today” and “see what we can’t do to not screw your child up because she’s awesome”. Mother’s counsel later drafted a written order that did not fully reflect these oral instructions.\nNovember 12, 2025, order. Clarified that neither parent had been deprived of holiday visitation because no written order had suspended it. It did not say that A.K. was emotionally ready for extended holiday time; it simply recognized that a formal order limiting holiday visitation had not yet been entered. I complied with that order by preparing both children for Thanksgiving and Christmas pickups.\nMotion: My motion aimed to ensure the order reflected the Court’s instructions and was not an attempt to deprive Mother of visitation.\n\n\n\nAllegation 5 – “History of blocking visitation”\nMother’s allegation: Mother contends that I have a history of blocking visitation and that I prevented her from exercising Christmas 2025 visitation.\nMy response:\nNo contempt findings and compliance with orders. I have never been found in contempt for denying visitation. During the July 31, 2024, hearing the Court recognized that A.K. was afraid to visit her mother and therefore limited visitation to weekly dinners; the judge encouraged us to attend counseling and did not hold me in contempt.\nFacilitating and encouraging contact. I have consistently encouraged the children’s relationship with their mother. I drove to neutral locations to make visitation happen, rescheduled visits, and shared holidays I was not obligated to share. Examples include:\nExtra time and invitations. I offered the Mother additional Thanksgiving & Halloween visitation in 2024 and hosted A.K.’s birthday party at my home, inviting Mother and her husband despite A.K.’s reluctance. Mother and her husband stayed from about 3 p.m. to 9 p.m.; we shared dinner, cake and ice-cream, and played volleyball, while the Mother was publicly accusing me of alienation on social media as she sat in my living room.\nHospital and Mother’s Day. When Mother gave birth in 2025, I took both children to the hospital with baby gifts and snacks for their Mother so they could meet their new sibling. For Mother’s Day 2025, I helped the children buy presents and offered dinner. Mother declined and took Bennett back to Clanton without spending time with A.K.\nTravel to facilitate contact. I routinely met Mother halfway or at her requested locations. For example, I met her in Prattville for dinner and took the children shopping at Target and a thrift store so she could spend extra informal time with them. On December 21, 2025, I drove both children to Clanton because Mother wanted them to attend her church’s candlelight service. A.K. declined to stay, but Bennett did; afterward I drove an hour to Prattville to have dinner with Mother, her father, husband, and extended family.\n\nConclusion: The Court’s limitations on visitation were based on A.K.’s emotional state, not on any misconduct caused by me. I have made the children available for every visit, reminded them of their mother’s love, and never told them to refuse visitation. I have even invited Mother’s step-children to join us for shopping and dinner to allow her more time with A.K. All these efforts undercut the claim that I have a history of blocking visitation.\nAllegations 6–9 – Communication and scheduling issues around Winterblast\nMother’s allegations: Mother asserts that on December 21, 2025, I told her A.K. had a “extracurricular” trip  December 27 – January 1, 2025, that this “coincidentally” conflicted with her visitation, and that I later mentioned only Bennett when discussing holiday visitation.\nMy response:\nAdvance notice and consent. On December 15, 2025, I texted Mother that A.K. wanted to attend a Winterblast church retreat in Gatlinburg from December 27 to December 30 and that the fee was $200. I asked if she had any problem with A.K. going out of state for the trip. I also sent a screenshot of the church’s Winterblast web page with deposit information. Mother did not voice any objection. On December 26, 2025, I texted Mother again reminding her that A.K. would leave early the next morning and suggested she call A.K. that evening before the long drive. These text messages (attached as Exhibit A) show that I gave Mother timely notice and invited her input.\nDeposit paid in October 2025. To secure A.K.’s place on the trip I paid the $200 deposit to First Baptist Church of Alexander City on October 1, 2025. A copy of the cancelled check (check #137) made payable to FBCAC for $200 is attached as Exhibit B. The memo line notes that the payment is for Addie Kate and matches the amount referenced in my December text.\nHoliday phone call. During a phone call about holiday logistics, I may have referred to Bennett when discussing pickup times. This was not intended to exclude A.K.; both children were present and ready for the exchange. I never stated that A.K. would be withheld. Ultimately, opposing counsel clarified that pickup for Mother’s Christmas time would occur at noon on  December 25th (not 6 p.m.), and I followed that directive.\nCounsel communications. The confusion about the pickup time was resolved when counsel confirmed noon on December 25th; however, Mother filed her contempt motion anyway. Despite the court’s schedule giving her Christmas from noon December 25th until  January 1, 2026, Mother failed to pick up Bennett for her scheduled weekend visitation 2–4 January 2026.\nAllegation 10 – Bennett’s toy and exchange on December 25, 2025\nMother’s allegation: Mother alleges that I asked to delay the holiday exchange by an hour so Bennett could play with his new toy and that I told Bennett his mother refused to let him play, causing him to become upset.\nMy response:\nAt about 11 a.m. on December 25, 2025, I phoned Mother to ask when she would arrive. When she said she was already on her way, I did not insist on a delay. I never told Bennett that his mother refused to let him play. I didn’t tell him he was leaving until his Mother was outside.\nBennett became upset about leaving with his Mother. To ease the transition, I suggested we take a quick photograph on our front porch—everyone briefly “pouting” considering Bennetts mood (photographs included as Exhibit C). I then invited Mother and her husband inside so Bennett could show them his new computer from Santa. The exchange was cordial; I introduced Brittany’s husband to my father. After the kids showed their gifts, we all went back outside. I buckled him into Mother’s vehicle. At no time did I disparage Mother or blame her for Bennett’s emotions. My actions were intended to make the transition pleasant.\nAllegation 11 – Sister helping A.K. pack and leaving the decision to A.K.\nMother’s allegation: Mother claims that my sister assisted A.K. in packing on 25 December 2025 and that I told A.K., “if you want to go you can go,” leaving the decision up to her.\nMy response:\nThe person Mother refers to is my sister-in-law, not my sister. She was not at my home during the exchange. Security footage from her home shows she remained at her own home until after 3 p.m. on Christmas Day—long after the exchange had ended. Only my father was present in the house.\nPacking and conversation. No one was helping A.K. pack at that time—the Winterblast trip did not depart for two days. Both children came outside for the exchange. After taking photographs and inviting Mother inside, I told A.K. that the conversation was between her and her mother; I then returned inside to give them privacy. About ten minutes later A.K. came inside on her own and stated she was not ready to leave. I did not instruct her to return to the house or prevent her from going with her mother. Mother did not attempt further engagement and left without taking A.K. The July 31, 2024, order directed both parents to “parent and not permit the child to control the operations of this Court’s orders.” I complied by encouraging A.K. to go, but I did not physically force her into the car as neither did her Mother.\nAllegations 12–15 – Encouragement of visitation, parental alienation, control of visitation and therapy\nMother’s allegations: Mother alleges that I made “zero attempt” to encourage visitation, engaged in parental alienation, let A.K. control visitation, and blocked court-ordered reunification therapy.\nMy response:\nEncouragement of visitation. I have urged A.K. to attend scheduled dinners and counseling with her mother. I drove the children to Mother’s church service in Clanton on December 21, 2025, and then travelled to Prattville to join Mother’s family for dinner. I facilitated weekly dinners, phone calls and video chats whenever requested. I scheduled medical appointments and school events and informed Mother of them. Mother missed approximately half of the weekly dinners she requested and attended roughly 15 percent of the children’s school and medical appointments.\nA.K.’s emotional state and the Court’s orders. Judge Perryman recognized that A.K. was frightened and ordered a gradual approach. He instructed both parents to attend counseling and told us that there would be a separate reunification counselor later “after we get down the road with this a little bit and see if we can’t get things better”. He emphasized that we should begin with weekly family dinners and that the goal was not to “screw [our] child up”. I followed that directive by making the children available and encouraging them to go. \nParental alienation. I have never disparaged Mother from the children. I facilitated phone calls, and FaceTime call to the point both children get aggravated with me for pushing them to interact with their Mother. I even moved Santa’s visit to December 23rd so Bennett wouldn’t feel conflicted about leaving after only having his gifts for a few hours on Christmas Day. Her absence, not my conduct, has strained her relationship with A.K.\nReunification therapy. After the July 31, 2024, hearing, Judge Perryman directed that therapy proceed gradually and that a separate reunification counselor would be appointed later. Despite that oral ruling, the order drafted by Mother’s counsel appointed Kelly Turner for immediate joint therapy. On August 20, 2024, before any order existed, Ms. Turner texted both parties stating she had already held a session with Mother and would be our court-appointed therapist. I responded that there was no order and asked whether she had a prior relationship with Mother; she did not answer. After the Court signed the order submitted by Mother’s counsel on November 6, 2024,  that appointed Ms. Turner, I ensured A.K. attended every scheduled session. When Ms. Turner scheduled a session that conflicted with A.K.’s long-scheduled pediatric behavioral evaluation, I sent a text on November 12, 2024 asking to reschedule; Ms. Turner refused and told me to communicate only by email. As a result, A.K. missed her medical evaluation that she had been waiting for weeks for. \nTherapist’s conduct. During the first joint session Ms. Turner told A.K. she did not believe Mother had ever hurt her and stated that “the court doesn’t believe you either,” causing A.K. to suffer a panic attack requiring a pediatric visit and anti-anxiety medication. Ms. Turner withdrew in January 2025. On February 12, 2025 (the eve of a hearing) she filed an affidavit accusing me of manipulating the process, despite only having two sessions, never meeting me in person or observing me with my children. My counsel moved to strike her affidavit as one-sided and unsupported.\nSummary: I have complied with all therapy orders. I did not block reunification therapy; rather, I sought to follow the judge’s instructions for gradual reunification and to ensure the therapist was impartial. Once the Court formally appointed Ms. Turner, I took A.K. to every session.\nAllegation 16 – Contempt, attorney’s fees and make-up visitation\nMother’s request: Mother asks the Court to hold me in contempt, award her attorney’s fees and order make-up visitation.\nMy response:\nThe facts above show no willful disobedience. I made the children available for the Christmas 2025 exchange, informed Mother well in advance of A.K.’s church trip, encouraged visitation, facilitated therapy and never disparaged Mother. Mother, on the other hand, has repeatedly missed scheduled dinners, phone calls, medical appointments and school events; she is currently five months behind on child support and has not paid one dollar since our divorce towards her 50 percent share of medical expenses. She remarried while our divorce was on appeal (contrary to our divorce decree), relocated 60 miles away to Clanton without notice, travels 1 hour 25 minutes each way on school days with Bennett, and sold items on Facebook Marketplace that she later claimed prevented her from giving A.K. for Christmas. These actions demonstrate a lack of respect for the Court’s orders.\nI respectfully request that the Court deny Mother’s motion for contempt, confirm my compliance, and consider entering a protective order to prevent further baseless filings. I also request that Mother be ordered to pay my reasonable attorney’s fees incurred in defending this action.\nConclusion\nI declare under penalty of perjury that the foregoing is true and correct to the best of my knowledge. I have complied with every court order, informed Mother of all relevant plans, and encouraged the children’s relationship with her. A.K.’s distrust stems from Mother’s conduct—including a July 2023 incident that left bruises—and from repeated missed opportunities since the July 31, 2024, order. I continue to facilitate contact, but I cannot force a frightened child to overcome trauma overnight. The attached exhibits (text messages, deposit check and photographs) corroborate my statements. Mother’s motion mischaracterizes events and overlooks her own failures to engage. For these reasons I respectfully request that the motion be denied and that my compliance and good-faith efforts be recognized.\n\nExhibits\nExhibit A – Text message screenshots (December 15 and December 26, 2025) showing that I informed Mother about A.K.’s Winterblast trip, its dates and cost, and requested her input. Mother did not object.\nExhibit B – Cancelled check dated 1 October 2025 payable to FBCAC in the amount of $200.00 for A.K.’s Winterblast deposit.\nExhibit C – Photographs from the Christmas Day exchange, showing me inviting Mother inside and attempting to make the transition pleasant.\n\n\n\n\n\nExhibit A – Text message\n\n\n\n\n\n\n\n\n\n\nExhibit B – Cancelled check \n\n\n\nExhibit C – Photographs from the Christmas Day exchange\n \nExhibit C – Photographs from the Christmas Day exchange",
  "source_metadata": {
    "method": "python-docx",
    "size": 1710084,
    "modified_time": 1767981340.0
  },
  "modified_time": 1767981340.0
}